{
  ";": 78975,
  "(": 52331,
  ")": 52323,
  "i": 38783,
  "=": 37478,
  "int": 33361,
  "[": 30118,
  "]": 30115,
  "0": 29596,
  "<<": 28410,
  ",": 27079,
  "1": 23556,
  ">>": 23309,
  "n": 23207,
  "if": 22649,
  "cout": 21401,
  "++": 20213,
  "cin": 19772,
  "endl": 17523,
  "for": 16984,
  "a": 16729,
  "\"": 16522,
  "{": 16154,
  "}": 16153,
  "<": 15976,
  "return": 15660,
  "==": 15521,
  "-": 15269,
  "main()": 13938,
  "+": 13747,
  "long": 12514,
  "'": 11621,
  "else": 11404,
  "j": 10703,
  "0;": 10120,
  "s": 9053,
  "2": 8994,
  "b": 8703,
  "*": 8014,
  "x": 8001,
  "<=": 7994,
  ".": 7830,
  ">": 7771,
  "while": 7377,
  "k": 7053,
  "ans": 6069,
  "+=": 6048,
  "m": 5921,
  "%": 5735,
  "&&": 5566,
  "/": 5429,
  "c": 5181,
  "string": 4998,
  "!=": 4160,
  "t": 4047,
  "--": 3838,
  "y": 3812,
  "char": 3611,
  ">=": 3575,
  "main": 3574,
  "size": 3284,
  "l": 3158,
  "break": 2952,
  "\\n": 2949,
  "3": 2859,
  "d": 2844,
  "sum": 2442,
  "10": 2313,
  "p": 2305,
  "bool": 2278,
  "||": 2274,
  "const": 2269,
  "r": 2256,
  "4": 2216,
  "NO": 2138,
  "v": 2115,
  "min": 2075,
  "max": 2063,
  "!": 2061,
  "YES": 2009,
  "N": 2009,
  "5": 1943,
  "do": 1894,
  "arr": 1765,
  "-=": 1754,
  "cnt": 1730,
  "true": 1687,
  "length": 1632,
  "vector": 1532,
  "gets": 1474,
  "false": 1403,
  "f": 1348,
  "sort": 1333,
  "str": 1332,
  "flag": 1329,
  "7": 1329,
  "push_back": 1323,
  "end": 1209,
  "abs": 1196,
  "begin": 1134,
  "temp": 1131,
  ":": 1106,
  "q": 1082,
  "void": 1074,
  "res": 1061,
  "getchar": 1058,
  "z": 1045,
  "num": 1029,
  "count": 1020,
  "?": 1015,
  "continue": 979,
  "/=": 964,
  "A": 935,
  "maxn": 894,
  "h": 891,
  "100": 868,
  "s1": 760,
  "len": 748,
  "&": 740,
  "6": 737,
  "mod": 728,
  "x1": 720,
  "w": 707,
  "*=": 686,
  "u": 663,
  "double": 661,
  "e": 654,
  "YES\\n": 653,
  "memset": 648,
  "x2": 640,
  "sizeof": 632,
  "8": 631,
  "s2": 602,
  "map": 597,
  "1e9": 587,
  "y1": 586,
  "and": 583,
  "S": 577,
  "mp": 576,
  "9": 575,
  "push": 564,
  "insert": 562,
  "NO\\n": 554,
  "g": 545,
  "getline": 540,
  "dp": 535,
  "ch": 523,
  "1000": 520,
  "puts": 518,
  "y2": 516,
  "105": 506,
  "R": 506,
  "set": 504,
  "tmp": 503,
  "gcd": 487,
  "%=": 486,
  " ": 486,
  "L": 467,
  "B": 455,
  "mx": 449,
  "M": 431,
  "D": 429,
  "find": 412,
  "-1": 401,
  "check": 400,
  "strlen": 396,
  "first": 396,
  "t1": 394,
  "vis": 384,
  "pos": 380,
  "o": 375,
  "it": 372,
  "second": 369,
  "101": 367,
  "::": 365,
  "MOD": 362,
  "26": 360,
  "INF": 359,
  "t2": 342,
  "T": 336,
  "solve": 326,
  "st": 324,
  "substr": 319,
  "#": 319,
  "0x3f3f3f3f": 314,
  "a1": 303,
  "to": 300,
  "p2": 298,
  "ok": 298,
  "cur": 295,
  "val": 294,
  "C": 294,
  "1e5": 292,
  "p1": 290,
  "12": 289,
  "swap": 285,
  "sqrt": 261,
  "c1": 261,
  "20": 260,
  "read": 259,
  "No": 258,
  "Yes": 256,
  "get": 252,
  "mn": 251,
  "110": 246,
  "result": 246,
  "ar": 245,
  "dfs": 243,
  "mid": 241,
  "K": 241,
  "xx": 239,
  "100005": 238,
  "sum1": 231,
  "|": 226,
  "is": 226,
  "inf": 225,
  "1000000007": 224,
  "at": 221,
  "a2": 219,
  "MAX": 217,
  "100000": 216,
  "MAXN": 214,
  "1005": 214,
  "minn": 212,
  "30": 210,
  "15": 210,
  "erase": 209,
  "now": 209,
  "c2": 209,
  "ret": 207,
  "U": 206,
  "strings": 205,
  "ceil": 204,
  "l1": 203,
  "prime": 203,
  "11": 201,
  "clear": 200,
  "sum2": 200,
  "ss": 197,
  "l2": 195,
  "200": 191,
  "__gcd": 191,
  "v1": 189,
  "unsigned": 188,
  "pop": 183,
  "iterator": 181,
  "pair": 181,
  "total": 180,
  "start": 178,
  "inline": 178,
  "reverse": 175,
  "print": 173,
  "ans1": 172,
  "25": 171,
  "stop": 171,
  "\\0": 169,
  "last": 169,
  "ma": 169,
  "x3": 168,
  "counter": 167,
  "in": 167,
  "1.0": 166,
  "ans2": 165,
  "dy": 164,
  "the": 162,
  "acos": 161,
  "INT_MAX": 161,
  ">>=": 161,
  "yy": 160,
  "maxx": 159,
  "n1": 157,
  "G": 157,
  "top": 153,
  "idx": 152,
  "create": 151,
  "50": 150,
  "b1": 150,
  "1LL": 149,
  "60": 149,
  "new": 149,
  "k1": 146,
  "1001": 145,
  "48": 145,
  "maxi": 145,
  "one": 141,
  "name": 140,
  "cont": 139,
  "P": 137,
  "left": 137,
  "W": 137,
  "tot": 135,
  "10000": 134,
  "n2": 134,
  "^": 133,
  "input": 132,
  "dx": 131,
  "d1": 131,
  "d2": 128,
  "1e6": 127,
  "y3": 126,
  "exit": 126,
  "180": 126,
  "aux": 125,
  "Z": 124,
  "Friendship": 124,
  "|=": 123,
  "empty": 122,
  "k2": 122,
  "O": 121,
  "strcmp": 121,
  "-1\\n": 120,
  "row": 120,
  "PI": 119,
  "1000000": 118,
  "col": 118,
  "pi": 116,
  "r1": 116,
  "100001": 116,
  "right": 115,
  "ct": 115,
  "h1": 114,
  "index": 113,
  "100010": 112,
  "->": 112,
  "31": 112,
  "out": 112,
  "mark": 112,
  "360": 112,
  "or": 111,
  "X": 110,
  "I": 110,
  "otherwise": 110,
  "s3": 108,
  "make_pair": 108,
  "id": 107,
  "vec": 107,
  "v2": 107,
  "lcm": 107,
  "Y": 107,
  "time": 106,
  "r2": 106,
  "ind": 105,
  "tolower": 105,
  "998244353": 104,
  "cnt1": 104,
  "flag1": 103,
  "aa": 102,
  "sz": 101,
  "f1": 100,
  "pow": 100,
  "h2": 99,
  "front": 99,
  "str1": 99,
  "32": 98,
  "Q": 98,
  "answer": 96,
  "da": 96,
  "float": 95,
  "power": 95,
  "max1": 91,
  "f2": 90,
  "97": 90,
  "First": 90,
  "mm": 89,
  "55": 89,
  "rbegin": 88,
  "used": 88,
  "t0": 88,
  "str2": 87,
  "Second": 87,
  "value": 86,
  "2e5": 84,
  "pr": 84,
  "declare": 84,
  "pt": 83,
  "b2": 82,
  "": 81,
  "low": 81,
  "num2": 81,
  "priority_queue": 81,
  "V": 81,
  "loop": 81,
  "dif": 80,
  "init": 80,
  "back": 80,
  "H": 79,
  "size_t": 78,
  "num1": 78,
  "q1": 78,
  "nn": 78,
  "qm": 78,
  "1e18": 77,
  "adj": 77,
  "F": 76,
  "EPS": 76,
  "judge": 75,
  "1010": 75,
  "m1": 75,
  "table": 75,
  "cnt2": 75,
  "ara": 75,
  "diff": 74,
  "a3": 74,
  "p3": 74,
  "rs": 73,
  "cost": 73,
  "visited": 73,
  "unique": 73,
  "bb": 72,
  "base": 72,
  "ii": 72,
  "eps": 71,
  "200005": 71,
  "0\\n": 71,
  "1\\n": 70,
  "db": 70,
  "1000000000": 69,
  "rem": 69,
  "queue": 69,
  "mini": 69,
  "flag2": 68,
  "cmp": 68,
  "number": 68,
  "q2": 68,
  "character": 68,
  "min2": 67,
  "ex": 67,
  "13": 67,
  "curr": 66,
  "npos": 64,
  "then": 64,
  "mi": 63,
  "my": 63,
  "fixed": 63,
  "value1": 63,
  "Max": 62,
  "freq": 62,
  "jj": 62,
  "no": 62,
  "1e-9": 61,
  "rest": 61,
  "^=": 61,
  "zero": 61,
  "line": 61,
  "div": 61,
  "red": 61,
  "int64_t": 60,
  "let": 60,
  "max_element": 60,
  "toupper": 60,
  "output": 60,
  "append": 60,
  "next": 58,
  "Yes\\n": 58,
  "No\\n": 58,
  "pre": 58,
  "sm": 58,
  "Mishka": 58,
  "#Color": 58,
  "2e9": 57,
  "cr": 57,
  "pic": 57,
  "Chris": 57,
  "ALMOST": 56,
  "tt": 56,
  "nl": 56,
  "rat": 56,
  "man": 56,
  "match": 56,
  "rend": 55,
  "two": 55,
  "po": 55,
  "Mahmoud": 55,
  "Ehab": 55,
  "resize": 54,
  "500": 54,
  "add": 54,
  "kk": 54,
  "Dp": 54,
  "tc": 54,
  "blue": 54,
  "step": 53,
  "isprime": 53,
  "102": 53,
  "co": 53,
  "be": 53,
  "can": 52,
  "register": 52,
  "head": 52,
  "word": 52,
  "count1": 52,
  "green": 52,
  "SEGMENT": 52,
  "IMPOSSIBLE": 52,
  "TRIANGLE": 52,
  "51": 51,
  "data": 51,
  "28": 51,
  "21": 51,
  "child": 51,
  "freopen": 51,
  "woman": 51,
  "valid": 50,
  "up": 50,
  "INT_MIN": 50,
  "yu2": 50,
  "minx": 50,
  "pri": 50,
  "arr2": 50,
  "t3": 50,
  "np": 50,
  "la": 49,
  "win": 49,
  "goto": 49,
  "hh": 49,
  "i2": 49,
  "cek": 49,
  "fast": 49,
  "array": 49,
  "1000005": 49,
  "arr1": 49,
  "Time": 49,
  "RIGHT": 48,
  "floor": 48,
  "27": 48,
  "10005": 48,
  "a0": 48,
  "se": 48,
  "pop_back": 48,
  "Grades": 48,
  "Correct": 48,
  "ty": 47,
  "201": 47,
  "found": 47,
  "pa": 47,
  "yes": 47,
  "compare": 47,
  "lb": 46,
  "test": 46,
  "flg": 46,
  "Power": 46,
  "24": 46,
  "from": 46,
  "w1": 46,
  "cod": 46,
  "250": 46,
  "Anton": 46,
  "Danik": 46,
  "vv": 45,
  "black": 45,
  "am": 45,
  "10000000": 45,
  "mat": 45,
  "Impossible": 45,
  "111": 45,
  "min1": 45,
  "value2": 45,
  "v0": 45,
  "magic!^^": 45,
  "Malvika": 45,
  "Akshat": 45,
  "tx": 44,
  "dist": 44,
  "suma": 44,
  "primes": 44,
  "precision": 44,
  "isPrime": 44,
  "23": 44,
  "dis": 44,
  "an": 44,
  "2/3": 44,
  "ns": 43,
  "len1": 43,
  "2000": 43,
  "sol": 43,
  "nums": 43,
  "E": 43,
  "greater": 43,
  "point": 43,
  "mins": 43,
  "l3": 42,
  "isdigit": 42,
  "dm": 42,
  "high": 42,
  "0LL": 42,
  "stack": 42,
  "fabs": 42,
  "ne": 42,
  "200000": 42,
  "22": 42,
  "150": 42,
  "assign": 42,
  "isok": 41,
  "prev": 41,
  "UP": 41,
  "DOWN": 41,
  "Space": 41,
  "Soul": 41,
  "Reality": 41,
  "Mind": 41,
  "captain": 41,
  "fa": 41,
  "RU": 41,
  "WITH": 41,
  "IGNORE": 41,
  "CHAT": 41,
  "Oh,": 41,
  "calc": 40,
  "ay": 40,
  "1000000009": 40,
  "i1": 40,
  "setprecision": 40,
  "2005": 40,
  "m2": 40,
  "Ron": 40,
  "1e3": 40,
  "120": 40,
  "day": 40,
  "LD": 40,
  "LU": 40,
  "RD": 40,
  "visit": 39,
  "ci": 39,
  "Black": 39,
  "lucky": 39,
  "cw": 39,
  "86400": 39,
  "Karen": 39,
  "ignore": 38,
  "putchar": 38,
  "yu1": 38,
  "points": 38,
  "isupper": 38,
  "tab": 38,
  "u1": 38,
  "tb": 38,
  "240": 38,
  "ccw": 38,
  "Sheldon": 38,
  "Leonard": 38,
  "Penny": 38,
  "Rajesh": 38,
  "Howard": 38,
  "that": 38,
  "chest": 38,
  "biceps": 38,
  "Oh": 38,
  "become": 38,
  "both": 37,
  "forward": 37,
  "len2": 37,
  "temp1": 37,
  "exp": 37,
  "35": 37,
  "19": 37,
  "ff": 37,
  "sieve": 37,
  "price": 37,
  "Tetrahedron": 37,
  "Cube": 37,
  "Octahedron": 37,
  "Dodecahedron": 37,
  "Vasya": 37,
  "short": 36,
  "strstr": 36,
  "backward": 36,
  "cal": 36,
  "fl": 36,
  "s4": 36,
  "days": 36,
  "2.0": 36,
  "chair": 36,
  "u2": 36,
  "orange": 36,
  "Tie": 36,
  "Misha": 36,
  "205": 35,
  "color": 35,
  "score": 35,
  "PRINT": 35,
  "as": 35,
  "need": 35,
  "nx": 35,
  "LEFT": 35,
  "yellow": 35,
  "beginning": 35,
  "ti": 34,
  "inp": 34,
  "Min": 34,
  "node": 34,
  "stdout": 34,
  "min3": 34,
  "J": 34,
  "brr": 34,
  "ra": 34,
  "go": 34,
  "current": 34,
  "purple": 34,
  "ta": 34,
  "HIM!": 34,
  "+------------------------+": 34,
  "guy.": 34,
  "keyboard!": 34,
  "0.0": 33,
  "300": 33,
  "2147483647": 33,
  "all": 33,
  "18": 33,
  "16": 33,
  "stdin": 33,
  "fun": 33,
  "200001": 33,
  "p4": 33,
  "HER!": 33,
  "msk": 32,
  "pw": 32,
  "spf": 32,
  "cx": 32,
  "cy": 32,
  "1e7": 32,
  "even": 32,
  "ch1": 32,
  "ab": 32,
  "max2": 32,
  "bound": 32,
  "T1": 32,
  "home": 32,
  "ql": 32,
  "qr": 32,
  "lol": 31,
  "digit": 31,
  "1ll": 31,
  "cou": 31,
  "MAX_N": 31,
  "by": 31,
  "rock": 31,
  "1/2": 31,
  "ts": 30,
  "oo": 30,
  "&=": 30,
  "fin": 30,
  "kol": 30,
  "dig": 30,
  "soma": 30,
  "bl": 30,
  "d3": 30,
  "distance": 30,
  "en": 30,
  "Icosahedron": 30,
  "cc": 30,
  "scissors": 30,
  "paper": 30,
  "pop_front": 30,
  "white": 29,
  "5005": 29,
  "done": 29,
  "temp2": 29,
  "20000": 29,
  "5001": 29,
  "rec": 29,
  "next_permutation": 29,
  "sub": 29,
  "fact": 29,
  "MX": 29,
  "1000001": 29,
  "O-|-OOOO": 29,
  "book": 29,
  "TEAM": 29,
  "R\\n": 29,
  "_b": 28,
  "down": 28,
  "hy": 28,
  "hor": 28,
  "trees": 28,
  "ed": 28,
  "e1": 28,
  "1e8": 28,
  "c_str": 28,
  "200010": 28,
  "Hermione": 28,
  "pm": 28,
  "mask": 28,
  "fb": 28,
  "change": 28,
  "122": 28,
  "Equal": 28,
  "call": 28,
  "[]": 28,
  "sqr": 27,
  "sa": 27,
  "sb": 27,
  "0.5": 27,
  "hm": 27,
  "have": 27,
  "req": 27,
  "setf": 27,
  "40": 27,
  "b3": 27,
  "numberOfPartialAns": 27,
  "stringstream": 27,
  "min_element": 27,
  "remove": 27,
  "mymap": 27,
  "contest": 27,
  "Dasha": 27,
  "Masha": 27,
  "UR": 27,
  "..": 27,
  "Terminate": 27,
  "128": 26,
  "c3": 26,
  "hasil": 26,
  "29": 26,
  "2001": 26,
  "tp": 26,
  "mult": 26,
  "Next": 26,
  "ml": 26,
  "ms": 26,
  "lfp": 26,
  "re": 26,
  "qwertyuiopasdfghjkl;zxcvbnm,./": 26,
  "dir": 26,
  "Alice": 26,
  "Bob": 26,
  "DL": 26,
  "65": 26,
  "TIE": 26,
  "#Black&White": 26,
  "A\\n": 26,
  "love": 26,
  "hate": 26,
  "1e-8": 25,
  "itr": 25,
  "ui": 25,
  "save": 25,
  "10001": 25,
  "hi": 25,
  "ada": 25,
  "cycles": 25,
  "vetor": 25,
  "rep": 25,
  "par": 25,
  "like": 25,
  "mas": 25,
  "transform": 25,
  "5000": 25,
  "2000000": 25,
  "103": 25,
  "odd": 25,
  "tar": 25,
  "sx": 25,
  "sy": 25,
  "n3": 25,
  "***": 25,
  "1/6": 25,
  "WINS": 25,
  "flog": 24,
  "1e-6": 24,
  "sc": 24,
  "cnt0": 24,
  "cad": 24,
  "atkm": 24,
  "1e2": 24,
  "1e4": 24,
  "ad": 24,
  "letter": 24,
  "has": 24,
  "work": 24,
  "bs": 24,
  "pl": 24,
  "minimum": 24,
  "digits": 24,
  "path": 24,
  "100100": 24,
  "parent": 24,
  "op": 24,
  "maxa": 24,
  "DP": 24,
  "type": 24,
  "lower": 24,
  "undefined": 24,
  "TESTS": 24,
  "Incorrect": 24,
  "yes\\n": 24,
  "count2": 24,
  "of": 24,
  "1e-7": 23,
  "P1": 23,
  "maxm": 23,
  "stu": 23,
  "def": 23,
  "pal": 23,
  "sushu": 23,
  "3e5": 23,
  "fill": 23,
  "cap": 23,
  "major": 23,
  "minor": 23,
  "strange": 23,
  "dfs2": 23,
  "14": 23,
  "ck": 23,
  "123": 23,
  "md": 23,
  "num3": 23,
  "res1": 23,
  "resp": 23,
  "v3": 23,
  "board": 23,
  "make": 23,
  "boolean": 23,
  "modulo": 23,
  "400": 23,
  "Too": 23,
  "GOTO": 23,
  "strcpy": 22,
  "fantasy": 22,
  "ac": 22,
  "1000006": 22,
  "neg": 22,
  "96": 22,
  "lo": 22,
  "newdp": 22,
  "br": 22,
  "visit1": 22,
  "run": 22,
  "bc": 22,
  "names": 22,
  "pref": 22,
  "ch2": 22,
  "tem": 22,
  "sumb": 22,
  "rx": 22,
  "e2": 22,
  "O-|": 22,
  "\\": 22,
  "64": 22,
  "Still": 22,
  "O.": 22,
  "ls": 21,
  "atky": 21,
  "2\\n": 21,
  "res_x": 21,
  "res_y": 21,
  "cn": 21,
  "~": 21,
  "lower_bound": 21,
  "mul": 21,
  "level": 21,
  "mmap": 21,
  "notes": 21,
  "2e6": 21,
  "possible": 21,
  "cs": 21,
  "sl": 21,
  "winner": 21,
  "r3": 21,
  "w2": 21,
  "ny": 21,
  "dr": 21,
  "target": 21,
  "ifstream": 21,
  "ctr": 21,
  "upper": 21,
  "father": 21,
  "no\\n": 21,
  "90": 21,
  "chars": 21,
  "DR": 21,
  "UL": 21,
  "constant": 21,
  "weak": 21,
  "|.|)": 21,
  "1/3": 21,
  "1/1": 21,
  "search": 20,
  "comp": 20,
  "coun": 20,
  "atk": 20,
  "inv": 20,
  "dd": 20,
  "equal": 20,
  "hit": 20,
  "dem": 20,
  "maxl": 20,
  "atoi": 20,
  "nextDiv": 20,
  "ry": 20,
  "slen": 20,
  "MIN": 20,
  "store": 20,
  "EASY": 20,
  "HARD": 20,
  "plus": 20,
  "nb": 20,
  "305": 20,
  "sum3": 20,
  "qi": 20,
  "5.0": 20,
  "Mishka\\n": 20,
  "characters": 20,
  "Nikita": 20,
  "Olya": 20,
  "Slava": 20,
  "Ann": 20,
  "Danil": 20,
  "Vasilisa.": 20,
  "qwertyuiopasdfghjkl": 20,
  "5/6": 20,
  "RIGHT\\n": 19,
  "1100": 19,
  "ver": 19,
  "log2": 19,
  "MN": 19,
  "huiwen": 19,
  "exgcd": 19,
  "numberOfStudents": 19,
  "9999999": 19,
  "cards": 19,
  "output.txt": 19,
  "graph": 19,
  "same": 19,
  "mn2": 19,
  "on": 19,
  "bfs": 19,
  "52": 19,
  "hello": 19,
  "ai": 19,
  "impossible": 19,
  "position": 19,
  "undefined\\n": 19,
  "1000010": 19,
  "variable": 19,
  "Rozdil": 19,
  "-O|OOO-O": 19,
  "TRIANGLE\\n": 19,
  "Read": 19,
  "int_r": 18,
  "name2": 18,
  "fr": 18,
  "rows": 18,
  "ll": 18,
  "saturday": 18,
  "sunday": 18,
  "monday": 18,
  "tuesday": 18,
  "wednesday": 18,
  "thursday": 18,
  "friday": 18,
  "White": 18,
  "9223372036854775807": 18,
  "ssj": 18,
  "static": 18,
  "pp": 18,
  "pd": 18,
  "ba": 18,
  "1000003": 18,
  "islower": 18,
  "rot": 18,
  "x4": 18,
  "poww": 18,
  "root": 18,
  "62": 18,
  "grid": 18,
  "res2": 18,
  "upper_bound": 18,
  "menor": 18,
  "10010": 18,
  "l4": 18,
  "na": 18,
  "divis": 18,
  "-O|": 18,
  "PRINT ": 18,
  "S1": 18,
  "ULDR": 18,
  "pq": 18,
  "move": 17,
  "lens": 17,
  "sq": 17,
  "dc": 17,
  "100000000": 17,
  "turn": 17,
  "999999": 17,
  "Input": 17,
  "Solve": 17,
  "_n": 17,
  "AB": 17,
  "BA": 17,
  "val2": 17,
  "lim": 17,
  "tri": 17,
  "C#": 17,
  "D#": 17,
  "F#": 17,
  "G#": 17,
  "answ": 17,
  "update": 17,
  "1e10": 17,
  "mo": 17,
  "17": 17,
  "primeFactures": 17,
  "maxN": 17,
  "nc": 17,
  "blyat": 17,
  "GCD": 17,
  "summ": 17,
  "Md": 17,
  "Hanako": 17,
  "Ciel": 17,
  "max3": 17,
  "prog": 17,
  "LEFT\\n": 17,
  "best": 17,
  "file": 17,
  "#.": 17,
  "decrement": 17,
  "it\\n": 17,
  "ln": 16,
  "count_n": 16,
  "currnum": 16,
  "cp": 16,
  "ios": 16,
  "lg": 16,
  "wi": 16,
  "chr": 16,
  "505": 16,
  "myMap": 16,
  "nxt": 16,
  "wei": 16,
  "mk": 16,
  "assert": 16,
  "59": 16,
  "dfs1": 16,
  "workdays": 16,
  "ip": 16,
  "tmp2": 16,
  "dia": 16,
  "mie": 16,
  "Arr": 16,
  "tag": 16,
  "Sentence": 16,
  "numb": 16,
  "cerr": 16,
  "mn1": 16,
  "wt": 16,
  "skills": 16,
  "numDiv": 16,
  "Now": 16,
  "ansx": 16,
  "sw": 16,
  "indx": 16,
  "Ehab\\n": 16,
  "ax": 16,
  "nuts": 16,
  "box": 16,
  "Bob\\n": 16,
  "S2": 16,
  "Incorrect\\n": 16,
  "Correct\\n": 16,
  "vs": 16,
  "commamd": 16,
  "myset": 16,
  "-O|-OOOO": 16,
  "lent": 15,
  "black\\n": 15,
  "99999999": 15,
  "256": 15,
  "count0": 15,
  "xd": 15,
  "sta": 15,
  "127": 15,
  "32767": 15,
  "tou": 15,
  "edges": 15,
  "fnd": 15,
  "max_i": 15,
  "fs": 15,
  "input.txt": 15,
  "rd": 15,
  "bk": 15,
  "Maxn": 15,
  "5e5": 15,
  "1002": 15,
  "list": 15,
  "220": 15,
  "element": 15,
  "bv": 15,
  "big": 15,
  "fi": 15,
  "light": 15,
  "three": 15,
  "ha": 15,
  "searchres": 15,
  "basis": 15,
  "rt": 15,
  "|#.......................|": 15,
  "501": 15,
  "-O|O-OOO": 15,
  "O-|OOO-O": 15,
  "O-|OOOO-": 15,
  "O-|OO-OO": 15,
  "-O|OOOO-": 15,
  "O-|O-OOO": 15,
  "-O|OO-OO": 15,
  "chk": 14,
  "kmp": 14,
  "P2": 14,
  "colors": 14,
  "fives": 14,
  "1e12": 14,
  "count_m": 14,
  "xa": 14,
  "9223372036854775807LL": 14,
  "clock": 14,
  "val1": 14,
  "ones": 14,
  "month": 14,
  "row ": 14,
  "col ": 14,
  "con": 14,
  "__builtin_popcount": 14,
  "bigmod": 14,
  "100009": 14,
  "2002": 14,
  "numbers": 14,
  "2LL": 14,
  "Mul": 14,
  "name1": 14,
  "keep": 14,
  "80": 14,
  "max_ending_here": 14,
  "mina": 14,
  "items": 14,
  "alph": 14,
  "xop": 14,
  "neo": 14,
  "ansa": 14,
  "ant": 14,
  "L1": 14,
  "r4": 14,
  "j2": 14,
  "ey": 14,
  "maxim": 14,
  "le": 14,
  "tm": 14,
  "a4": 14,
  "gr": 14,
  "state": 14,
  "convert": 14,
  "hash": 14,
  "Alice\\n": 14,
  "Second\\n": 14,
  "hb": 14,
  "year": 14,
  "called": 14,
  "|#.#.#.#.#.#.#.#.#.#.#.|.|)": 14,
  "statement": 14,
  "D\\n": 14,
  "L\\n": 14,
  "NEITHER": 13,
  "pas": 13,
  "100007": 13,
  "fastIo": 13,
  "occur": 13,
  "zx": 13,
  "zy": 13,
  "aux2": 13,
  "rb": 13,
  "81": 13,
  "tam": 13,
  "3000": 13,
  "powmod": 13,
  "DELTA": 13,
  "bitset": 13,
  "1.5": 13,
  "abcdefghijklmnopqrstuvwxyz": 13,
  "capacity": 13,
  "LCM": 13,
  "ite": 13,
  "shift": 13,
  "palindrome": 13,
  "shit": 13,
  "qq": 13,
  "<<=": 13,
  "jarak": 13,
  "bits": 13,
  "bit": 13,
  "dep": 13,
  "lp": 13,
  "nr": 13,
  "turns": 13,
  "3.14159265359": 13,
  "27000": 13,
  "max_": 13,
  "dragon": 13,
  "pf": 13,
  "99": 13,
  "me": 13,
  "act": 13,
  "99999": 13,
  "360.0": 13,
  "lena": 13,
  "cl": 13,
  "First\\n": 13,
  "DOWN\\n": 13,
  "UP\\n": 13,
  "ccw\\n": 13,
  "S3": 13,
  "600": 13,
  "maps": 13,
  "36": 13,
  "bm": 13,
  "txt": 13,
  "ele": 13,
  "HER": 13,
  "|#.#.#.#.#.#.#.#.#.#.#.|.|": 13,
  "|#.#.#.#.#.#.#.#.#.#.#.|D|)": 13,
  "Koyomi": 13,
  "isalpha": 12,
  "pos_1": 12,
  "cnr": 12,
  "1009": 12,
  "deque": 12,
  "nf": 12,
  "write": 12,
  "letters": 12,
  "hr": 12,
  "center": 12,
  "byte": 12,
  "BigInteger": 12,
  "max_so_far": 12,
  "banyakyangmilihini": 12,
  "nd": 12,
  "nC": 12,
  "copy": 12,
  "gcd1": 12,
  "1000000009LL": 12,
  "m3": 12,
  "flag0": 12,
  "prevbeg": 12,
  "prevlen": 12,
  "currcase": 12,
  "maximum": 12,
  "10000007": 12,
  "ld": 12,
  "dict": 12,
  "divisor": 12,
  "negativos": 12,
  "maxsum": 12,
  "unique_names": 12,
  "nega": 12,
  "posi": 12,
  "sumne": 12,
  "sumpo": 12,
  "acu": 12,
  "pass": 12,
  "va": 12,
  "ranks": 12,
  "sizeedge": 12,
  "srand": 12,
  "vis1": 12,
  "Find": 12,
  "skill_level": 12,
  "1111111": 12,
  "10000000000": 12,
  "ya": 12,
  "ofstream": 12,
  "wz": 12,
  "cumm": 12,
  "test1": 12,
  "Ay": 12,
  "Dm": 12,
  "use": 12,
  "info": 12,
  "ak": 12,
  "pos1": 12,
  "cmax": 12,
  "NULL": 12,
  "last_start": 12,
  "Posution": 12,
  "tsum": 12,
  "org": 12,
  "Mahmoud\\n": 12,
  "ca": 12,
  "repeat": 12,
  "lenb": 12,
  "vect": 12,
  "sides": 12,
  "money": 12,
  "step_f": 12,
  "n0": 12,
  "spect": 12,
  "lca": 12,
  "999": 12,
  "remainder": 12,
  "good": 12,
  "X--": 12,
  "times": 12,
  "999999999": 12,
  "210": 12,
  "IMPOSSIBLE\\n": 12,
  "st2": 11,
  "seat": 11,
  "num0": 11,
  "cont2": 11,
  "1e15": 11,
  "poww_mod": 11,
  "500000": 11,
  "100050": 11,
  "ten": 11,
  "42": 11,
  "lang": 11,
  "5050": 11,
  "grafo": 11,
  "vowels": 11,
  "ip2": 11,
  "1000100": 11,
  "lt": 11,
  "ini": 11,
  "maxnn": 11,
  "binary_search": 11,
  "bad": 11,
  "150005": 11,
  "rv": 11,
  "tail": 11,
  "ww": 11,
  "2010": 11,
  "fx": 11,
  "vn": 11,
  "active": 11,
  "key": 11,
  "lst": 11,
  "io": 11,
  "DFS": 11,
  "mx1": 11,
  "ansr": 11,
  "ox": 11,
  "oy": 11,
  "ansb": 11,
  "speed": 11,
  "pwr": 11,
  "tim": 11,
  "47": 11,
  "vc": 11,
  "bx": 11,
  "gl": 11,
  "tr": 11,
  "maxs": 11,
  "z1": 11,
  "1000000001": 11,
  "hitung": 11,
  "status": 11,
  "Count": 11,
  "g1": 11,
  "men": 11,
  "words": 11,
  "arya": 11,
  "bran": 11,
  "_": 11,
  "beat": 11,
  "bi": 11,
  "back\\n": 11,
  "cup": 11,
  "banyak": 11,
  "el": 11,
  "matrix": 11,
  "siz": 11,
  "road": 11,
  "qua": 11,
  "arg1": 11,
  "#Color\\n": 11,
  "equals": 11,
  "An": 11,
  "OO": 11,
  "1111": 11,
  "joy": 11,
  "U\\n": 11,
  "SEGMENT\\n": 11,
  "pos_2": 10,
  "forw": 10,
  "backw": 10,
  "mp1": 10,
  "zeroes": 10,
  "posy": 10,
  "posx": 10,
  "flag3": 10,
  "dig_n": 10,
  "dig_m": 10,
  "flags": 10,
  "exist": 10,
  "max_num": 10,
  "choose": 10,
  "cm": 10,
  "iC": 10,
  "eC": 10,
  "tC": 10,
  "bin": 10,
  "qpow": 10,
  "1.5e7": 10,
  "aux1": 10,
  "wrkdsz": 10,
  "fpow": 10,
  "emm1": 10,
  "nneg": 10,
  "2 ": 10,
  "Dist": 10,
  "arrx": 10,
  "isPalindrome": 10,
  "rotate": 10,
  "300000": 10,
  "manz": 10,
  "rmark": 10,
  "time1": 10,
  "MODULUS": 10,
  "col1": 10,
  "coins": 10,
  "cent": 10,
  "sheets": 10,
  "0x7fffffff": 10,
  "id1": 10,
  "hashi": 10,
  "fy": 10,
  "nei": 10,
  "107": 10,
  "curr_size": 10,
  "curr_d": 10,
  "s25": 10,
  "primer": 10,
  "idx1": 10,
  "idx2": 10,
  "hero": 10,
  "af": 10,
  "masuk": 10,
  "bisa": 10,
  "modexp": 10,
  "prev_notup": 10,
  "zlicz": 10,
  "rr": 10,
  "uu": 10,
  "Dy": 10,
  "Hm": 10,
  "Am": 10,
  "var": 10,
  "desperate_optimization": 10,
  "fastexp": 10,
  "pos2": 10,
  "students": 10,
  "300005": 10,
  "it1": 10,
  "vid": 10,
  "a5": 10,
  "sup": 10,
  "cot": 10,
  "modd": 10,
  "amazing": 10,
  "que": 10,
  "sumr": 10,
  "jum": 10,
  "carry": 10,
  "o1": 10,
  "qs": 10,
  "Oh, my keyboard!": 10,
  "finder": 10,
  "alpha": 10,
  "9999999999": 10,
  "YES\\n2\\n": 10,
  "144": 10,
  "qx": 10,
  "qy": 10,
  "sec": 10,
  "numa": 10,
  "inch": 10,
  "Ans": 10,
  "vet": 10,
  "rotasi": 10,
  "delta": 10,
  "arg2": 10,
  "counts": 10,
  "pointer": 10,
  "LLONG_MAX": 10,
  "li": 10,
  "tmp1": 10,
  "colors.in": 10,
  "QAQ": 10,
  "moves": 10,
  "X++": 10,
  "++X": 10,
  "LINF": 9,
  "white\\n": 9,
  "es": 9,
  "mmp": 9,
  "tempname": 9,
  "SS": 9,
  "MINN": 9,
  "hp": 9,
  "time2": 9,
  "solve2": 9,
  "ic": 9,
  "9999": 9,
  "sk": 9,
  "max_n": 9,
  "1000020": 9,
  "open": 9,
  "cor": 9,
  "fn": 9,
  "seed": 9,
  "haogan": 9,
  "studentsRate": 9,
  "med": 9,
  "build": 9,
  "major\\n": 9,
  "minor\\n": 9,
  "mapp": 9,
  "isp": 9,
  "gcdd": 9,
  "highest": 9,
  "is_same": 9,
  "same_num": 9,
  "su": 9,
  "pause": 9,
  "area": 9,
  "limit": 9,
  "sp": 9,
  "ans3": 9,
  "fuck": 9,
  "no_of_digits": 9,
  "cnta": 9,
  "100003": 9,
  "amigos": 9,
  "pairt": 9,
  "lc": 9,
  "awalx": 9,
  "awaly": 9,
  "4000000": 9,
  "fim": 9,
  "1200000": 9,
  "sss": 9,
  "ansm": 9,
  "cyka": 9,
  "taken": 9,
  "nuevo": 9,
  "tl": 9,
  "numLeft": 9,
  "ansy": 9,
  "mis": 9,
  "fix": 9,
  "dic": 9,
  "remain": 9,
  "1000000007LL": 9,
  "INFF": 9,
  "1000000000000000005LL": 9,
  "nextVal": 9,
  "disk": 9,
  "showpoint": 9,
  "f3": 9,
  "fail": 9,
  "dif_row": 9,
  "dif_col": 9,
  "10000005": 9,
  "signed": 9,
  "1003": 9,
  "simon": 9,
  "200100": 9,
  "sumA": 9,
  "contador": 9,
  "maks": 9,
  "sum_minus": 9,
  "Stone": 9,
  "misha": 9,
  "full": 9,
  "xay": 9,
  "cha": 9,
  "I become the guy.": 9,
  "118": 9,
  "94": 9,
  "cw\\n": 9,
  "item": 9,
  "step1": 9,
  "so": 9,
  "depth": 9,
  "values": 9,
  "card": 9,
  "ky": 9,
  "Friendship\\n": 9,
  "File": 9,
  "Init": 9,
  "remainings": 9,
  "spyke_id": 9,
  "tu": 9,
  "Colours": 9,
  "iter": 9,
  "argument": 9,
  "acef": 9,
  "fuel": 9,
  "2e3": 9,
  "integer": 9,
  "OR": 9,
  "100002": 9,
  "#Black&White\\n": 9,
  "atob": 8,
  "btoa": 8,
  "round1": 8,
  "900": 8,
  "raw": 8,
  "vi": 8,
  "MAXX": 8,
  "hc": 8,
  "denied": 8,
  "atk1": 8,
  "def1": 8,
  "num5": 8,
  "digitn": 8,
  "digitm": 8,
  "faken": 8,
  "fakem": 8,
  "vct": 8,
  "horizontal": 8,
  "appear": 8,
  "den": 8,
  "inilahhasilnya": 8,
  "lIdx": 8,
  "rIdx": 8,
  "CHR": 8,
  "modx": 8,
  "cpy": 8,
  "gmax": 8,
  "Palindromic tree is better than splay tree": 8,
  "started": 8,
  "2e7": 8,
  "mex": 8,
  "6969": 8,
  "spff": 8,
  "debug": 8,
  "2048": 8,
  "maskX": 8,
  "maskY": 8,
  "C1": 8,
  "zer": 8,
  "ru": 8,
  "100004": 8,
  "ans_l": 8,
  "ans_r": 8,
  "ansy1": 8,
  "ansy2": 8,
  "input2": 8,
  "myv": 8,
  "salida": 8,
  "cntb": 8,
  "Sub": 8,
  "mem": 8,
  "104": 8,
  "col2": 8,
  "_min": 8,
  "jl": 8,
  "distinct": 8,
  "d10": 8,
  "150001": 8,
  "alt": 8,
  "0x3f3f3f3f3f3f3f3f": 8,
  "vis2": 8,
  "new_skill": 8,
  "segun": 8,
  "log10": 8,
  "files": 8,
  "count25": 8,
  "stac": 8,
  "matriz": 8,
  "r25": 8,
  "qkids": 8,
  "D2": 8,
  "mx2": 8,
  "ansl": 8,
  "edge": 8,
  "1e-10": 8,
  "getFactorization": 8,
  "getZarr": 8,
  "prev_up": 8,
  "increment": 8,
  "maxval": 8,
  "ce": 8,
  "arrayi": 8,
  "NEB": 8,
  "malow": 8,
  "vp": 8,
  "lead0": 8,
  "ston": 8,
  "multimap": 8,
  "zheng": 8,
  "geo": 8,
  "first_col": 8,
  "ou": 8,
  "rev": 8,
  "emp": 8,
  "maze": 8,
  "gx": 8,
  "gy": 8,
  "mxn": 8,
  "cycle": 8,
  "contiguous": 8,
  "pet": 8,
  "dat": 8,
  "heap": 8,
  "cunt": 8,
  "len_block": 8,
  "sumB": 8,
  "func": 8,
  "note": 8,
  "Set": 8,
  "boxes": 8,
  "95": 8,
  "chris": 8,
  "blocked": 8,
  "57": 8,
  "o2": 8,
  "k3": 8,
  "lft": 8,
  "faces": 8,
  "G1": 8,
  "pen": 8,
  "fast_io": 8,
  "fast_exp": 8,
  "step_b": 8,
  "s0": 8,
  "maxcnt": 8,
  "kx": 8,
  "wh": 8,
  "hour": 8,
  "Hash": 8,
  "diamond": 8,
  "home\\n": 8,
  "c0": 8,
  "Tb": 8,
  "way": 8,
  "nex": 8,
  "DeleteIt": 8,
  "quotient": 8,
  "bal": 8,
  "#\\n": 8,
  "nonzero": 8,
  "getInt": 8,
  "HIM!\\n": 8,
  "HER!\\n": 8,
  "gap": 8,
  "game": 8,
  "sets": 8,
  "|.|\\n": 8,
  "|D|)": 8,
  "|.|": 8,
  "leave": 8,
  "log": 8,
  "asd": 8,
  "zxcvbnm": 8,
  "Malvika\\n": 8,
  "3.14159": 8,
  "--X": 8,
  "min_i": 8,
  "min_j": 8,
  "max_j": 8,
  "further": 8,
  "offset": 7,
  "maxnum": 7,
  "person": 7,
  "cont1": 7,
  "songs": 7,
  "xh": 7,
  "qtd": 7,
  "CLOCKS_PER_SEC": 7,
  "1e99": 7,
  "gc": 7,
  "tlen": 7,
  "MaxN": 7,
  "disC": 7,
  "forbid": 7,
  "important": 7,
  "Possible": 7,
  "team": 7,
  "heros": 7,
  "chax": 7,
  "chay": 7,
  "rfind": 7,
  "istringstream": 7,
  "memcpy": 7,
  "is_vowel": 7,
  "sdiag": 7,
  "ord": 7,
  "lios": 7,
  "liala": 7,
  "etr": 7,
  "etra": 7,
  "initis": 7,
  "inites": 7,
  "rub": 7,
  "41": 7,
  "00:00": 7,
  "prims": 7,
  "2000005": 7,
  "nam": 7,
  "arry": 7,
  "5e3": 7,
  "Mod": 7,
  "lib": 7,
  "blah": 7,
  "after": 7,
  "input1": 7,
  "crush": 7,
  "100.0": 7,
  "minimal": 7,
  "positivos": 7,
  "get_ans": 7,
  "cntc": 7,
  "58": 7,
  "vowel": 7,
  "sd": 7,
  "dollar": 7,
  "5000000": 7,
  "merge": 7,
  "100006": 7,
  "202": 7,
  "tercer": 7,
  "perm": 7,
  "dp1": 7,
  "tam1": 7,
  "count_a": 7,
  "nineteen": 7,
  "contN": 7,
  "load": 7,
  "3.14159265358979323846": 7,
  "reports": 7,
  "judge2": 7,
  "numOpen": 7,
  "notup": 7,
  "99999999999": 7,
  "hpm": 7,
  "maxb": 7,
  "ia": 7,
  "xb": 7,
  "yb": 7,
  "fu": 7,
  "rate": 7,
  "fast_power": 7,
  "steps": 7,
  "vl": 7,
  "split": 7,
  "first_row": 7,
  "file.txt": 7,
  "st_taken": 7,
  "cb": 7,
  "got": 7,
  "rl1": 7,
  "rl2": 7,
  "301": 7,
  "tira": 7,
  "sum_plus": 7,
  "suml": 7,
  "Chris\\n": 7,
  "kt": 7,
  "109": 7,
  "2e18": 7,
  "slogan": 7,
  "rgt": 7,
  "index1": 7,
  "au": 7,
  "tep": 7,
  "killed": 7,
  "palin": 7,
  "hash1": 7,
  "step2": 7,
  "totalpass": 7,
  "WBWBWBWB": 7,
  "BWBWBWBW": 7,
  "gov": 7,
  "rl": 7,
  "30005": 7,
  "ptr": 7,
  "10.0": 7,
  "vol": 7,
  "maxcount": 7,
  "inicio": 7,
  "findfa": 7,
  "factor": 7,
  "minit": 7,
  "feet": 7,
  "rnum": 7,
  "binaryCode": 7,
  "segment": 7,
  "l2r": 7,
  "Ql": 7,
  "Qr": 7,
  "sementara": 7,
  "contest\\n": 7,
  "sameSocks": 7,
  "c4": 7,
  "monedas": 7,
  "minr": 7,
  "maxr": 7,
  "reqrec": 7,
  "previous": 7,
  "xsum": 7,
  "ysum": 7,
  "sorted": 7,
  "Ar": 7,
  "2000000000": 7,
  "30010": 7,
  "0x3f": 7,
  "longs": 7,
  "ri": 7,
  "amount": 7,
  "proceed": 7,
  "1007": 7,
  "gg": 7,
  "seq": 7,
  "1500": 7,
  "cd": 7,
  "sumc": 7,
  "P3": 7,
  "T2": 7,
  "OOOO-": 7,
  "variables": 7,
  "zz": 7,
  "vectors": 7,
  "j1": 7,
  "63": 7,
  "LD\\n": 7,
  "truthy": 7,
  "with": 7,
  "factorial": 7,
  "function": 7,
  "nCr": 7,
  "prealoc": 7,
  "a8": 7,
  "h8": 7,
  "RU\\n": 7,
  "ki": 7,
  "aj": 7,
  "Akshat\\n": 7,
  "1000000010": 6,
  "temps": 6,
  "dix": 6,
  "diy": 6,
  "right_tri": 6,
  "123456": 6,
  "F1": 6,
  "F2": 6,
  "getnext": 6,
  "p11": 6,
  "p21": 6,
  "round2": 6,
  "match1": 6,
  "cursor": 6,
  "static_cast": 6,
  "mp2": 6,
  "client": 6,
  "defcos": 6,
  "binSearch": 6,
  "zeros": 6,
  "cz": 6,
  "ng": 6,
  "gp": 6,
  "maxVal": 6,
  "newX": 6,
  "newY": 6,
  "hp1": 6,
  "hp2": 6,
  "mpu": 6,
  "xxx": 6,
  "most": 6,
  "mint": 6,
  "permutem": 6,
  "permuteh": 6,
  "round": 6,
  "remaind": 6,
  "linf": 6,
  "sum_pos": 6,
  "sum_neg": 6,
  "vertikal": 6,
  "theyareworking": 6,
  "hihi": 6,
  "1\\n0\\n": 6,
  "cum": 6,
  "to_int": 6,
  "colunas": 6,
  "Da": 6,
  "Db": 6,
  "Anka": 6,
  "Chapay": 6,
  "Cleo": 6,
  "Dracul": 6,
  "Snowy": 6,
  "Hexadecimal": 6,
  "111111": 6,
  "parrent": 6,
  "Union": 6,
  "panduan": 6,
  "tot1": 6,
  "ended": 6,
  "MAXM": 6,
  "ulong": 6,
  "131": 6,
  "xasphalt": 6,
  "yasphalt": 6,
  "bon": 6,
  "emm2": 6,
  "lk": 6,
  "lastValid": 6,
  "Y1": 6,
  "Y2": 6,
  "auxp": 6,
  "auxc": 6,
  "breaktime": 6,
  "lastbreaktime": 6,
  "3e2": 6,
  "maohao": 6,
  "k0": 6,
  "flagg": 6,
  "50000": 6,
  "fastMax": 6,
  "fastMin": 6,
  "lu": 6,
  "dk": 6,
  "rgraph": 6,
  "rq": 6,
  "st1": 6,
  "maxsalary": 6,
  "ivec": 6,
  "memo": 6,
  "boostIO": 6,
  "beforeP": 6,
  "4005": 6,
  "likes": 6,
  "1500000": 6,
  "dz": 6,
  "dist1": 6,
  "rdfs": 6,
  "chkPrime1to10000000": 6,
  "seive": 6,
  "Div": 6,
  "gender": 6,
  "iv": 6,
  "row1": 6,
  "row2": 6,
  "rh": 6,
  "at2": 6,
  "bpow": 6,
  "Counter": 6,
  "OK": 6,
  "maxSubArraySum": 6,
  "500005": 6,
  "skill_name": 6,
  "isvowel": 6,
  "passou": 6,
  "compute": 6,
  "asphaltx": 6,
  "asphalty": 6,
  "inside": 6,
  "there": 6,
  "any": 6,
  "MID": 6,
  "Impossible\\n": 6,
  "tmaxmin": 6,
  "solx1": 6,
  "solx2": 6,
  "tam2": 6,
  "pali": 6,
  "multiset": 6,
  "rowa": 6,
  "over": 6,
  "alfa": 6,
  "fS": 6,
  "column": 6,
  "wa": 6,
  "check1": 6,
  "vert": 6,
  "amulets": 6,
  "prevDiv": 6,
  "nextt": 6,
  "MI": 6,
  "5010": 6,
  "hpy": 6,
  "mr": 6,
  "pointPos": 6,
  "Hy": 6,
  "Hs": 6,
  "As": 6,
  "Ds": 6,
  ":0": 6,
  "sn": 6,
  "__typeof": 6,
  "ly": 6,
  "rstr": 6,
  "n_one": 6,
  "0x1": 6,
  "rez": 6,
  "is_x1": 6,
  "is_x2": 6,
  "is_y1": 6,
  "is_y2": 6,
  "4\\n": 6,
  "chng": 6,
  "mb": 6,
  "zuida": 6,
  "posL": 6,
  "carryFlag": 6,
  "Emp_Lang": 6,
  "first_ai": 6,
  "vl4": 6,
  "fac": 6,
  "n_count": 6,
  "i_count": 6,
  "e_count": 6,
  "t_count": 6,
  "second_row": 6,
  "second_col": 6,
  "studentTS": 6,
  "qwe": 6,
  "it2": 6,
  "dn": 6,
  "p10": 6,
  "a_i": 6,
  "a6": 6,
  "100500": 6,
  "34": 6,
  "minodd": 6,
  "odds": 6,
  "cadena": 6,
  "tg": 6,
  "Friendship is magic!^^": 6,
  "Mininum": 6,
  "loss1": 6,
  "loss2": 6,
  "actual": 6,
  "arrays": 6,
  "pow2": 6,
  "pe": 6,
  "im": 6,
  "_a": 6,
  "180.0": 6,
  "1440": 6,
  "Li": 6,
  "pearls": 6,
  "half": 6,
  "D1": 6,
  "tedad": 6,
  "saida": 6,
  "gh": 6,
  "maxNum": 6,
  "TIE\\n": 6,
  "pResult": 6,
  "hld": 6,
  "maxsec": 6,
  "3.0": 6,
  "xs": 6,
  "medal": 6,
  "202002": 6,
  "brainfuck": 6,
  "log_": 6,
  "poss1_p1": 6,
  "poss1_spec": 6,
  "list1": 6,
  "601": 6,
  "pro": 6,
  "binaryChar": 6,
  "inputs": 6,
  "__b": 6,
  "cari": 6,
  "ans_a": 6,
  "ans_b": 6,
  "310": 6,
  "reqNo": 6,
  "cA": 6,
  "weight": 6,
  "zsum": 6,
  "secretaries_num": 6,
  "count3": 6,
  "Names": 6,
  "istream": 6,
  "ostream": 6,
  "1000007": 6,
  "amounts1": 6,
  "amounts2": 6,
  "imax": 6,
  "prices": 6,
  "str3": 6,
  "MAX2": 6,
  "absolute": 6,
  "binary": 6,
  "newline": 6,
  "other": 6,
  "mxm": 6,
  "mmax": 6,
  "noop": 6,
  "100011": 6,
  "doit": 6,
  "1000000000000": 6,
  "isVowel": 6,
  "252": 6,
  "70": 6,
  "()": 6,
  "bt": 6,
  "is_prime": 6,
  "reset": 6,
  "shu": 6,
  "votes": 6,
  "ds": 6,
  "Otherwise": 6,
  "process": 6,
  "invoke": 6,
  "large": 6,
  "numeric_limits": 6,
  "final": 6,
  "maxy": 6,
  "del": 6,
  "-OOOO": 6,
  "0000000": 6,
  "levels": 6,
  "salt": 6,
  "minus": 6,
  "magic!^^\\n": 6,
  "computer": 6,
  "substring": 6,
  "plen": 6,
  "src1": 5,
  "src2": 5,
  "both\\n": 5,
  "forward\\n": 5,
  "backward\\n": 5,
  "fantasy\\n": 5,
  "rit": 5,
  "parity": 5,
  "SC1": 5,
  "tip": 5,
  "MODPRIMA": 5,
  "cf": 5,
  "single": 5,
  "1000000000000000": 5,
  "1.": 5,
  "yyy": 5,
  "replica": 5,
  "infint64_t": 5,
  "number_of_5": 5,
  "3.1415926535": 5,
  "ind_s": 5,
  "ind_e": 5,
  "get_prime": 5,
  "ab1": 5,
  "ba2": 5,
  "2e2": 5,
  "49": 5,
  "anst": 5,
  "findSet": 5,
  "odgr": 5,
  "Troll": 5,
  "FindParrent": 5,
  "maxind": 5,
  "minind": 5,
  "visitado": 5,
  "iss": 5,
  "hui": 5,
  "fm": 5,
  " - ": 5,
  "lose": 5,
  "69": 5,
  "js": 5,
  "$": 5,
  "lowest": 5,
  "bitcount": 5,
  "00": 5,
  "ispal": 5,
  "pb": 5,
  "2050000": 5,
  "ok2": 5,
  "somaPoli": 5,
  "0.001": 5,
  "tomas": 5,
  "maxin": 5,
  "1024": 5,
  "err": 5,
  "answerFound": 5,
  "convert_str": 5,
  "psg": 5,
  "afterP": 5,
  "Left": 5,
  "5e6": 5,
  "last_digit": 5,
  "mind": 5,
  "cross": 5,
  "occ": 5,
  "mod_pow": 5,
  "connected": 5,
  "INF_INT": 5,
  "INF_LL": 5,
  "INF_ULL": 5,
  "18446744073709551615Ull": 5,
  "92540646808111039LL": 5,
  "Move": 5,
  "Move_": 5,
  "str2num": 5,
  "akt": 5,
  "cal_digit": 5,
  "cal_largerthanorequaltox": 5,
  "id0": 5,
  "xp": 5,
  "foo": 5,
  "dB": 5,
  "dW": 5,
  "Total": 5,
  "auto": 5,
  "urm": 5,
  "EOF": 5,
  "512": 5,
  "mmc": 5,
  "s50": 5,
  "log7": 5,
  "bio": 5,
  "200007": 5,
  "palindrom": 5,
  "val3": 5,
  "colo": 5,
  "count_c": 5,
  "count_b": 5,
  "r50": 5,
  "candies": 5,
  "jawab": 5,
  "ma2": 5,
  "ALPH": 5,
  "ct1": 5,
  "txt.in": 5,
  "txt.out": 5,
  "ultimate": 5,
  "sum_n": 5,
  "maxsub": 5,
  "cans": 5,
  "ch3": 5,
  "mid_num": 5,
  "dd1": 5,
  "dd2": 5,
  "line1": 5,
  "cash": 5,
  "lm": 5,
  "pnt": 5,
  "outdeg": 5,
  "hora": 5,
  "ntc": 5,
  "power1": 5,
  "mcnt": 5,
  "min_v": 5,
  "pan": 5,
  "Rick": 5,
  "knight": 5,
  "small": 5,
  "yy1": 5,
  "triangulo": 5,
  "ogo": 5,
  "ang": 5,
  "trd": 5,
  "tgd": 5,
  "tbd": 5,
  "1.00": 5,
  "magic": 5,
  "width": 5,
  "Still Rozdil": 5,
  "f0": 5,
  "maxSections": 5,
  "my_min": 5,
  "counter1": 5,
  "counter2": 5,
  "mcount": 5,
  "ccount": 5,
  "clones": 5,
  "math": 5,
  "cost_min": 5,
  "PE": 5,
  "lessonsn": 5,
  "ming1": 5,
  "ming2": 5,
  "frnd": 5,
  "penalty": 5,
  "index2": 5,
  "hcf": 5,
  "groups": 5,
  "bq": 5,
  "echo": 5,
  "endd": 5,
  "station1": 5,
  "current_minimum": 5,
  "min_price": 5,
  "Len": 5,
  "qa": 5,
  "section": 5,
  "mpa": 5,
  "replace": 5,
  "df": 5,
  "avg": 5,
  "dis1": 5,
  "dis2": 5,
  "chest\\n": 5,
  "biceps\\n": 5,
  "cumple": 5,
  "MaxNum": 5,
  "cmin": 5,
  "lmax": 5,
  "prep": 5,
  "bnt": 5,
  "band": 5,
  "s80": 5,
  "degree": 5,
  "insertion": 5,
  "inputLength": 5,
  "er": 5,
  "today": 5,
  "firstdata": 5,
  "seconddata": 5,
  "ans_len": 5,
  "endpos": 5,
  "2000010": 5,
  "wb": 5,
  "differentSocks": 5,
  "alr": 5,
  "resa": 5,
  "sett": 5,
  "asdfghjkl;": 5,
  "waysCount": 5,
  "cB": 5,
  "r0": 5,
  "O-": 5,
  "output1": 5,
  "maxv": 5,
  "checks": 5,
  "mv": 5,
  "subtraction": 5,
  "numOfTestCases": 5,
  "snake": 5,
  "g2": 5,
  "fp": 5,
  "modi": 5,
  "READ": 5,
  "OUTPUT": 5,
  "INPUT": 5,
  "size_n": 5,
  "mmin": 5,
  "nothing": 5,
  "3432": 5,
  "924": 5,
  "12870": 5,
  "48620": 5,
  "WINS\\n": 5,
  "exclusive": 5,
  "HIM": 5,
  "present": 5,
  "ap": 5,
  "LONG_MAX": 5,
  "cmd": 5,
  "tot2": 5,
  "mt": 5,
  "ar1": 5,
  "buf": 5,
  "chess": 5,
  "VI4": 5,
  "VI3": 5,
  "VI2": 5,
  "VI": 5,
  "ar2": 5,
  "angle": 5,
  "ori": 5,
  "diff2": 5,
  "sign": 5,
  "1000000005": 5,
  "inve": 5,
  "|D|)\\n": 5,
  "|.|)\\n": 5,
  "s.\\n": 5,
  "Pi": 5,
  "expo": 5,
  "arra": 5,
  "record": 5,
  "impossible\\n": 5,
  "sumz": 5,
  "sumy": 5,
  "sumx": 5,
  "imin": 5,
  "0.25": 5,
  "dsa": 5,
  "aeiou13579": 5,
  "2.": 5,
  "cols": 5,
  "getint": 5,
  "mov": 5,
  "Bn": 5,
  "counta": 5,
  "0123456789": 5,
  "1/1\\n": 5,
  "mishka": 5,
  "605": 5,
  "ep": 5,
  "6789TJQKA": 5,
  "2222": 5,
  "ALMOST\\n": 4,
  "ln1": 4,
  "p12": 4,
  "p22": 4,
  "colors_rev": 4,
  "match2": 4,
  "p_sign": 4,
  "d_raw": 4,
  "intpart": 4,
  "fq": 4,
  "II": 4,
  "555555555": 4,
  "refused": 4,
  "findn": 4,
  "findm": 4,
  "ni": 4,
  "100000000000": 4,
  "minbitcoins": 4,
  "flag_d": 4,
  "flag_l": 4,
  "flag_r": 4,
  "1e14": 4,
  "numPeople": 4,
  "atk2": 4,
  "flag4": 4,
  "columns": 4,
  "rowFull": 4,
  "atk_y": 4,
  "def_y": 4,
  "hp_m": 4,
  "damage_y": 4,
  "min_val": 4,
  "a_n": 4,
  "jokes": 4,
  "restBetween": 4,
  "checkh": 4,
  "checkm": 4,
  "accumulate": 4,
  "yu": 4,
  "number_of_0": 4,
  "temp3": 4,
  "temp4": 4,
  "primo": 4,
  "dois": 4,
  "clock_t": 4,
  "damageY": 4,
  "maxt": 4,
  "appear_ctr": 4,
  "max_appear": 4,
  "currdiv": 4,
  "ba1": 4,
  "mode": 4,
  "ABC": 4,
  "row_x": 4,
  "hori": 4,
  "Hermione\\n": 4,
  "current_max": 4,
  "get_f": 4,
  "get_g": 4,
  "idgr": 4,
  "strcat": 4,
  "likeNum": 4,
  " \\n": 4,
  "150150": 4,
  "grau": 4,
  "kontol": 4,
  "numWays": 4,
  "km": 4,
  "ph": 4,
  "join": 4,
  "slove": 4,
  " = 1\\n1 * 24 = 24\\n": 4,
  "button": 4,
  "cntNotFastened": 4,
  "3\\n": 4,
  "not": 4,
  "isU": 4,
  " = ": 4,
  "backtrack": 4,
  "disx": 4,
  "disy": 4,
  "101000": 4,
  "cas": 4,
  "2007": 4,
  "ave": 4,
  "__builtin_clz": 4,
  "palins": 4,
  "somaPrim": 4,
  "CS": 4,
  "DS": 4,
  "FS": 4,
  "GS": 4,
  "FazInt": 4,
  "IsMajor": 4,
  "IsMinor": 4,
  "strange\\n": 4,
  "wap": 4,
  "de": 4,
  "5002": 4,
  "npri": 4,
  "npal": 4,
  "getprime": 4,
  "1 ": 4,
  "kp": 4,
  "rused": 4,
  "msk1": 4,
  "msk2": 4,
  "MAX_M": 4,
  "emps": 4,
  "maxmaxsalary": 4,
  "employees": 4,
  "salary": 4,
  "Call": 4,
  "byte\\n": 4,
  "BigInteger\\n": 4,
  "10:01": 4,
  "20:02": 4,
  "to_num": 4,
  "islegal": 4,
  "usedLen": 4,
  "lks": 4,
  "makePrimes": 4,
  "ispalin": 4,
  "esum": 4,
  "timer": 4,
  "lucky_numbers": 4,
  "TT": 4,
  "time_p": 4,
  "first_digit": 4,
  "10000001": 4,
  "numofzero": 4,
  "permu": 4,
  "adj2": 4,
  "fd": 4,
  "printSt": 4,
  "MODINVERSE": 4,
  "Add": 4,
  "diameter": 4,
  "mierda": 4,
  "w_x": 4,
  "w_y": 4,
  "b_x": 4,
  "b_y": 4,
  "w_step": 4,
  "b_step": 4,
  "num_c": 4,
  "va1": 4,
  "cy1": 4,
  "nxtd": 4,
  "mae": 4,
  "lik": 4,
  "toadd": 4,
  "candidates": 4,
  "onerun": 4,
  "maurm": 4,
  "who": 4,
  "lastpos": 4,
  "nom": 4,
  "1e+6": 4,
  "chegou": 4,
  "beginu": 4,
  "tempstr": 4,
  "get_num": 4,
  "sqLIM": 4,
  "dp2": 4,
  "rao": 4,
  "count50": 4,
  "lans": 4,
  "ltemp": 4,
  "gbs": 4,
  "signal": 4,
  "sf": 4,
  "alguienSabe": 4,
  "lenguas": 4,
  "contE": 4,
  "kids": 4,
  "trow": 4,
  "lead": 4,
  "first_later": 4,
  "115": 4,
  "sCopy": 4,
  "combs": 4,
  "_map": 4,
  "lakukan": 4,
  "starstar": 4,
  "pasa": 4,
  "letra": 4,
  "cambio": 4,
  "realR": 4,
  "noob": 4,
  "whatever": 4,
  "Max_N": 4,
  "arr3": 4,
  "maxgcd": 4,
  "ch4": 4,
  "indice_max": 4,
  "operator": 4,
  "time_": 4,
  "getnumber": 4,
  "countT": 4,
  "countN": 4,
  "countI": 4,
  "c25": 4,
  "closest": 4,
  "5555": 4,
  "damy": 4,
  "damm": 4,
  "satu": 4,
  "dpback": 4,
  "gback": 4,
  "check_1": 4,
  "check_2": 4,
  "lead01": 4,
  "lead02": 4,
  "lead03": 4,
  "MAXall": 4,
  "color_to_id": 4,
  "count_one": 4,
  "Pow": 4,
  "unite": 4,
  "indeg": 4,
  "cont3": 4,
  "8\\n": 4,
  "vertex": 4,
  "f4": 4,
  "102000": 4,
  "power2": 4,
  "loc": 4,
  "valp": 4,
  "vl1": 4,
  "sentence": 4,
  "nineteen_count": 4,
  "ancnt": 4,
  "marke": 4,
  "Morty": 4,
  "1300006": 4,
  "tn": 4,
  "1004": 4,
  "visted": 4,
  "HARD\\n": 4,
  "EASY\\n": 4,
  "Ciel\\n": 4,
  "Hanako\\n": 4,
  "x5": 4,
  "anti": 4,
  "sol1": 4,
  "sol2": 4,
  "a_counter": 4,
  "d_counter": 4,
  "tot_arr": 4,
  "dire": 4,
  "tf": 4,
  "CHAT WITH HER!": 4,
  "IGNORE HIM!": 4,
  "npd": 4,
  "fuente": 4,
  "destino": 4,
  "saltos": 4,
  "radius": 4,
  "l0": 4,
  "player1": 4,
  "player2": 4,
  "pending": 4,
  "nut2sec": 4,
  "flush": 4,
  "largo": 4,
  "eat": 4,
  "basura": 4,
  "5100": 4,
  "nhap": 4,
  "max_cont_4": 4,
  "javob": 4,
  "ostringstream": 4,
  "mod1": 4,
  "av": 4,
  "no_of_8": 4,
  "filter": 4,
  "Minn": 4,
  "links": 4,
  "mindiff": 4,
  "min_result": 4,
  "wl": 4,
  "newPerson": 4,
  "station2": 4,
  "110000": 4,
  "Flag": 4,
  "inp1": 4,
  "bg": 4,
  "prevC": 4,
  "82": 4,
  "wo": 4,
  "ftpass": 4,
  "lasttime": 4,
  "b0": 4,
  "1008": 4,
  "keyboard": 4,
  "difA": 4,
  "difB": 4,
  "j3": 4,
  "1e-11": 4,
  "oranges_size": 4,
  "cupboard": 4,
  "medalboard": 4,
  "fri": 4,
  "esVocal_o_n": 4,
  "hur": 4,
  "newvictim": 4,
  "poss1": 4,
  "poss1_p2": 4,
  "1011": 4,
  "add2": 4,
  "lmin": 4,
  "ix": 4,
  "passenger": 4,
  "count_8": 4,
  "count_no": 4,
  "ao": 4,
  "permut": 4,
  "mnd": 4,
  "saved": 4,
  "minnum": 4,
  "cws": 4,
  "ccws": 4,
  "testCases": 4,
  "breakFlag": 4,
  "acnt": 4,
  "bcnt": 4,
  "pack": 4,
  "Masha\\n": 4,
  "Equal\\n": 4,
  "Dasha\\n": 4,
  "resb": 4,
  "qwertyuiop": 4,
  "zxcvbnm,./": 4,
  "gay": 4,
  "max_sections": 4,
  "n_of_nuts": 4,
  "fans": 4,
  "-O": 4,
  "wnk": 4,
  "pposi": 4,
  "evaluate": 4,
  "piche": 4,
  "newstr": 4,
  "won": 4,
  "boost": 4,
  "sitch": 4,
  "izq": 4,
  "rand": 4,
  "minP": 4,
  "buff": 4,
  "3e4": 4,
  "cell": 4,
  "dest": 4,
  "1e17": 4,
  "ft": 4,
  "fastio": 4,
  "diry": 4,
  "dirx": 4,
  "hang": 4,
  "remaining": 4,
  "rta": 4,
  "largest": 4,
  "30000": 4,
  "rc": 4,
  "0x3f3f3f": 4,
  "lr": 4,
  "vasya": 4,
  "mxv": 4,
  "Misha\\n": 4,
  "Tie\\n": 4,
  "Vasya\\n": 4,
  "maxi2": 4,
  "tims": 4,
  "poly": 4,
  "games": 4,
  "gdc": 4,
  "aeiou": 4,
  "marks": 4,
  "8<": 4,
  "gs": 4,
  "200009": 4,
  "elements": 4,
  "_s": 4,
  "miny": 4,
  "1000009": 4,
  "nmax": 4,
  ">\\n": 4,
  "=\\n": 4,
  "<\\n": 4,
  "lowercase": 4,
  "int_gcd": 4,
  "ys": 4,
  "lenght": 4,
  "stream": 4,
  "};": 4,
  "jump": 4,
  "bo": 4,
  "players": 4,
  "sh": 4,
  "cnt3": 4,
  "122220": 4,
  "side": 4,
  "he": 4,
  "is_square": 4,
  "4e7": 4,
  "kanan": 4,
  "password": 4,
  "2/3\\n": 4,
  "si": 4,
  "0ll": 4,
  "kq": 4,
  "ji": 4,
  "Cnt": 4,
  "361": 4,
  "365": 4,
  "deg": 4,
  "diff1": 4,
  "0.01": 4,
  "..|\\n": 4,
  "O-|-OOOO\\n": 4,
  "|O.......................|": 4,
  "+------------------------+\\n": 4,
  "33": 4,
  "1e-15": 4,
  "bottom": 4,
  "61": 4,
  "casn": 4,
  "cntr": 4,
  "444": 4,
  "bob": 4,
  "lessons": 4,
  "hn": 4,
  "di": 4,
  "1000002": 4,
  "ct2": 4,
  "prefix_function": 4,
  "lj": 4,
  "lzl": 4,
  "BBBBBBBB": 4,
  "s5": 4,
  "OOOO": 4,
  "OOO-O": 4,
  "O-OOO": 4,
  "OO-OO": 4,
  "xt": 4,
  "yt": 4,
  "lef": 4,
  "MAXT": 4,
  "FindLen": 4,
  "c5": 4,
  "aeiouy": 4,
  "ref": 4,
  "inches": 4,
  "wait": 4,
  "returns": 4,
  "bj": 4,
  "cakes": 4,
  "keyboard!\\n": 4,
  "guy.\\n": 4,
  "ctx": 4,
  "star": 4,
  "RD\\n": 4,
  "LU\\n": 4,
  "starty": 4,
  "startx": 4,
  "xor": 4,
  "Karen\\n": 4,
  "1/6\\n": 4,
  "towupper": 4,
  "mz": 4,
  "toggle": 4,
  "11111": 4,
  "soldier": 4,
  "ev": 4,
  "seg": 4,
  "ye": 4,
  "cn1": 4,
  "SIZE": 4,
  "Bulbasaur": 4,
  "vest": 4,
  "was": 4,
  "doubles": 4,
  "conv": 4,
  "revs": 3,
  "fill_prefix": 3,
  "forwards": 3,
  "backwards": 3,
  "modf": 3,
  "SC2": 3,
  "cnt5": 3,
  "sumn": 3,
  "left_out": 3,
  "atcos": 3,
  "flag_u": 3,
  "1069": 3,
  "modInverse": 3,
  "def2": 3,
  "columnFull": 3,
  "hp_y": 3,
  "atk_m": 3,
  "def_m": 3,
  "availabletime": 3,
  "count5": 3,
  "sumAux": 3,
  "test_case": 3,
  "Prime": 3,
  "15000001": 3,
  "divisors": 3,
  "is_first": 3,
  "first_ctr": 3,
  "0.00001": 3,
  "movs": 3,
  "ab2": 3,
  "CheckStr": 3,
  "col_x": 3,
  "isP": 3,
  "Ron\\n": 3,
  "tuple": 3,
  "make_tuple": 3,
  "SevenPows": 3,
  "dh": 3,
  "get2": 3,
  "1E5": 3,
  "_dwj": 3,
  "trans": 3,
  "Tst": 3,
  "back_track": 3,
  "nz": 3,
  "grauCor": 3,
  "valueArr": 3,
  "getX": 3,
  "getY": 3,
  "C2": 3,
  "1001000": 3,
  "5e2": 3,
  "2100000": 3,
  "jed": 3,
  "ok1": 3,
  "in_out_txt": 3,
  "enum": 3,
  "ek": 3,
  "getmask": 3,
  "prevmin": 3,
  "min4": 3,
  "companies": 3,
  "employeenum": 3,
  "Target": 3,
  "short\\n": 3,
  "int\\n": 3,
  "long\\n": 3,
  "cgg": 3,
  "divUp": 3,
  "cat": 3,
  "Plus": 3,
  "input3": 3,
  "10ll": 3,
  "astarted": 3,
  "sortby": 3,
  "C0": 3,
  "lprime": 3,
  "lpalin": 3,
  "numm": 3,
  "orginal": 3,
  "max_score": 3,
  "000": 3,
  "extgcd": 3,
  "mod_inverse": 3,
  "zero2": 3,
  "getPoint": 3,
  "chrs": 3,
  "Smith": 3,
  "num_a": 3,
  "num_b": 3,
  "va2": 3,
  "cy2": 3,
  "county": 3,
  "licz": 3,
  "wynik": 3,
  "odw": 3,
  "cal_equaltod": 3,
  "peek": 3,
  "updates": 3,
  "exCount": 3,
  "2147483640": 3,
  "MAXLL": 3,
  "LL_INF": 3,
  "550": 3,
  "cprev": 3,
  "base10": 3,
  "spow": 3,
  "parza": 3,
  "able": 3,
  "find_len": 3,
  "primeFactors": 3,
  "tam3": 3,
  "contI": 3,
  "contT": 3,
  "negative": 3,
  "lastrowa": 3,
  "300009": 3,
  "last_later": 3,
  "f2p": 3,
  "nrr": 3,
  "suit": 3,
  "RGBYW": 3,
  "tmin": 3,
  "500010": 3,
  "300030": 3,
  "indep": 3,
  "judge1": 3,
  "check2": 3,
  "contenido": 3,
  "mayuscula": 3,
  "flagh": 3,
  "flagl": 3,
  "flaghs": 3,
  "flagls": 3,
  "propblem": 3,
  "gcb": 3,
  "mypow": 3,
  "150000": 3,
  "index_max": 3,
  "index_min": 3,
  "display_vector": 3,
  "min_max": 3,
  "sum_v": 3,
  "thissub": 3,
  "defy": 3,
  "defm": 3,
  "hdc": 3,
  "indice_min": 3,
  "find_digit": 3,
  "countE": 3,
  "btong": 3,
  "_k": 3,
  "c50": 3,
  "130": 3,
  "wins": 3,
  "cpr": 3,
  "goback": 3,
  "drom": 3,
  "sav": 3,
  "44": 3,
  "day1": 3,
  "day2": 3,
  "diam": 3,
  "incoming": 3,
  "SieveOfEratosthenes": 3,
  "bisearch_R": 3,
  "posRL": 3,
  "k1x": 3,
  "k1y": 3,
  "k2x": 3,
  "k2y": 3,
  "0 ": 3,
  "37000": 3,
  "real_k": 3,
  "locale": 3,
  "analphabet": 3,
  "components": 3,
  "wx": 3,
  "wy": 3,
  "inc": 3,
  "thomasT": 3,
  "inds": 3,
  "fun2": 3,
  "Mv": 3,
  "numsize": 3,
  "markl": 3,
  "mnx": 3,
  "maxpos": 3,
  "contains_0": 3,
  "roll": 3,
  "10000010": 3,
  "crr": 3,
  "special": 3,
  "dfs0": 3,
  "getLower": 3,
  "p100": 3,
  "count_zero": 3,
  "cnted": 3,
  "x6": 3,
  "x7": 3,
  "x8": 3,
  "x9": 3,
  "x10": 3,
  "lowerbound": 3,
  "easy": 3,
  "block": 3,
  "trm": 3,
  "tgm": 3,
  "tbm": 3,
  "zeroCount": 3,
  "tep1": 3,
  "tep2": 3,
  "1e+5": 3,
  "d4": 3,
  "39": 3,
  "ew": 3,
  "papersper": 3,
  "papersreq": 3,
  "such": 3,
  "unsuch": 3,
  "numround": 3,
  "isLucky": 3,
  "Psize": 3,
  "Msize": 3,
  "PEsize": 3,
  "flg2": 3,
  "mns": 3,
  "2000000009": 3,
  "loaded": 3,
  "INFLL": 3,
  "qx1": 3,
  "qy1": 3,
  "shovel": 3,
  "upit": 3,
  "cnt_dit": 3,
  "cnt_lit": 3,
  "cnt_big": 3,
  "Too weak": 3,
  "000000": 3,
  "prr": 3,
  "wr": 3,
  "Diff": 3,
  "digit1": 3,
  "inp2": 3,
  "2013": 3,
  "chot": 3,
  "nechot": 3,
  "mpb": 3,
  "2000000000000000000LL": 3,
  "sum4": 3,
  "increase": 3,
  "addl": 3,
  "addr": 3,
  "exchanges": 3,
  "dis3": 3,
  "given": 3,
  "XL": 3,
  "XXL": 3,
  "XXXL": 3,
  "XS": 3,
  "XXS": 3,
  "XXXS": 3,
  "twos": 3,
  "threes": 3,
  "15\\n": 3,
  "250.0": 3,
  "pom": 3,
  "blep": 3,
  "sum_positive": 3,
  "sum_negative": 3,
  "jsq": 3,
  "murdered": 3,
  "FoundCard": 3,
  "charToInt": 3,
  "list2": 3,
  "lastZero": 3,
  "jy": 3,
  "restorePass": 3,
  "binaryResult": 3,
  "isStop": 3,
  "zw": 3,
  "PD": 3,
  "duration": 3,
  "find_it": 3,
  "abcnt": 3,
  "flag_1": 3,
  "resp1": 3,
  "resp2": 3,
  "once": 3,
  "hand": 3,
  "act1": 3,
  "act2": 3,
  "c44": 3,
  "qo": 3,
  "max_nuts_in_sec": 3,
  "hlp": 3,
  "rim": 3,
  "dif1": 3,
  "old": 3,
  "1999999999": 3,
  "quo": 3,
  "output2": 3,
  "curs": 3,
  "nposi": 3,
  "galaxy": 3,
  "abajo": 3,
  "before": 3,
  "30001": 3,
  "str4": 3,
  "lie": 3,
  "part": 3,
  "th": 3,
  "old_t": 3,
  "code": 3,
  "fg": 3,
  "91": 3,
  "106": 3,
  "occurances": 3,
  "case": 3,
  "acosign": 3,
  "ud": 3,
  "buffer": 3,
  "1000004": 3,
  "getans": 3,
  "bitshift": 3,
  "te": 3,
  "maxk": 3,
  "may": 3,
  "Blue": 3,
  "momo": 3,
  "cant": 3,
  "ara2": 3,
  "alphabetical": 3,
  "more": 3,
  "null": 3,
  "2000001": 3,
  "trunc": 3,
  "minm": 3,
  "fre": 3,
  "n4": 3,
  "positive": 3,
  "tmo": 3,
  "flagA": 3,
  "indefintely": 3,
  "istrue": 3,
  "43": 3,
  "nextPrime": 3,
  "tol": 3,
  "Number": 3,
  "maxlen": 3,
  "10.00": 3,
  "bak": 3,
  "ANS": 3,
  "300300": 3,
  "che": 3,
  "smallest": 3,
  "nw": 3,
  "LONG_LONG_MAX": 3,
  "sortDes": 3,
  "CP.inp": 3,
  "CP.out": 3,
  "free": 3,
  "works": 3,
  "sum_a": 3,
  "sum_b": 3,
  "mc": 3,
  "psum": 3,
  "maxc": 3,
  "Output": 3,
  "tree": 3,
  "BFS": 3,
  "seen": 3,
  "leaf": 3,
  "tp1": 3,
  "tp2": 3,
  "rotate3": 3,
  "spec": 3,
  "clo": 3,
  "Home": 3,
  "dua": 3,
  "nt": 3,
  "hj": 3,
  "ihash": 3,
  "modn": 3,
  "125": 3,
  "ats": 3,
  "lin": 3,
  "0x3fffffff": 3,
  "lx": 3,
  "crew": 3,
  "lf": 3,
  "com": 3,
  "ks": 3,
  "correct": 3,
