{
  ";": 78975,
  "(": 52331,
  ")": 52323,
  "i": 38785,
  "=": 38013,
  "int": 33361,
  "[": 30946,
  "]": 30943,
  "0": 29725,
  "<<": 28410,
  ",": 28026,
  "1": 24172,
  "n": 23448,
  ">>": 23309,
  "if": 22806,
  "cout": 21401,
  "++": 20213,
  "cin": 19772,
  "a": 19394,
  "-": 18572,
  "for": 17979,
  "endl": 17523,
  "<": 17133,
  "\"": 16534,
  "{": 16154,
  "}": 16153,
  "return": 15664,
  "==": 15521,
  "+": 14488,
  "main()": 13938,
  "print": 13448,
  "\u2018": 13376,
  "\u2019": 13376,
  "read": 13070,
  "long": 12620,
  "to": 12450,
  "'": 11727,
  "else": 11643,
  "in": 11139,
  "and": 11120,
  "not": 10930,
  "j": 10704,
  "of": 10463,
  ">": 10385,
  "declared": 10358,
  "this": 10345,
  "was": 10344,
  "scope": 10344,
  "is": 10225,
  "0;": 10120,
  "*": 9613,
  "2": 9166,
  "s": 9069,
  "b": 8705,
  "while": 8445,
  "expected": 8153,
  ".": 8102,
  "before": 8018,
  "x": 8002,
  "<=": 7994,
  "integer": 7320,
  "k": 7053,
  "with": 6852,
  "char": 6323,
  "exclusive": 6267,
  "set": 6198,
  "size": 6177,
  "ans": 6076,
  "+=": 6048,
  "m": 5924,
  "%": 5777,
  "create": 5774,
  "/": 5685,
  "integers": 5661,
  "&&": 5566,
  ":": 5268,
  "increment": 5260,
  "c": 5182,
  "array": 5161,
  "token": 5090,
  "string": 5076,
  "no": 4572,
  "from": 4531,
  "std": 4421,
  "than": 4280,
  "!=": 4160,
  "types": 4135,
  "t": 4122,
  "by": 4085,
  "fpermissive": 4040,
  "the": 3965,
  "declare": 3924,
  "--": 3838,
  "y": 3813,
  "function": 3754,
  "invalid": 3672,
  "main": 3576,
  ">=": 3575,
  "equal": 3537,
  "newline": 3511,
  "redeclaration": 3282,
  "be": 3260,
  "operator": 3230,
  "expression": 3186,
  "aka": 3182,
  "l": 3159,
  "new": 3130,
  "name": 3068,
  "type": 3065,
  "primary": 3064,
  "let": 3032,
  "break": 2988,
  "or": 2964,
  "\\n": 2949,
  "greater": 2942,
  "loop": 2914,
  "3": 2911,
  "const": 2879,
  "d": 2846,
  "are": 2836,
  "value": 2835,
  "operand": 2810,
  "!": 2809,
  "inclusive": 2805,
  "ISO": 2719,
  "less": 2570,
  "__cxx11": 2549,
  "match": 2534,
  "sum": 2523,
  "bool": 2495,
  "length": 2474,
  "NO": 2450,
  "true": 2432,
  "do": 2415,
  "basic_string": 2369,
  "scoping": 2356,
  "lookup": 2356,
  "changed": 2356,
  "10": 2330,
  "&": 2315,
  "YES": 2309,
  "p": 2305,
  "||": 2274,
  "r": 2256,
  "member": 2256,
  "call": 2249,
  "4": 2231,
  "class": 2220,
  "v": 2115,
  "line": 2077,
  "min": 2075,
  "max": 2067,
  "input": 2048,
  "N": 2009,
  "5": 1978,
  "matching": 1892,
  "non": 1805,
  "argument": 1804,
  "end": 1779,
  "arr": 1765,
  "-=": 1754,
  "cnt": 1730,
  "decrement": 1680,
  "conversion": 1647,
  "initializer": 1643,
  "constant": 1642,
  "which": 1598,
  "as": 1593,
  "then": 1534,
  "vector": 1533,
  "request": 1528,
  "false": 1518,
  "variable": 1492,
  "gets": 1481,
  "character": 1401,
  "cannot": 1400,
  "assign": 1396,
  "7": 1353,
  "f": 1348,
  "sort": 1339,
  "flag": 1338,
  "str": 1332,
  "push_back": 1323,
  "declaration": 1310,
  "id": 1297,
  "subscript": 1297,
  "\\": 1275,
  "add": 1246,
  "increase": 1239,
  "modulo": 1227,
  "abs": 1196,
  "void": 1195,
  "convert": 1192,
  "unqualified": 1187,
  "change": 1138,
  "begin": 1134,
  "temp": 1131,
  "conflicting": 1127,
  "mod": 1121,
  "elements": 1106,
  "q": 1082,
  "arguments": 1077,
  "an": 1076,
  "ints": 1062,
  "res": 1061,
  "getchar": 1058,
  "z": 1045,
  "num": 1029,
  "?": 1028,
  "count": 1021,
  "has": 1020,
  "continue": 1017,
  "istream": 1015,
  "basic_istream": 997,
  "into": 984,
  "at": 976,
  "/=": 964,
  "output": 961,
  "named": 949,
  "A": 938,
  "one": 916,
  "following": 911,
  "maxn": 894,
  "h": 891,
  "100": 872,
  "strings": 827,
  "incrementing": 825,
  "variables": 801,
  "redefinition": 778,
  "returning": 768,
  "result": 764,
  "6": 760,
  "s1": 760,
  "len": 748,
  "C": 748,
  "longs": 739,
  "double": 728,
  "boolean": 724,
  "numeric": 723,
  "operands": 722,
  "x1": 720,
  "binary": 718,
  "w": 707,
  "values": 696,
  "*=": 686,
  "standard": 665,
  "u": 664,
  "assignment": 658,
  "e": 655,
  "first": 654,
  "8": 654,
  "YES\\n": 653,
  "memset": 648,
  "between": 645,
  "x2": 640,
  "sizeof": 632,
  "pointer": 631,
  "9": 629,
  "start": 627,
  "it": 620,
  "push": 604,
  "s2": 602,
  "map": 597,
  "insert": 589,
  "1e9": 588,
  "does": 588,
  "y1": 586,
  "Read": 583,
  "S": 579,
  "mp": 576,
  "NO\\n": 554,
  "arrays": 551,
  "called": 548,
  "g": 547,
  "element": 544,
  "getline": 540,
  "missing": 539,
  "dp": 535,
  "1000": 525,
  "ch": 523,
  "puts": 519,
  "user": 519,
  "y2": 516,
  "R": 516,
  "without": 516,
  "105": 514,
  "too": 513,
  "previous": 507,
  "tmp": 503,
  "terminating": 494,
  "gcd": 487,
  "%=": 486,
  " ": 486,
  "L": 477,
  "that": 470,
  "even": 463,
  "D": 459,
  "minimum": 457,
  "forbids": 457,
  "2d": 457,
  "B": 455,
  "mx": 449,
  "used": 449,
  "comparison": 446,
  "decrease": 440,
  "make": 440,
  "template": 434,
  "M": 432,
  "run": 432,
  "statement": 416,
  "lvalue": 414,
  "returns": 413,
  "absolute": 413,
  "find": 412,
  "check": 410,
  "equals": 409,
  "get": 406,
  "initialized": 406,
  "left": 405,
  "-1": 401,
  "characters": 399,
  "strlen": 396,
  "|": 395,
  "t1": 394,
  "define": 392,
  "required": 385,
  "vis": 384,
  "overloaded": 384,
  "second": 382,
  "have": 382,
  "o": 382,
  "maximum": 382,
  "stop": 382,
  "pos": 380,
  "on": 372,
  "decrementing": 369,
  "101": 368,
  "::": 365,
  "MOD": 362,
  "26": 360,
  "INF": 359,
  "iterator": 358,
  "otherwise": 357,
  "all": 353,
  "t2": 342,
  "unary": 339,
  "T": 336,
  "#": 330,
  "initialization": 328,
  "few": 327,
  "solve": 326,
  "st": 325,
  "substr": 319,
  "0x3f3f3f3f": 314,
  "index": 312,
  "each": 311,
  "a1": 303,
  "ok": 299,
  "p2": 298,
  "cur": 295,
  "val": 294,
  "12": 293,
  "two": 293,
  "unsigned": 292,
  "1e5": 292,
  "p1": 290,
  "Yes": 287,
  "No": 287,
  "swap": 285,
  "must": 277,
  "brace": 274,
  "enclosed": 274,
  "iteration": 274,
  "sqrt": 263,
  "c1": 261,
  "20": 260,
  "odd": 258,
  "100005": 254,
  "reading": 254,
  "taking": 254,
  "mn": 251,
  "110": 248,
  "incompatible": 248,
  "ar": 246,
  "dfs": 243,
  "subtract": 242,
  "exit": 241,
  "mid": 241,
  "K": 241,
  "xx": 239,
  "last": 238,
  "where": 238,
  "size_t": 237,
  "unresolved": 236,
  "append": 235,
  "pair": 234,
  "^": 231,
  "sum1": 231,
  "1000000007": 230,
  "number": 228,
  "inf": 227,
  "100000": 220,
  "divide": 220,
  "a2": 219,
  "1005": 218,
  "MAX": 217,
  "15": 217,
  "MAXN": 214,
  "minn": 212,
  "30": 211,
  "U": 210,
  "c2": 210,
  "times": 210,
  "erase": 209,
  "now": 209,
  "both": 208,
  "right": 208,
  "different": 208,
  "ret": 207,
  "basic_ostream": 207,
  "11": 205,
  "truthy": 205,
  "ceil": 204,
  "l1": 203,
  "prime": 203,
  "clear": 200,
  "sum2": 200,
  "ss": 197,
  "takes": 197,
  "l2": 195,
  "200": 191,
  "__gcd": 191,
  "v1": 189,
  "many": 188,
  "empty": 187,
  "bitwise": 187,
  "pop": 183,
  "25": 182,
  "total": 180,
  "inline": 178,
  "reverse": 177,
  "data": 177,
  "down": 176,
  "beginning": 175,
  "size_type": 174,
  "ans1": 172,
  "bytes": 172,
  "\\0": 169,
  "ma": 169,
  "within": 169,
  "x3": 168,
  "remove": 168,
  "counter": 167,
  "1.0": 166,
  "ans2": 165,
  "dy": 164,
  "acos": 161,
  "next": 161,
  "INT_MAX": 161,
  ">>=": 161,
  "yy": 160,
  "scalar": 160,
  "maxx": 159,
  "reference": 158,
  "n1": 157,
  "G": 157,
  "out": 155,
  "top": 153,
  "idx": 152,
  "requested": 152,
  "show": 151,
  "display": 151,
  "O": 150,
  "50": 150,
  "b1": 150,
  "_Alloc": 150,
  "1LL": 149,
  "60": 149,
  "could": 149,
  "k1": 146,
  "1001": 145,
  "48": 145,
  "maxi": 145,
  "wrong": 143,
  "cont": 142,
  "n2": 141,
  "more": 141,
  "allocator": 138,
  "P": 137,
  "W": 137,
  "tot": 136,
  "contextual": 136,
  "information": 136,
  "casted": 136,
  "10000": 135,
  "space": 135,
  "should": 133,
  "dx": 131,
  "d1": 131,
  "Friendship": 131,
  "d2": 128,
  "__gnu_cxx": 128,
  "1e6": 127,
  "y3": 126,
  "zero": 126,
  "180": 126,
  "__istream_type": 126,
  "100010": 125,
  "aux": 125,
  "row": 125,
  "Z": 124,
  "back": 124,
  "further": 124,
  "least": 124,
  "|=": 123,
  "k2": 122,
  "strcmp": 121,
  "can": 120,
  "1000000": 120,
  "-1\\n": 120,
  "PI": 119,
  "program": 119,
  "pi": 118,
  "col": 118,
  "time": 117,
  "100001": 117,
  "r1": 116,
  "31": 116,
  "filled": 116,
  "ct": 115,
  "h1": 114,
  "current": 114,
  "up": 113,
  "->": 112,
  "mark": 112,
  "360": 112,
  "order": 112,
  "rvalue": 112,
  "power": 111,
  "switch": 111,
  "multiple": 111,
  "X": 110,
  "I": 110,
  "use": 110,
  "substring": 110,
  "s3": 108,
  "make_pair": 108,
  "vec": 107,
  "v2": 107,
  "lcm": 107,
  "Y": 107,
  "unique": 107,
  "root": 107,
  "r2": 106,
  "go": 106,
  "char_type": 106,
  "ind": 105,
  "tolower": 105,
  "998244353": 104,
  "cnt1": 104,
  "flag1": 103,
  "1e": 103,
  "multiply": 103,
  "aa": 102,
  "position": 102,
  "sz": 101,
  "front": 101,
  "f1": 100,
  "pow": 100,
  "endline": 100,
  "h2": 99,
  "32": 99,
  "str1": 99,
  "decremented": 99,
  "Q": 98,
  "__normal_iterator": 98,
  "looping": 98,
  "stray": 98,
  "float": 97,
  "square": 97,
  "answer": 96,
  "da": 96,
  "First": 95,
  "only": 95,
  "Second": 94,
  "defined": 93,
  "rest": 92,
  "max1": 91,
  "97": 91,
  "f2": 90,
  "55": 90,
  "mm": 89,
  "starting": 89,
  "rbegin": 88,
  "1010": 88,
  "t0": 88,
  "accepts": 88,
  "duplicate": 88,
  "str2": 87,
  "using": 87,
  "chars": 86,
  "list": 85,
  "2e5": 84,
  "pr": 84,
  "pt": 83,
  "bound": 83,
  "b2": 82,
  "plus": 82,
  "isn": 82,
  "": 81,
  "low": 81,
  "num2": 81,
  "priority_queue": 81,
  "V": 81,
  "dif": 80,
  "pre": 80,
  "init": 80,
  "stdout": 80,
  "bitshift": 80,
  "parameter": 80,
  "200005": 79,
  "H": 79,
  "base": 79,
  "iterate": 79,
  "F": 78,
  "num1": 78,
  "q1": 78,
  "nn": 78,
  "keep": 78,
  "qm": 78,
  "valid": 77,
  "1e18": 77,
  "adj": 77,
  "dimensional": 77,
  "vectors": 77,
  "EPS": 76,
  "initializers": 76,
  "sizes": 76,
  "judge": 75,
  "m1": 75,
  "table": 75,
  "cnt2": 75,
  "ara": 75,
  "stream": 75,
  "diff": 74,
  "rows": 74,
  "a3": 74,
  "p3": 74,
  "constructor": 74,
  "rs": 73,
  "cost": 73,
  "visited": 73,
  "ii": 73,
  "eps": 72,
  "bb": 72,
  "queue": 72,
  "ascending": 72,
  "char_traits": 72,
  "skip": 72,
  "1000000000": 71,
  "0\\n": 71,
  "1\\n": 70,
  "db": 70,
  "destructor": 70,
  "_CharT": 70,
  "_Traits": 70,
  "rem": 69,
  "found": 69,
  "mini": 69,
  "flag2": 68,
  "cmp": 68,
  "q2": 68,
  "min2": 67,
  "ex": 67,
  "13": 67,
  "__ostream_type": 67,
  "step": 66,
  "curr": 66,
  "lower": 66,
  "through": 66,
  "postfix": 66,
  "point": 65,
  "booleans": 65,
  "_Tp": 65,
  "npos": 64,
  "mi": 63,
  "columns": 63,
  "my": 63,
  "fixed": 63,
  "after": 63,
  "value1": 63,
  "Max": 62,
  "precision": 62,
  "freq": 62,
  "jj": 62,
  "SEGMENT": 62,
  "IMPOSSIBLE": 62,
  "TRIANGLE": 62,
  "1e-9": 61,
  "^=": 61,
  "div": 61,
  "red": 61,
  "remainder": 61,
  "until": 61,
  "divided": 61,
  "infinite": 61,
  "int64_t": 60,
  "digit": 60,
  "max_element": 60,
  "toupper": 60,
  "compare": 60,
  "ith": 59,
  "Yes\\n": 58,
  "No\\n": 58,
  "sm": 58,
  "Mishka": 58,
  "#Color": 58,
  "reverse_iterator": 58,
  "RIGHT": 57,
  "2e9": 57,
  "shift": 57,
  "cr": 57,
  "pic": 57,
  "Chris": 57,
  "ALMOST": 56,
  "tt": 56,
  "nl": 56,
  "Mahmoud": 56,
  "Ehab": 56,
  "rat": 56,
  "man": 56,
  "minus": 56,
  "setting": 56,
  "counting": 56,
  "rend": 55,
  "500": 55,
  "po": 55,
  "ostream": 55,
  "resize": 54,
  "kk": 54,
  "102": 54,
  "Dp": 54,
  "tc": 54,
  "blue": 54,
  "magic": 54,
  "isprime": 53,
  "co": 53,
  "bit": 53,
  "Correct": 53,
  "Terminate": 53,
  "OR": 53,
  "register": 52,
  "White": 52,
  "fill": 52,
  "letter": 52,
  "1000005": 52,
  "head": 52,
  "word": 52,
  "count1": 52,
  "green": 52,
  "nothing": 52,
  "contents": 52,
  "_Rb_tree_iterator": 52,
  "short": 51,
  "51": 51,
  "Black": 51,
  "28": 51,
  "21": 51,
  "child": 51,
  "freopen": 51,
  "Time": 51,
  "woman": 51,
  "cast": 51,
  "INT_MIN": 50,
  "yu2": 50,
  "27": 50,
  "10005": 50,
  "minx": 50,
  "pri": 50,
  "arr2": 50,
  "t3": 50,
  "np": 50,
  "la": 49,
  "win": 49,
  "goto": 49,
  "hh": 49,
  "i2": 49,
  "cek": 49,
  "fast": 49,
  "arr1": 49,
  "floor": 48,
  "a0": 48,
  "Power": 48,
  "se": 48,
  "yes": 48,
  "pop_back": 48,
  "Grades": 48,
  "Malvika": 48,
  "Akshat": 48,
  "ty": 47,
  "201": 47,
  "test": 47,
  "pa": 47,
  "items": 47,
  "lb": 46,
  "flg": 46,
  "Impossible": 46,
  "24": 46,
  "w1": 46,
  "cod": 46,
  "250": 46,
  "Anton": 46,
  "Danik": 46,
  "vv": 45,
  "black": 45,
  "am": 45,
  "10000000": 45,
  "mat": 45,
  "111": 45,
  "min1": 45,
  "value2": 45,
  "keyboard": 45,
  "RU": 45,
  "v0": 45,
  "magic!^^": 45,
  "tx": 44,
  "forward": 44,
  "dist": 44,
  "E": 44,
  "suma": 44,
  "primes": 44,
  "isPrime": 44,
  "points": 44,
  "23": 44,
  "dis": 44,
  "LEFT": 44,
  "LD": 44,
  "LU": 44,
  "RD": 44,
  "2/3": 44,
  "ns": 43,
  "move": 43,
  "len1": 43,
  "2000": 43,
  "sol": 43,
  "nums": 43,
  "mins": 43,
  "cw": 43,
  "ccw": 43,
  "UP": 43,
  "DOWN": 43,
  "Space": 43,
  "Soul": 43,
  "Reality": 43,
  "Mind": 43,
  "_Rb_tree_const_iterator": 43,
  "shadows": 43,
  "l3": 42,
  "isdigit": 42,
  "dm": 42,
  "high": 42,
  "0LL": 42,
  "stack": 42,
  "fabs": 42,
  "ne": 42,
  "2005": 42,
  "200000": 42,
  "22": 42,
  "150": 42,
  "store": 42,
  "Karen": 42,
  "changing": 42,
  "HIM": 42,
  "Boolean": 42,
  "isok": 41,
  "i1": 41,
  "prev": 41,
  "upper": 41,
  "initialize": 41,
  "captain": 41,
  "fa": 41,
  "ios_base": 41,
  "case": 41,
  "HER": 41,
  "WITH": 41,
  "CHAT": 41,
  "IGNORE": 41,
  "Oh,": 41,
  "calc": 40,
  "ay": 40,
  "visit": 40,
  "round": 40,
  "1000000009": 40,
  "setprecision": 40,
  "m2": 40,
  "Ron": 40,
  "1e3": 40,
  "120": 40,
  "day": 40,
  "Vasya": 40,
  "matrix": 40,
  "uneven": 40,
  "respectively": 40,
  "squared": 40,
  "ignore": 39,
  "ci": 39,
  "19": 39,
  "lucky": 39,
  "86400": 39,
  "Sheldon": 39,
  "Leonard": 39,
  "Penny": 39,
  "Rajesh": 39,
  "Howard": 39,
  "Tie": 39,
  "Misha": 39,
  "chest": 39,
  "biceps": 39,
  "putchar": 38,
  "yu1": 38,
  "days": 38,
  "isupper": 38,
  "tab": 38,
  "u1": 38,
  "tb": 38,
  "240": 38,
  "file": 38,
  "compound": 38,
  "treated": 38,
  "invoke": 38,
  "become": 38,
  "Oh": 38,
  "guy": 38,
  "len2": 37,
  "205": 37,
  "ti": 37,
  "inp": 37,
  "temp1": 37,
  "exp": 37,
  "35": 37,
  "ff": 37,
  "sieve": 37,
  "same": 37,
  "here": 37,
  "price": 37,
  "Tetrahedron": 37,
  "Cube": 37,
  "Octahedron": 37,
  "Dodecahedron": 37,
  "rounded": 37,
  "strstr": 36,
  "backward": 36,
  "appear": 36,
  "cal": 36,
  "fl": 36,
  "s4": 36,
  "2.0": 36,
  "chair": 36,
  "u2": 36,
  "orange": 36,
  "reset": 36,
  "increasing": 36,
  "doubles": 36,
  "color": 35,
  "score": 35,
  "PRINT": 35,
  "200010": 35,
  "need": 35,
  "nx": 35,
  "bits": 35,
  "yellow": 35,
  "post": 35,
  "uninitialized": 35,
  "definition": 35,
  "put": 35,
  "Min": 34,
  "18": 34,
  "node": 34,
  "16": 34,
  "stdin": 34,
  "min3": 34,
  "J": 34,
  "brr": 34,
  "ra": 34,
  "home": 34,
  "purple": 34,
  "ta": 34,
  "item": 34,
  "returned": 34,
  "address": 34,
  "th": 34,
  "allowed": 34,
  "calling": 34,
  "HIM!": 34,
  "mapped_type": 34,
  "+------------------------+": 34,
  "keyboard!": 34,
  "guy.": 34,
  "Color": 34,
  "0.0": 33,
  "write": 33,
  "300": 33,
  "2147483647": 33,
  "fun": 33,
  "200001": 33,
  "p4": 33,
  "decreasing": 33,
  "identifier": 33,
  "HER!": 33,
  "1ll": 32,
  "msk": 32,
  "pw": 32,
  "spf": 32,
  "cx": 32,
  "cy": 32,
  "1e7": 32,
  "ch1": 32,
  "ab": 32,
  "max2": 32,
  "T1": 32,
  "ql": 32,
  "qr": 32,
  "Alice": 32,
  "Bob": 32,
  "integral": 32,
  "falsy": 32,
  "lol": 31,
  "cou": 31,
  "MAX_N": 31,
  "digits": 31,
  "undefined": 31,
  "txt": 31,
  "rock": 31,
  "field": 31,
  "multiplied": 31,
  "struct": 31,
  "1/2": 31,
  "OO": 31,
  "ts": 30,
  "tp": 30,
  "oo": 30,
  "&=": 30,
  "fin": 30,
  "kol": 30,
  "dig": 30,
  "soma": 30,
  "bl": 30,
  "d3": 30,
  "distance": 30,
  "en": 30,
  "re": 30,
  "Icosahedron": 30,
  "cc": 30,
  "three": 30,
  "scissors": 30,
  "paper": 30,
  "positive": 30,
  "__type": 30,
  "64": 30,
  "pop_front": 30,
  "OOOO": 30,
  "white": 29,
  "5005": 29,
  "done": 29,
  "temp2": 29,
  "20000": 29,
  "5001": 29,
  "rec": 29,
  "next_permutation": 29,
  "sub": 29,
  "fact": 29,
  "MX": 29,
  "1000001": 29,
  "122": 29,
  "contest": 29,
  "width": 29,
  "O-|-OOOO": 29,
  "book": 29,
  "suffix": 29,
  "acosign": 29,
  "containing": 29,
  "proceed": 29,
  "WINS": 29,
  "TEAM": 29,
  "TIE": 29,
  "its": 29,
  "R\\n": 29,
  "_b": 28,
  "hy": 28,
  "hor": 28,
  "trees": 28,
  "ed": 28,
  "e1": 28,
  "1e8": 28,
  "copy": 28,
  "c_str": 28,
  "Hermione": 28,
  "pm": 28,
  "mask": 28,
  "fb": 28,
  "Dasha": 28,
  "Masha": 28,
  "Equal": 28,
  "Incorrect": 28,
  "nonzero": 28,
  "method": 28,
  "args": 28,
  "form": 28,
  "[]": 28,
  "sqr": 27,
  "sa": 27,
  "sb": 27,
  "0.5": 27,
  "hm": 27,
  "req": 27,
  "setf": 27,
  "save": 27,
  "29": 27,
  "40": 27,
  "b3": 27,
  "numberOfPartialAns": 27,
  "stringstream": 27,
  "min_element": 27,
  "mymap": 27,
  "UR": 27,
  "..": 27,
  "128": 26,
  "1000006": 26,
  "c3": 26,
  "hasil": 26,
  "2001": 26,
  "open": 26,
  "mult": 26,
  "resolve": 26,
  "Next": 26,
  "ml": 26,
  "100100": 26,
  "ms": 26,
  "103": 26,
  "lfp": 26,
  "qwertyuiopasdfghjkl;zxcvbnm,./": 26,
  "dir": 26,
  "pairs": 26,
  "DL": 26,
  "65": 26,
  "label": 26,
  "_Compare": 26,
  "_Key": 26,
  "place": 26,
  "contains": 26,
  "having": 26,
  "#Black&White": 26,
  "A\\n": 26,
  "love": 26,
  "hate": 26,
  "1e-8": 25,
  "itr": 25,
  "ui": 25,
  "10001": 25,
  "hi": 25,
  "ada": 25,
  "cycles": 25,
  "vetor": 25,
  "rep": 25,
  "par": 25,
  "like": 25,
  "mas": 25,
  "transform": 25,
  "5000": 25,
  "2000000": 25,
  "there": 25,
  "negative": 25,
  "tar": 25,
  "sx": 25,
  "sy": 25,
  "n3": 25,
  "***": 25,
  "impossible": 25,
  "1000010": 25,
  "adding": 25,
  "but": 25,
  "1/6": 25,
  "decimal": 25,
  "search": 24,
  "maxm": 24,
  "flog": 24,
  "1e-6": 24,
  "sc": 24,
  "cnt0": 24,
  "cad": 24,
  "atkm": 24,
  "96": 24,
  "1e2": 24,
  "1e4": 24,
  "ad": 24,
  "work": 24,
  "bs": 24,
  "pl": 24,
  "14": 24,
  "path": 24,
  "123": 24,
  "parent": 24,
  "op": 24,
  "maxa": 24,
  "DP": 24,
  "TESTS": 24,
  "yes\\n": 24,
  "count2": 24,
  "throw": 24,
  "__enable_if": 24,
  "1e-7": 23,
  "P1": 23,
  "stu": 23,
  "def": 23,
  "pal": 23,
  "sushu": 23,
  "3e5": 23,
  "lo": 23,
  "cap": 23,
  "major": 23,
  "minor": 23,
  "strange": 23,
  "dfs2": 23,
  "ck": 23,
  "possible": 23,
  "md": 23,
  "num3": 23,
  "res1": 23,
  "resp": 23,
  "v3": 23,
  "board": 23,
  "lowercase": 23,
  "bigger": 23,
  "400": 23,
  "Too": 23,
  "weak": 23,
  "GOTO": 23,
  "zxcvbnm": 23,
  "strcpy": 22,
  "fantasy": 22,
  "ac": 22,
  "neg": 22,
  "newdp": 22,
  "br": 22,
  "visit1": 22,
  "bc": 22,
  "names": 22,
  "pref": 22,
  "ch2": 22,
  "tem": 22,
  "sumb": 22,
  "rx": 22,
  "e2": 22,
  "Set": 22,
  "O-|": 22,
  "sign": 22,
  "inlined": 22,
  "execute": 22,
  "infinitely": 22,
  "Still": 22,
  "Rozdil": 22,
  "O.": 22,
  "Vasilisa": 22,
  "OOO": 22,
  "ls": 21,
  "atky": 21,
  "2\\n": 21,
  "res_x": 21,
  "res_y": 21,
  "cn": 21,
  "~": 21,
  "lower_bound": 21,
  "mul": 21,
  "level": 21,
  "mmap": 21,
  "notes": 21,
  "2e6": 21,
  "cs": 21,
  "sl": 21,
  "winner": 21,
  "r3": 21,
  "w2": 21,
  "ny": 21,
  "dr": 21,
  "target": 21,
  "ifstream": 21,
  "ctr": 21,
  "father": 21,
  "EASY": 21,
  "HARD": 21,
  "no\\n": 21,
  "maps": 21,
  "90": 21,
  "code": 21,
  "ambiguous": 21,
  "DR": 21,
  "UL": 21,
  "based": 21,
  "been": 21,
  "pointers": 21,
  "modulus": 21,
  "|.|)": 21,
  "1/3": 21,
  "1/1": 21,
  "zeroes": 20,
  "comp": 20,
  "coun": 20,
  "atk": 20,
  "byte": 20,
  "inv": 20,
  "dd": 20,
  "1000003": 20,
  "hit": 20,
  "dem": 20,
  "maxl": 20,
  "atoi": 20,
  "nextDiv": 20,
  "ry": 20,
  "slen": 20,
  "Hanako": 20,
  "Ciel": 20,
  "MIN": 20,
  "nb": 20,
  "305": 20,
  "sum3": 20,
  "qi": 20,
  "5.0": 20,
  "Mishka\\n": 20,
  "incremented": 20,
  "Nikita": 20,
  "Olya": 20,
  "Slava": 20,
  "Ann": 20,
  "Danil": 20,
  "every": 20,
  "mismatch": 20,
  "Vasilisa.": 20,
  "qwertyuiopasdfghjkl": 20,
  "5/6": 20,
  "RIGHT\\n": 19,
  "colors": 19,
  "fr": 19,
  "1100": 19,
  "ver": 19,
  "log2": 19,
  "MN": 19,
  "huiwen": 19,
  "exgcd": 19,
  "ba": 19,
  "numberOfStudents": 19,
  "9999999": 19,
  "cards": 19,
  "output.txt": 19,
  "x4": 19,
  "graph": 19,
  "numbers": 19,
  "mn2": 19,
  "key": 19,
  "bfs": 19,
  "52": 19,
  "hello": 19,
  "ai": 19,
  "undefined\\n": 19,
  "discard": 19,
  "them": 19,
  "xor": 19,
  "-O|OOO-O": 19,
  "TRIANGLE\\n": 19,
  "int_r": 18,
  "name2": 18,
  "100007": 18,
  "ll": 18,
  "saturday": 18,
  "sunday": 18,
  "monday": 18,
  "tuesday": 18,
  "wednesday": 18,
  "thursday": 18,
  "friday": 18,
  "9223372036854775807": 18,
  "ssj": 18,
  "static": 18,
  "pp": 18,
  "pd": 18,
  "islower": 18,
  "rot": 18,
  "poww": 18,
  "62": 18,
  "grid": 18,
  "res2": 18,
  "upper_bound": 18,
  "over": 18,
  "menor": 18,
  "10010": 18,
  "l4": 18,
  "na": 18,
  "divis": 18,
  "fo": 18,
  "-O|": 18,
  "PRINT ": 18,
  "half": 18,
  "S1": 18,
  "ULDR": 18,
  "printing": 18,
  "overload": 18,
  "pq": 18,
  "jth": 18,
  "ought": 18,
  "ignored": 18,
  "lens": 17,
  "sq": 17,
  "dc": 17,
  "100000000": 17,
  "turn": 17,
  "999999": 17,
  "most": 17,
  "Input": 17,
  "Solve": 17,
  "_n": 17,
  "cp": 17,
  "AB": 17,
  "BA": 17,
  "val2": 17,
  "lim": 17,
  "505": 17,
  "tri": 17,
  "C#": 17,
  "D#": 17,
  "F#": 17,
  "G#": 17,
  "answ": 17,
  "update": 17,
  "1e10": 17,
  "mo": 17,
  "17": 17,
  "primeFactures": 17,
  "maxN": 17,
  "vowel": 17,
  "nc": 17,
  "any": 17,
  "blyat": 17,
  "Now": 17,
  "GCD": 17,
  "summ": 17,
  "Md": 17,
  "max3": 17,
  "prog": 17,
  "fi": 17,
  "LEFT\\n": 17,
  "best": 17,
  "#.": 17,
  "invert": 17,
  "specifier": 17,
  "If": 17,
  "reduce": 17,
  "condition": 17,
  "uppercase": 17,
  "it\\n": 17,
  "ln": 16,
  "lent": 16,
  "count_n": 16,
  "currnum": 16,
  "ios": 16,
  "lg": 16,
  "wi": 16,
  "chr": 16,
  "myMap": 16,
  "month": 16,
  "nxt": 16,
  "wei": 16,
  "mk": 16,
  "assert": 16,
  "59": 16,
  "dfs1": 16,
  "workdays": 16,
  "ip": 16,
  "tmp2": 16,
  "dia": 16,
  "mie": 16,
  "Arr": 16,
  "tag": 16,
  "Sentence": 16,
  "numb": 16,
  "cerr": 16,
  "mn1": 16,
  "shit": 16,
  "wt": 16,
  "skills": 16,
  "1002": 16,
  "numDiv": 16,
  "220": 16,
  "ansx": 16,
  "sw": 16,
  "indx": 16,
  "Ehab\\n": 16,
  "ax": 16,
  "nuts": 16,
  "box": 16,
  "Bob\\n": 16,
  "S2": 16,
  "Incorrect\\n": 16,
  "Correct\\n": 16,
  "inputs": 16,
  "vs": 16,
  "exadecimal": 16,
  "pointed": 16,
  "assigning": 16,
  "basic_stringstream": 16,
  "commamd": 16,
  "shifted": 16,
  "0ul": 16,
  "largest": 16,
  "Output": 16,
  "decreased": 16,
  "location": 16,
  "myset": 16,
  "501": 16,
  "-O|-OOOO": 16,
  "Koyomi": 16,
  "black\\n": 15,
  "99999999": 15,
  "256": 15,
  "count0": 15,
  "xa": 15,
  "xd": 15,
  "sta": 15,
  "127": 15,
  "32767": 15,
  "nd": 15,
  "tou": 15,
  "edges": 15,
  "fnd": 15,
  "max_i": 15,
  "fs": 15,
  "input.txt": 15,
  "rd": 15,
  "bk": 15,
  "Maxn": 15,
  "80": 15,
  "5e5": 15,
  "error": 15,
  "bv": 15,
  "big": 15,
  "light": 15,
  "ha": 15,
  "searchres": 15,
  "basis": 15,
  "rt": 15,
  "3f3f3f3f": 15,
  "Create": 15,
  "ri": 15,
  "|#.......................|": 15,
  "-O|O-OOO": 15,
  "-O|OOOO-": 15,
  "O-|O-OOO": 15,
  "O-|OOO-O": 15,
  "O-|OOOO-": 15,
  "O-|OO-OO": 15,
  "-O|OO-OO": 15,
  "chk": 14,
  "kmp": 14,
  "P2": 14,
  "fives": 14,
  "1e12": 14,
  "count_m": 14,
  "9223372036854775807LL": 14,
  "clock": 14,
  "mode": 14,
  "val1": 14,
  "occur": 14,
  "ones": 14,
  "row ": 14,
  "col ": 14,
  "con": 14,
  "__builtin_popcount": 14,
  "bigmod": 14,
  "100009": 14,
  "2002": 14,
  "tail": 14,
  "2LL": 14,
  "Mul": 14,
  "name1": 14,
  "max_ending_here": 14,
  "mina": 14,
  "alph": 14,
  "xop": 14,
  "neo": 14,
  "ansa": 14,
  "ant": 14,
  "L1": 14,
  "r4": 14,
  "j2": 14,
  "ey": 14,
  "pf": 14,
  "maxim": 14,
  "le": 14,
  "99": 14,
  "tm": 14,
  "a4": 14,
  "gr": 14,
  "state": 14,
  "hash": 14,
  "Alice\\n": 14,
  "Second\\n": 14,
  "hb": 14,
  "year": 14,
  "nested": 14,
  "other": 14,
  "0th": 14,
  "fmtflags": 14,
  "FILE": 14,
  "value_type": 14,
  "|#.#.#.#.#.#.#.#.#.#.#.|.|)": 14,
  "1st": 14,
  "D\\n": 14,
  "L\\n": 14,
  "NEITHER": 13,
  "pas": 13,
  "deque": 13,
  "fastIo": 13,
  "letters": 13,
  "zx": 13,
  "zy": 13,
  "aux2": 13,
  "rb": 13,
  "81": 13,
  "tam": 13,
  "3000": 13,
  "powmod": 13,
  "DELTA": 13,
  "bitset": 13,
  "1.5": 13,
  "abcdefghijklmnopqrstuvwxyz": 13,
  "capacity": 13,
  "LCM": 13,
  "ite": 13,
  "palindrome": 13,
  "divisor": 13,
  "qq": 13,
  "<<=": 13,
  "jarak": 13,
  "pass": 13,
  "dep": 13,
  "lp": 13,
  "nr": 13,
  "turns": 13,
  "3.14159265359": 13,
  "27000": 13,
  "max_": 13,
  "dragon": 13,
  "steps": 13,
  "me": 13,
  "act": 13,
  "99999": 13,
  "repeat": 13,
  "360.0": 13,
  "lena": 13,
  "cl": 13,
  "First\\n": 13,
  "DOWN\\n": 13,
  "UP\\n": 13,
  "ccw\\n": 13,
  "S3": 13,
  "600": 13,
  "36": 13,
  "bm": 13,
  "ele": 13,
  "iterations": 13,
  "default": 13,
  "_IO_FILE": 13,
  "null": 13,
  "noop": 13,
  "_Ios_Fmtflags": 13,
  "GCC": 13,
  "rad": 13,
  "|#.#.#.#.#.#.#.#.#.#.#.|.|": 13,
  "|#.#.#.#.#.#.#.#.#.#.#.|D|)": 13,
  "isalpha": 12,
  "pos_1": 12,
  "cnr": 12,
  "1009": 12,
  "nf": 12,
  "hr": 12,
  "center": 12,
  "BigInteger": 12,
  "max_so_far": 12,
  "banyakyangmilihini": 12,
  "100050": 12,
  "nC": 12,
  "gcd1": 12,
  "1000000009LL": 12,
  "m3": 12,
  "5050": 12,
  "flag0": 12,
  "prevbeg": 12,
  "prevlen": 12,
  "currcase": 12,
  "10000007": 12,
  "ld": 12,
  "dict": 12,
  "negativos": 12,
  "maxsum": 12,
  "unique_names": 12,
  "nega": 12,
  "posi": 12,
  "sumne": 12,
  "sumpo": 12,
  "acu": 12,
  "va": 12,
  "ranks": 12,
  "sizeedge": 12,
  "srand": 12,
  "vis1": 12,
  "Find": 12,
  "skill_level": 12,
  "1111111": 12,
  "10000000000": 12,
  "ya": 12,
  "ofstream": 12,
  "wz": 12,
  "cumm": 12,
  "test1": 12,
  "Ay": 12,
  "Dm": 12,
  "info": 12,
  "ak": 12,
  "pos1": 12,
  "cmax": 12,
  "NULL": 12,
  "last_start": 12,
  "Posution": 12,
  "300005": 12,
  "tsum": 12,
  "org": 12,
  "Mahmoud\\n": 12,
  "ca": 12,
  "tr": 12,
  "lenb": 12,
  "vect": 12,
  "sides": 12,
  "money": 12,
  "status": 12,
  "step_f": 12,
  "n0": 12,
  "_": 12,
  "spect": 12,
  "lca": 12,
  "999": 12,
  "comparator": 12,
  "you": 12,
  "good": 12,
  "x3f3f3f3f": 12,
  "smaller": 12,
  "X--": 12,
  "capital": 12,
  "leave": 12,
  "999999999": 12,
  "priority": 12,
  "take": 12,
  "210": 12,
  "IMPOSSIBLE\\n": 12,
  "st2": 11,
  "seat": 11,
  "num0": 11,
  "cont2": 11,
  "1e15": 11,
  "poww_mod": 11,
  "500000": 11,
  "ten": 11,
  "42": 11,
  "lang": 11,
  "grafo": 11,
  "vowels": 11,
  "ip2": 11,
  "1000100": 11,
  "00": 11,
  "lt": 11,
  "ini": 11,
  "maxnn": 11,
  "highest": 11,
  "binary_search": 11,
  "bad": 11,
  "150005": 11,
  "rv": 11,
  "ww": 11,
  "2010": 11,
  "fx": 11,
  "vn": 11,
  "active": 11,
  "lst": 11,
  "io": 11,
  "DFS": 11,
  "mx1": 11,
  "ansr": 11,
  "ox": 11,
  "oy": 11,
  "ansb": 11,
  "speed": 11,
  "pwr": 11,
  "tim": 11,
  "47": 11,
  "vc": 11,
  "bx": 11,
  "gl": 11,
  "maxs": 11,
  "z1": 11,
  "1000000001": 11,
  "hitung": 11,
  "Count": 11,
  "g1": 11,
  "so": 11,
  "men": 11,
  "words": 11,
  "arya": 11,
  "bran": 11,
  "beat": 11,
  "bi": 11,
  "back\\n": 11,
  "cup": 11,
  "banyak": 11,
  "el": 11,
  "siz": 11,
  "road": 11,
  "qua": 11,
  "arg1": 11,
  "dimensions": 11,
  "#Color\\n": 11,
  "contain": 11,
  "indefinitely": 11,
  "An": 11,
  "inner": 11,
  "Otherwise": 11,
  "dimension": 11,
  "going": 11,
  "1111": 11,
  "sets": 11,
  "infinity": 11,
  "joy": 11,
  "U\\n": 11,
  "SEGMENT\\n": 11,
  "pos_2": 10,
  "forw": 10,
  "backw": 10,
  "mp1": 10,
  "posy": 10,
  "posx": 10,
  "flag3": 10,
  "dig_n": 10,
  "dig_m": 10,
  "flags": 10,
  "exist": 10,
  "max_num": 10,
  "choose": 10,
  "cm": 10,
  "iC": 10,
  "eC": 10,
  "tC": 10,
  "bin": 10,
  "qpow": 10,
  "1.5e7": 10,
  "aux1": 10,
  "wrkdsz": 10,
  "fpow": 10,
  "emm1": 10,
  "lowest": 10,
  "nneg": 10,
  "2 ": 10,
  "Dist": 10,
  "arrx": 10,
  "isPalindrome": 10,
  "rotate": 10,
  "300000": 10,
  "limit": 10,
  "manz": 10,
  "rmark": 10,
  "time1": 10,
  "MODULUS": 10,
  "col1": 10,
  "coins": 10,
  "cent": 10,
  "distinct": 10,
  "sheets": 10,
  "0x7fffffff": 10,
  "id1": 10,
  "hashi": 10,
  "fy": 10,
  "nei": 10,
  "107": 10,
  "curr_size": 10,
  "curr_d": 10,
  "s25": 10,
  "primer": 10,
  "idx1": 10,
  "idx2": 10,
  "hero": 10,
  "af": 10,
  "masuk": 10,
  "bisa": 10,
  "modexp": 10,
  "prev_notup": 10,
  "zlicz": 10,
  "rr": 10,
  "uu": 10,
  "Dy": 10,
  "Hm": 10,
  "Am": 10,
  "var": 10,
  "desperate_optimization": 10,
  "fastexp": 10,
  "10000005": 10,
  "pos2": 10,
  "students": 10,
  "it1": 10,
  "vid": 10,
  "a5": 10,
  "sup": 10,
  "cot": 10,
  "modd": 10,
  "amazing": 10,
  "que": 10,
  "sumr": 10,
  "full": 10,
  "jum": 10,
  "carry": 10,
  "o1": 10,
  "qs": 10,
  "Oh, my keyboard!": 10,
  "finder": 10,
  "alpha": 10,
  "9999999999": 10,
  "YES\\n2\\n": 10,
  "144": 10,
  "qx": 10,
  "qy": 10,
  "sec": 10,
  "numa": 10,
  "inch": 10,
  "Ans": 10,
  "vet": 10,
  "rotasi": 10,
  "delta": 10,
  "arg2": 10,
  "counts": 10,
  "known": 10,
  "storage": 10,
  "LLONG_MAX": 10,
  "third": 10,
  "multiplying": 10,
  "li": 10,
  "followed": 10,
  "large": 10,
  "tmp1": 10,
  "colors.in": 10,
  "jump": 10,
  "time_t": 10,
  "smallest": 10,
  "duplicates": 10,
  "ssizetype": 10,
  "QAQ": 10,
  "moves": 10,
  "X++": 10,
  "++X": 10,
  "LINF": 9,
  "white\\n": 9,
  "es": 9,
  "mmp": 9,
  "tempname": 9,
  "SS": 9,
  "MINN": 9,
  "single": 9,
  "hp": 9,
  "time2": 9,
  "solve2": 9,
  "ic": 9,
  "9999": 9,
  "sk": 9,
  "max_n": 9,
  "1000020": 9,
  "cor": 9,
  "fn": 9,
  "seed": 9,
  "haogan": 9,
  "debug": 9,
  "studentsRate": 9,
  "med": 9,
  "build": 9,
  "major\\n": 9,
  "minor\\n": 9,
  "mapp": 9,
  "isp": 9,
  "gcdd": 9,
  "100004": 9,
  "is_same": 9,
  "same_num": 9,
  "su": 9,
  "pause": 9,
  "area": 9,
  "sp": 9,
  "ans3": 9,
  "fuck": 9,
  "no_of_digits": 9,
  "cnta": 9,
  "100003": 9,
  "amigos": 9,
  "pairt": 9,
  "lc": 9,
  "awalx": 9,
  "awaly": 9,
  "4000000": 9,
  "fim": 9,
  "1200000": 9,
  "sss": 9,
  "ansm": 9,
  "column": 9,
  "cyka": 9,
  "taken": 9,
  "nuevo": 9,
  "tl": 9,
  "numLeft": 9,
  "ansy": 9,
  "mis": 9,
  "fix": 9,
  "dic": 9,
  "remain": 9,
  "1000000007LL": 9,
  "INFF": 9,
  "1000000000000000005LL": 9,
  "nextVal": 9,
  "disk": 9,
  "showpoint": 9,
  "f3": 9,
  "fail": 9,
  "dif_row": 9,
  "dif_col": 9,
  "signed": 9,
  "1003": 9,
  "simon": 9,
  "heap": 9,
  "200100": 9,
  "sumA": 9,
  "contador": 9,
  "maks": 9,
  "sum_minus": 9,
  "Stone": 9,
  "misha": 9,
  "xay": 9,
  "cha": 9,
  "I become the guy.": 9,
  "118": 9,
  "94": 9,
  "cw\\n": 9,
  "step1": 9,
  "depth": 9,
  "card": 9,
  "ky": 9,
  "Friendship\\n": 9,
  "File": 9,
  "Init": 9,
  "remainings": 9,
  "spyke_id": 9,
  "nex": 9,
  "tu": 9,
  "Colours": 9,
  "quotient": 9,
  "except": 9,
  "object": 9,
  "requires": 9,
  "notation": 9,
  "present": 9,
  "iter": 9,
  "acef": 9,
  "bools": 9,
  "itself": 9,
  "content": 9,
  "fuel": 9,
  "2e3": 9,
  "terminate": 9,
  "symbol": 9,
  "delete": 9,
  "2nd": 9,
  "prepend": 9,
  "log": 9,
  "raised": 9,
  "100002": 9,
  "#Black&White\\n": 9,
  "atob": 8,
  "btoa": 8,
  "round1": 8,
  "900": 8,
  "raw": 8,
  "vi": 8,
  "MAXX": 8,
  "hc": 8,
  "denied": 8,
  "atk1": 8,
  "def1": 8,
  "num5": 8,
  "digitn": 8,
  "digitm": 8,
  "faken": 8,
  "fakem": 8,
  "vct": 8,
  "horizontal": 8,
  "den": 8,
  "inilahhasilnya": 8,
  "lIdx": 8,
  "rIdx": 8,
  "CHR": 8,
  "modx": 8,
  "cpy": 8,
  "gmax": 8,
  "Palindromic tree is better than splay tree": 8,
  "started": 8,
  "2e7": 8,
  "mex": 8,
  "6969": 8,
  "spff": 8,
  "2048": 8,
  "maskX": 8,
  "maskY": 8,
  "C1": 8,
  "zer": 8,
  "ru": 8,
  "ans_l": 8,
  "ans_r": 8,
  "ansy1": 8,
  "ansy2": 8,
  "input2": 8,
  "myv": 8,
  "salida": 8,
  "cntb": 8,
  "Sub": 8,
  "mem": 8,
  "104": 8,
  "col2": 8,
  "_min": 8,
  "jl": 8,
  "d10": 8,
  "150001": 8,
  "alt": 8,
  "0x3f3f3f3f3f3f3f3f": 8,
  "vis2": 8,
  "new_skill": 8,
  "segun": 8,
  "log10": 8,
  "files": 8,
  "count25": 8,
  "stac": 8,
  "matriz": 8,
  "r25": 8,
  "qkids": 8,
  "D2": 8,
  "mx2": 8,
  "ansl": 8,
  "edge": 8,
  "1e-10": 8,
  "getFactorization": 8,
  "getZarr": 8,
  "prev_up": 8,
  "maxval": 8,
  "ce": 8,
  "arrayi": 8,
  "NEB": 8,
  "malow": 8,
  "vp": 8,
  "lead0": 8,
  "ston": 8,
  "multimap": 8,
  "zheng": 8,
  "descending": 8,
  "geo": 8,
  "first_col": 8,
  "ou": 8,
  "rev": 8,
  "emp": 8,
  "maze": 8,
  "gx": 8,
  "gy": 8,
  "mxn": 8,
  "cycle": 8,
  "contiguous": 8,
  "pet": 8,
  "dat": 8,
  "cunt": 8,
  "len_block": 8,
  "sumB": 8,
  "func": 8,
  "note": 8,
  "boxes": 8,
  "95": 8,
  "chris": 8,
  "blocked": 8,
  "57": 8,
  "o2": 8,
  "k3": 8,
  "lft": 8,
  "faces": 8,
  "G1": 8,
  "pen": 8,
  "fast_io": 8,
  "fast_exp": 8,
  "step_b": 8,
  "s0": 8,
  "maxcnt": 8,
  "kx": 8,
  "wh": 8,
  "hour": 8,
  "Hash": 8,
  "diamond": 8,
  "home\\n": 8,
  "c0": 8,
  "Tb": 8,
  "way": 8,
  "DeleteIt": 8,
  "multidimensional": 8,
  "bal": 8,
  "#\\n": 8,
  "initial": 8,
  "key_type": 8,
  "format": 8,
  "functional": 8,
  "floats": 8,
  "getInt": 8,
  "HIM!\\n": 8,
  "HER!\\n": 8,
  "neither": 8,
  "gap": 8,
  "greatest": 8,
  "passing": 8,
  "game": 8,
  "kind": 8,
  "excluisve": 8,
  "iterating": 8,
  "|.|\\n": 8,
  "|D|)": 8,
  "|.|": 8,
  "addresses": 8,
  "assigned": 8,
  "asd": 8,
  "Malvika\\n": 8,
  "3.14159": 8,
  "--X": 8,
  "min_i": 8,
  "min_j": 8,
  "max_j": 8,
  "1000000010": 7,
  "offset": 7,
  "maxnum": 7,
  "person": 7,
  "cont1": 7,
  "songs": 7,
  "xh": 7,
  "qtd": 7,
  "CLOCKS_PER_SEC": 7,
  "1e99": 7,
  "gc": 7,
  "tlen": 7,
  "MaxN": 7,
  "disC": 7,
  "forbid": 7,
  "important": 7,
  "Possible": 7,
  "team": 7,
  "heros": 7,
  "chax": 7,
  "chay": 7,
  "rfind": 7,
  "istringstream": 7,
  "ended": 7,
  "memcpy": 7,
  "is_vowel": 7,
  "sdiag": 7,
  "ord": 7,
  "lios": 7,
  "liala": 7,
  "etr": 7,
  "etra": 7,
  "initis": 7,
  "inites": 7,
  "rub": 7,
  "41": 7,
  "00:00": 7,
  "prims": 7,
  "2000005": 7,
  "nam": 7,
  "arry": 7,
  "5e3": 7,
  "Mod": 7,
  "lib": 7,
  "blah": 7,
  "input1": 7,
  "crush": 7,
  "100.0": 7,
  "minimal": 7,
  "positivos": 7,
  "get_ans": 7,
  "cntc": 7,
  "58": 7,
  "sd": 7,
  "dollar": 7,
  "5000000": 7,
  "merge": 7,
  "100006": 7,
  "202": 7,
  "tercer": 7,
  "200007": 7,
  "perm": 7,
  "dp1": 7,
  "tam1": 7,
  "count_a": 7,
  "nineteen": 7,
  "contN": 7,
  "load": 7,
  "3.14159265358979323846": 7,
  "reports": 7,
  "judge2": 7,
  "numOpen": 7,
  "notup": 7,
  "99999999999": 7,
  "5010": 7,
  "hpm": 7,
  "maxb": 7,
  "ia": 7,
  "xb": 7,
  "yb": 7,
  "rez": 7,
  "fu": 7,
  "rate": 7,
  "fast_power": 7,
  "vl": 7,
  "split": 7,
  "first_row": 7,
  "file.txt": 7,
  "dn": 7,
  "st_taken": 7,
  "cb": 7,
  "got": 7,
  "rl1": 7,
  "rl2": 7,
  "301": 7,
  "tira": 7,
  "sum_plus": 7,
  "suml": 7,
  "Chris\\n": 7,
  "kt": 7,
  "109": 7,
  "2e18": 7,
  "slogan": 7,
  "rgt": 7,
  "index1": 7,
  "au": 7,
  "tep": 7,
  "killed": 7,
  "palin": 7,
  "hash1": 7,
  "step2": 7,
  "totalpass": 7,
  "WBWBWBWB": 7,
  "BWBWBWBW": 7,
  "gov": 7,
  "rl": 7,
  "30005": 7,
  "ptr": 7,
  "10.0": 7,
  "vol": 7,
  "maxcount": 7,
  "inicio": 7,
  "findfa": 7,
  "factor": 7,
  "minit": 7,
  "feet": 7,
  "rnum": 7,
  "binaryCode": 7,
  "segment": 7,
  "l2r": 7,
  "Ql": 7,
  "Qr": 7,
  "sementara": 7,
  "contest\\n": 7,
  "310": 7,
  "sameSocks": 7,
  "c4": 7,
  "monedas": 7,
  "minr": 7,
  "maxr": 7,
  "reqrec": 7,
  "xsum": 7,
  "ysum": 7,
  "sorted": 7,
  "Ar": 7,
  "subtraction": 7,
  "semicolumn": 7,
  "2000000000": 7,
  "30010": 7,
  "part": 7,
  "being": 7,
  "meant": 7,
  "maybe": 7,
  "0x3f": 7,
  "send": 7,
  "they": 7,
  "loses": 7,
  "interger": 7,
  "when": 7,
  "amount": 7,
  "incremen": 7,
  "1007": 7,
  "arg": 7,
  "gg": 7,
  "alphabetical": 7,
  "always": 7,
  "seq": 7,
  "nor": 7,
  "1500": 7,
  "intergers": 7,
  "cd": 7,
  "memory": 7,
  "process": 7,
  "lenght": 7,
  "sumc": 7,
  "T2": 7,
  "P3": 7,
  "discards": 7,
  "qualifiers": 7,
  "redeclared": 7,
  "OOOO-": 7,
  "zz": 7,
  "either": 7,
  "j1": 7,
  "si": 7,
  "63": 7,
  "larger": 7,
  "LD\\n": 7,
  "14159": 7,
  "factorial": 7,
  "indices": 7,
  "nCr": 7,
  "prealoc": 7,
  "a8": 7,
  "h8": 7,
  "RU\\n": 7,
  "ki": 7,
  "aj": 7,
  "Akshat\\n": 7,
  "temps": 6,
  "dix": 6,
  "diy": 6,
  "right_tri": 6,
  "123456": 6,
  "F1": 6,
  "F2": 6,
  "getnext": 6,
  "p11": 6,
  "p21": 6,
  "round2": 6,
  "match1": 6,
  "cursor": 6,
  "static_cast": 6,
  "mp2": 6,
  "client": 6,
  "defcos": 6,
  "binSearch": 6,
  "zeros": 6,
  "cz": 6,
  "ng": 6,
  "gp": 6,
  "maxVal": 6,
  "newX": 6,
  "newY": 6,
  "hp1": 6,
  "hp2": 6,
  "mpu": 6,
  "xxx": 6,
  "mint": 6,
  "permutem": 6,
  "permuteh": 6,
  "clock_t": 6,
  "remaind": 6,
  "linf": 6,
  "sum_pos": 6,
  "sum_neg": 6,
  "vertikal": 6,
  "theyareworking": 6,
  "hihi": 6,
  "1\\n0\\n": 6,
  "cum": 6,
  "to_int": 6,
  "colunas": 6,
  "Da": 6,
  "Db": 6,
  "Anka": 6,
  "Chapay": 6,
  "Cleo": 6,
  "Dracul": 6,
  "Snowy": 6,
  "Hexadecimal": 6,
  "111111": 6,
  "parrent": 6,
  "Union": 6,
  "panduan": 6,
  "tot1": 6,
  "MAXM": 6,
  "ulong": 6,
  "131": 6,
  "xasphalt": 6,
  "yasphalt": 6,
  "bon": 6,
  "emm2": 6,
  "lk": 6,
  "lastValid": 6,
  "Y1": 6,
  "Y2": 6,
  "auxp": 6,
  "auxc": 6,
  "breaktime": 6,
  "lastbreaktime": 6,
  "3e2": 6,
  "maohao": 6,
  "k0": 6,
  "flagg": 6,
  "50000": 6,
  "fastMax": 6,
  "fastMin": 6,
  "lu": 6,
  "dk": 6,
  "rgraph": 6,
  "rq": 6,
  "st1": 6,
  "maxsalary": 6,
  "ivec": 6,
  "memo": 6,
  "Call": 6,
  "boostIO": 6,
  "beforeP": 6,
  "4005": 6,
  "likes": 6,
  "1500000": 6,
  "dz": 6,
  "dist1": 6,
  "rdfs": 6,
  "chkPrime1to10000000": 6,
  "seive": 6,
  "000": 6,
  "Add": 6,
  "Div": 6,
  "gender": 6,
  "iv": 6,
  "row1": 6,
  "row2": 6,
  "rh": 6,
  "at2": 6,
  "bpow": 6,
  "Counter": 6,
  "OK": 6,
  "maxSubArraySum": 6,
  "500005": 6,
  "skill_name": 6,
  "isvowel": 6,
  "passou": 6,
  "compute": 6,
  "asphaltx": 6,
  "asphalty": 6,
  "inside": 6,
  "MID": 6,
  "Impossible\\n": 6,
  "tmaxmin": 6,
  "solx1": 6,
  "solx2": 6,
  "tam2": 6,
  "pali": 6,
  "multiset": 6,
  "rowa": 6,
  "alfa": 6,
  "fS": 6,
  "wa": 6,
  "check1": 6,
  "vert": 6,
  "amulets": 6,
  "prevDiv": 6,
  "nextt": 6,
  "MI": 6,
  "hpy": 6,
  "mr": 6,
  "pointPos": 6,
  "Hy": 6,
  "Hs": 6,
  "As": 6,
  "Ds": 6,
  ":0": 6,
  "sn": 6,
  "__typeof": 6,
  "ly": 6,
  "rstr": 6,
  "n_one": 6,
  "0x1": 6,
  "is_x1": 6,
  "is_x2": 6,
  "is_y1": 6,
  "is_y2": 6,
  "4\\n": 6,
  "chng": 6,
  "mb": 6,
  "zuida": 6,
  "posL": 6,
  "carryFlag": 6,
  "Emp_Lang": 6,
  "first_ai": 6,
  "vl4": 6,
  "fac": 6,
  "n_count": 6,
  "i_count": 6,
  "e_count": 6,
  "t_count": 6,
  "second_row": 6,
  "second_col": 6,
  "studentTS": 6,
  "qwe": 6,
  "it2": 6,
  "p10": 6,
  "a_i": 6,
  "a6": 6,
  "100500": 6,
  "34": 6,
  "minodd": 6,
  "odds": 6,
  "cadena": 6,
  "tg": 6,
  "Friendship is magic!^^": 6,
  "Mininum": 6,
  "loss1": 6,
  "loss2": 6,
  "actual": 6,
  "pow2": 6,
  "pe": 6,
  "im": 6,
  "_a": 6,
  "180.0": 6,
  "1440": 6,
  "Li": 6,
  "pearls": 6,
  "D1": 6,
  "tedad": 6,
  "saida": 6,
  "gh": 6,
  "maxNum": 6,
  "TIE\\n": 6,
  "pResult": 6,
  "hld": 6,
  "maxsec": 6,
  "given": 6,
  "3.0": 6,
  "xs": 6,
  "medal": 6,
  "202002": 6,
  "brainfuck": 6,
  "log_": 6,
  "poss1_p1": 6,
  "poss1_spec": 6,
  "list1": 6,
  "601": 6,
  "pro": 6,
  "binaryChar": 6,
  "__b": 6,
  "cari": 6,
  "ans_a": 6,
  "ans_b": 6,
  "sett": 6,
  "reqNo": 6,
  "cA": 6,
  "weight": 6,
  "zsum": 6,
  "secretaries_num": 6,
  "count3": 6,
  "Names": 6,
  "1000007": 6,
  "amounts1": 6,
  "amounts2": 6,
  "imax": 6,
  "consecutive": 6,
  "prices": 6,
  "sequential": 6,
  "bounds": 6,
  "str3": 6,
  "MAX2": 6,
  "pritn": 6,
  "blank": 6,
  "intege": 6,
  "witn": 6,
  "fir": 6,
  "mxm": 6,
  "mmax": 6,
  "100011": 6,
  "doit": 6,
  "1000000000000": 6,
  "floating": 6,
  "isVowel": 6,
  "we": 6,
  "252": 6,
  "70": 6,
  "()": 6,
  "200009": 6,
  "divisible": 6,
  "bt": 6,
  "is_prime": 6,
  "shu": 6,
  "__promote_2": 6,
  "votes": 6,
  "14159265359": 6,
  "ceiling": 6,
  "ds": 6,
  "outer": 6,
  "esclusive": 6,
  "numeric_limits": 6,
  "final": 6,
  "till": 6,
  "biggest": 6,
  "range": 6,
  "crate": 6,
  "maxy": 6,
  "1000000005": 6,
  "del": 6,
  "4th": 6,
  "3rd": 6,
  "divides": 6,
  "_Nb": 6,
  "lon": 6,
  "-OOOO": 6,
  "0000000": 6,
  "levels": 6,
  "salt": 6,
  "magic!^^\\n": 6,
  "computer": 6,
  "plen": 6,
  "src1": 5,
  "src2": 5,
  "both\\n": 5,
  "forward\\n": 5,
  "backward\\n": 5,
  "fantasy\\n": 5,
  "rit": 5,
  "parity": 5,
  "SC1": 5,
  "tip": 5,
  "MODPRIMA": 5,
  "cf": 5,
  "1000000000000000": 5,
  "1.": 5,
  "yyy": 5,
  "replica": 5,
  "infint64_t": 5,
  "number_of_5": 5,
  "3.1415926535": 5,
  "ind_s": 5,
  "ind_e": 5,
  "get_prime": 5,
  "ab1": 5,
  "ba2": 5,
  "2e2": 5,
  "49": 5,
  "anst": 5,
  "findSet": 5,
  "odgr": 5,
  "Troll": 5,
  "FindParrent": 5,
  "maxind": 5,
  "minind": 5,
  "visitado": 5,
  "iss": 5,
  "join": 5,
  "hui": 5,
  "fm": 5,
  " - ": 5,
  "lose": 5,
  "69": 5,
  "js": 5,
  "$": 5,
  "bitcount": 5,
  "ispal": 5,
  "pb": 5,
  "2050000": 5,
  "2007": 5,
  "ok2": 5,
  "somaPoli": 5,
  "0.001": 5,
  "tomas": 5,
  "5002": 5,
  "maxin": 5,
  "1024": 5,
  "err": 5,
  "answerFound": 5,
  "convert_str": 5,
  "psg": 5,
  "afterP": 5,
  "Left": 5,
  "5e6": 5,
  "last_digit": 5,
  "mind": 5,
  "cross": 5,
  "occ": 5,
  "mod_pow": 5,
  "connected": 5,
  "INF_INT": 5,
  "INF_LL": 5,
  "INF_ULL": 5,
  "18446744073709551615Ull": 5,
  "92540646808111039LL": 5,
  "Move": 5,
  "Move_": 5,
  "str2num": 5,
  "akt": 5,
  "cal_digit": 5,
  "cal_largerthanorequaltox": 5,
  "id0": 5,
  "xp": 5,
  "foo": 5,
  "dB": 5,
  "dW": 5,
  "Total": 5,
  "auto": 5,
  "urm": 5,
  "EOF": 5,
  "512": 5,
  "mmc": 5,
  "s50": 5,
  "log7": 5,
  "bio": 5,
  "palindrom": 5,
  "val3": 5,
  "colo": 5,
  "signal": 5,
  "count_c": 5,
  "count_b": 5,
  "r50": 5,
  "candies": 5,
  "jawab": 5,
  "ma2": 5,
  "ALPH": 5,
  "ct1": 5,
  "txt.in": 5,
  "txt.out": 5,
  "ultimate": 5,
  "sum_n": 5,
  "maxsub": 5,
  "cans": 5,
  "ch3": 5,
  "mid_num": 5,
  "dd1": 5,
  "dd2": 5,
  "line1": 5,
  "cash": 5,
  "lm": 5,
  "pnt": 5,
  "outdeg": 5,
  "hora": 5,
  "ntc": 5,
  "power1": 5,
  "mcnt": 5,
  "min_v": 5,
  "pan": 5,
  "Rick": 5,
  "knight": 5,
  "small": 5,
  "yy1": 5,
  "triangulo": 5,
  "x5": 5,
  "ogo": 5,
  "ang": 5,
  "trd": 5,
  "tgd": 5,
  "tbd": 5,
  "1.00": 5,
  "Still Rozdil": 5,
  "f0": 5,
  "maxSections": 5,
  "my_min": 5,
  "counter1": 5,
  "counter2": 5,
  "mcount": 5,
  "ccount": 5,
  "clones": 5,
  "math": 5,
  "cost_min": 5,
  "PE": 5,
  "lessonsn": 5,
  "ming1": 5,
  "ming2": 5,
  "frnd": 5,
  "penalty": 5,
  "index2": 5,
  "hcf": 5,
  "groups": 5,
  "bq": 5,
  "echo": 5,
  "endd": 5,
  "station1": 5,
  "current_minimum": 5,
  "min_price": 5,
  "Len": 5,
  "qa": 5,
  "section": 5,
  "mpa": 5,
  "replace": 5,
  "82": 5,
  "df": 5,
  "avg": 5,
  "dis1": 5,
  "dis2": 5,
  "chest\\n": 5,
  "biceps\\n": 5,
  "cumple": 5,
  "MaxNum": 5,
  "cmin": 5,
  "lmax": 5,
  "prep": 5,
  "bnt": 5,
  "band": 5,
  "s80": 5,
  "degree": 5,
  "insertion": 5,
  "inputLength": 5,
  "er": 5,
  "today": 5,
  "firstdata": 5,
  "seconddata": 5,
  "ans_len": 5,
  "endpos": 5,
  "2000010": 5,
  "wb": 5,
  "differentSocks": 5,
  "alr": 5,
  "resa": 5,
  "asdfghjkl;": 5,
  "waysCount": 5,
  "cB": 5,
  "r0": 5,
  "O-": 5,
  "output1": 5,
  "maxv": 5,
  "checks": 5,
  "mv": 5,
  "numOfTestCases": 5,
  "snake": 5,
  "g2": 5,
  "fp": 5,
  "strictly": 5,
  "cosine": 5,
  "arc": 5,
  "abort": 5,
  "modi": 5,
  "READ": 5,
  "OUTPUT": 5,
  "INPUT": 5,
  "remaining": 5,
  "size_n": 5,
  "converted": 5,
  "typedef": 5,
  "mmin": 5,
  "did": 5,
  "concatenated": 5,
  "Declare": 5,
  "aeiou": 5,
  "3432": 5,
  "924": 5,
  "12870": 5,
  "48620": 5,
  "WINS\\n": 5,
  "resulf": 5,
  "parameters": 5,
  "reads": 5,
  "ap": 5,
  "LONG_MAX": 5,
  "solution": 5,
  "global": 5,
  "decalre": 5,
  "cmd": 5,
  "tot2": 5,
  "mt": 5,
  "exists": 5,
  "entered": 5,
  "exponent": 5,
  "ar1": 5,
  "inclusve": 5,
  "specifiers": 5,
  "buf": 5,
  "chess": 5,
  "VI4": 5,
  "VI": 5,
  "VI3": 5,
  "VI2": 5,
  "ar2": 5,
  "increased": 5,
  "angle": 5,
  "again": 5,
  "ori": 5,
  "Let": 5,
  "constants": 5,
  "diff2": 5,
  "01": 5,
  "basic_ifstream": 5,
  "inve": 5,
  "|.|)\\n": 5,
  "|D|)\\n": 5,
  "s.\\n": 5,
  "Pi": 5,
  "expo": 5,
  "random": 5,
  "arra": 5,
  "record": 5,
  "impossible\\n": 5,
  "sumz": 5,
  "sumy": 5,
  "sumx": 5,
  "imin": 5,
  "0.25": 5,
  "dsa": 5,
  "aeiou13579": 5,
  "3d": 5,
  "2.": 5,
  "declar": 5,
  "cols": 5,
  "getint": 5,
  "xt": 5,
  "mov": 5,
  "including": 5,
  "Bn": 5,
  "counta": 5,
  "ambiguating": 5,
  "common": 5,
  "0123456789": 5,
  "1/1\\n": 5,
  "mishka": 5,
  "605": 5,
  "ep": 5,
  "6789TJQKA": 5,
  "2222": 5,
  "ALMOST\\n": 4,
  "ln1": 4,
  "p12": 4,
  "p22": 4,
  "colors_rev": 4,
  "match2": 4,
  "p_sign": 4,
  "d_raw": 4,
  "intpart": 4,
  "fq": 4,
  "II": 4,
  "555555555": 4,
  "refused": 4,
  "findn": 4,
  "findm": 4,
  "ni": 4,
  "100000000000": 4,
  "minbitcoins": 4,
  "flag_d": 4,
  "flag_l": 4,
  "flag_r": 4,
  "1e14": 4,
  "numPeople": 4,
  "atk2": 4,
  "flag4": 4,
  "rowFull": 4,
  "atk_y": 4,
  "def_y": 4,
  "hp_m": 4,
  "damage_y": 4,
  "min_val": 4,
  "a_n": 4,
  "jokes": 4,
  "restBetween": 4,
  "checkh": 4,
  "checkm": 4,
  "accumulate": 4,
  "yu": 4,
  "number_of_0": 4,
  "temp3": 4,
  "temp4": 4,
  "primo": 4,
  "dois": 4,
  "damageY": 4,
  "maxt": 4,
  "appear_ctr": 4,
  "max_appear": 4,
  "currdiv": 4,
  "ba1": 4,
  "ABC": 4,
  "row_x": 4,
  "hori": 4,
  "Hermione\\n": 4,
  "current_max": 4,
  "get_f": 4,
  "get_g": 4,
  "idgr": 4,
  "strcat": 4,
  "likeNum": 4,
  " \\n": 4,
  "150150": 4,
  "grau": 4,
  "kontol": 4,
  "numWays": 4,
  "km": 4,
  "ph": 4,
  "slove": 4,
  " = 1\\n1 * 24 = 24\\n": 4,
  "button": 4,
  "cntNotFastened": 4,
  "3\\n": 4,
  "1001000": 4,
  "isU": 4,
  " = ": 4,
  "backtrack": 4,
  "disx": 4,
  "disy": 4,
  "101000": 4,
  "cas": 4,
  "ave": 4,
  "__builtin_clz": 4,
  "palins": 4,
  "somaPrim": 4,
  "CS": 4,
  "DS": 4,
  "FS": 4,
  "GS": 4,
  "FazInt": 4,
  "IsMajor": 4,
  "IsMinor": 4,
  "strange\\n": 4,
  "wap": 4,
  "de": 4,
  "npri": 4,
  "npal": 4,
  "getprime": 4,
  "1 ": 4,
  "kp": 4,
  "rused": 4,
  "msk1": 4,
  "msk2": 4,
  "MAX_M": 4,
  "emps": 4,
  "maxmaxsalary": 4,
  "employees": 4,
  "salary": 4,
  "byte\\n": 4,
  "BigInteger\\n": 4,
  "10:01": 4,
  "20:02": 4,
  "to_num": 4,
  "islegal": 4,
  "usedLen": 4,
  "lks": 4,
  "makePrimes": 4,
  "ispalin": 4,
  "esum": 4,
  "timer": 4,
  "lucky_numbers": 4,
  "TT": 4,
  "time_p": 4,
  "first_digit": 4,
  "10000001": 4,
  "numofzero": 4,
  "permu": 4,
  "adj2": 4,
  "fd": 4,
  "printSt": 4,
  "MODINVERSE": 4,
  "diameter": 4,
  "mierda": 4,
  "w_x": 4,
  "w_y": 4,
  "b_x": 4,
  "b_y": 4,
  "w_step": 4,
  "b_step": 4,
  "num_c": 4,
  "va1": 4,
  "cy1": 4,
  "nxtd": 4,
  "mae": 4,
  "lik": 4,
  "toadd": 4,
  "candidates": 4,
  "onerun": 4,
  "maurm": 4,
  "who": 4,
  "lastpos": 4,
  "nom": 4,
  "1e+6": 4,
  "chegou": 4,
  "beginu": 4,
  "tempstr": 4,
  "get_num": 4,
  "sqLIM": 4,
  "dp2": 4,
  "rao": 4,
  "count50": 4,
  "lans": 4,
  "ltemp": 4,
  "gbs": 4,
  "sf": 4,
  "alguienSabe": 4,
  "lenguas": 4,
  "contE": 4,
  "kids": 4,
  "trow": 4,
  "lead": 4,
  "first_later": 4,
  "115": 4,
  "sCopy": 4,
  "combs": 4,
  "_map": 4,
  "lakukan": 4,
  "starstar": 4,
  "pasa": 4,
  "letra": 4,
  "cambio": 4,
  "realR": 4,
  "noob": 4,
  "whatever": 4,
  "Max_N": 4,
  "arr3": 4,
  "maxgcd": 4,
  "ch4": 4,
  "indice_max": 4,
  "time_": 4,
  "getnumber": 4,
  "countT": 4,
  "countN": 4,
  "countI": 4,
  "c25": 4,
  "closest": 4,
  "5555": 4,
  "wins": 4,
  "damy": 4,
  "damm": 4,
  "satu": 4,
  "dpback": 4,
  "gback": 4,
  "check_1": 4,
  "check_2": 4,
  "lead01": 4,
  "lead02": 4,
  "lead03": 4,
  "MAXall": 4,
  "color_to_id": 4,
  "count_one": 4,
  "Pow": 4,
  "unite": 4,
  "indeg": 4,
  "cont3": 4,
  "8\\n": 4,
  "vertex": 4,
  "f4": 4,
  "102000": 4,
  "Loop": 4,
  "power2": 4,
  "loc": 4,
  "valp": 4,
  "vl1": 4,
  "sentence": 4,
  "nineteen_count": 4,
  "ancnt": 4,
  "marke": 4,
  "Morty": 4,
  "1300006": 4,
  "tn": 4,
  "1004": 4,
  "visted": 4,
  "HARD\\n": 4,
  "EASY\\n": 4,
  "Ciel\\n": 4,
  "Hanako\\n": 4,
  "anti": 4,
  "sol1": 4,
  "sol2": 4,
  "a_counter": 4,
  "d_counter": 4,
  "tot_arr": 4,
  "block": 4,
  "dire": 4,
  "tf": 4,
  "CHAT WITH HER!": 4,
  "IGNORE HIM!": 4,
  "npd": 4,
  "fuente": 4,
  "destino": 4,
  "saltos": 4,
  "radius": 4,
  "l0": 4,
  "player1": 4,
  "player2": 4,
  "pending": 4,
  "nut2sec": 4,
  "ew": 4,
  "such": 4,
  "flush": 4,
  "largo": 4,
  "eat": 4,
  "basura": 4,
  "5100": 4,
  "nhap": 4,
  "max_cont_4": 4,
  "javob": 4,
  "ostringstream": 4,
  "mod1": 4,
  "product": 4,
  "av": 4,
  "no_of_8": 4,
  "filter": 4,
  "Minn": 4,
  "links": 4,
  "mindiff": 4,
  "min_result": 4,
  "wl": 4,
  "newPerson": 4,
  "station2": 4,
  "110000": 4,
  "Flag": 4,
  "inp1": 4,
  "bg": 4,
  "prevC": 4,
  "wo": 4,
  "ftpass": 4,
  "lasttime": 4,
  "b0": 4,
  "1008": 4,
  "difA": 4,
  "difB": 4,
  "j3": 4,
  "1e-11": 4,
  "oranges_size": 4,
  "cupboard": 4,
  "medalboard": 4,
  "fri": 4,
  "esVocal_o_n": 4,
  "hur": 4,
  "newvictim": 4,
  "poss1": 4,
  "poss1_p2": 4,
  "1011": 4,
  "add2": 4,
  "lmin": 4,
  "ix": 4,
  "passenger": 4,
  "count_8": 4,
  "count_no": 4,
  "ao": 4,
  "permut": 4,
  "mnd": 4,
  "saved": 4,
  "minnum": 4,
  "cws": 4,
  "ccws": 4,
  "testCases": 4,
  "breakFlag": 4,
  "acnt": 4,
  "bcnt": 4,
  "once": 4,
  "pack": 4,
  "Masha\\n": 4,
  "Equal\\n": 4,
  "Dasha\\n": 4,
  "resb": 4,
  "qwertyuiop": 4,
  "zxcvbnm,./": 4,
  "gay": 4,
  "max_sections": 4,
  "n_of_nuts": 4,
  "fans": 4,
  "-O": 4,
  "wnk": 4,
  "pposi": 4,
  "evaluate": 4,
  "piche": 4,
