{
  ";": 125356,
  "(": 98712,
  ")": 98704,
  "=": 82657,
  "int": 79742,
  "i": 76241,
  ",": 73460,
  "if": 62693,
  "{": 62535,
  "}": 62534,
  "return": 61457,
  "++": 57462,
  "n": 57015,
  "+": 56367,
  "[": 56044,
  "]": 56041,
  "for": 54854,
  "*": 54156,
  "long": 53227,
  "<": 52943,
  "main": 49955,
  ".": 48159,
  "&": 47111,
  "<stdio.h>": 46381,
  "#include": 46381,
  "_<number>_": 46365,
  "_<string>_": 46318,
  "scanf": 45735,
  "printf": 45516,
  "-": 44562,
  "char": 44214,
  "double": 41515,
  "==": 41344,
  "float": 41123,
  "a": 39804,
  "else": 38759,
  "j": 34110,
  "0": 29597,
  "<<": 28414,
  "<=": 25742,
  ">": 25262,
  "1": 23556,
  ">>": 23310,
  "<stdlib.h>": 22507,
  "k": 21759,
  "cout": 21401,
  "b": 20935,
  "cin": 19772,
  "while": 18061,
  "endl": 17523,
  "&&": 16698,
  "\"": 16522,
  "/": 16053,
  "main()": 13938,
  "x": 13597,
  "m": 13547,
  "s": 13230,
  "c": 13227,
  "%": 11902,
  "'": 11730,
  "!=": 10837,
  "t": 10685,
  ">=": 10622,
  "0;": 10120,
  "break": 9685,
  "2": 8994,
  "sum": 8075,
  "+=": 7397,
  "||": 7364,
  "--": 7257,
  "ans": 6550,
  "l": 6491,
  "count": 6418,
  "y": 6249,
  "arr": 6067,
  "d": 5883,
  "p": 5752,
  "max": 5470,
  "string": 4998,
  "!": 4072,
  "void": 3978,
  "size": 3916,
  "N": 3855,
  "r": 3819,
  "min": 3675,
  "num": 3670,
  "h": 3455,
  "const": 3374,
  "temp": 3252,
  "f": 3028,
  "flag": 2961,
  "\\n": 2956,
  "continue": 2872,
  "3": 2859,
  "A": 2647,
  "v": 2376,
  "10": 2313,
  "bool": 2279,
  "4": 2216,
  "NO": 2146,
  "z": 2102,
  "YES": 2016,
  "do": 2003,
  "5": 1943,
  "-=": 1874,
  "cnt": 1868,
  "end": 1807,
  "q": 1802,
  "_<char>_": 1735,
  "B": 1707,
  "true": 1692,
  "length": 1670,
  "sort": 1664,
  ":": 1535,
  "vector": 1532,
  "gets": 1492,
  "str": 1484,
  "x1": 1474,
  "getchar": 1468,
  "abs": 1452,
  "false": 1403,
  "x2": 1391,
  "sizeof": 1380,
  "res": 1353,
  "e": 1339,
  "y1": 1331,
  "7": 1329,
  "static": 1324,
  "push_back": 1323,
  "catalan": 1318,
  "?": 1316,
  "a1": 1247,
  "y2": 1246,
  "w": 1208,
  "g": 1177,
  "begin": 1135,
  "C": 1129,
  "a2": 1117,
  "n1": 1086,
  "<math.h>": 1079,
  "check": 1072,
  "ar": 1051,
  "/=": 1031,
  "s1": 1023,
  "n2": 1003,
  "move": 998,
  "S": 988,
  "NumPerLine": 984,
  "To": 972,
  "From": 971,
  "ch": 965,
  "start": 950,
  "getways": 896,
  "maxn": 894,
  "hanoi": 882,
  "u": 877,
  "getMaxLessThan": 873,
  "len": 869,
  "100": 868,
  "mod": 854,
  "upperLimit": 852,
  "memarray": 801,
  "s2": 786,
  "cat": 769,
  "6": 737,
  "*=": 726,
  "tmp": 665,
  "malloc": 654,
  "YES\\n": 653,
  "memset": 648,
  "<limits.h>": 644,
  "sum1": 633,
  "8": 631,
  "swap": 616,
  "total": 616,
  "map": 599,
  "1e9": 587,
  "and": 583,
  "mp": 576,
  "9": 575,
  "push": 564,
  "insert": 562,
  "diff": 555,
  "NO\\n": 554,
  "t1": 542,
  "c1": 541,
  "getline": 540,
  "o": 539,
  "dp": 535,
  "fib": 531,
  "array": 529,
  "index": 527,
  "M": 524,
  "set": 523,
  "puts": 522,
  "R": 521,
  "1000": 520,
  "mx": 514,
  "105": 506,
  "pos": 505,
  "<strings.h>": 498,
  "%=": 494,
  "gcd": 487,
  "t2": 487,
  " ": 486,
  "find": 478,
  "getInversions": 476,
  "L": 473,
  "D": 466,
  "T": 454,
  "val": 452,
  "strlen": 444,
  "c2": 442,
  "to": 435,
  "result": 429,
  "first": 428,
  "area": 425,
  "sum2": 416,
  "product": 412,
  "-1": 401,
  "second": 394,
  "vis": 385,
  "st": 384,
  "output": 377,
  "it": 374,
  "input": 373,
  "101": 367,
  "::": 365,
  "x3": 364,
  "MOD": 362,
  "26": 360,
  "INF": 359,
  "mid": 358,
  "p1": 348,
  "p2": 346,
  "test": 346,
  "reverse": 344,
  "solve": 343,
  "b1": 340,
  "K": 336,
  "y3": 322,
  "substr": 319,
  "#": 319,
  "0x3f3f3f3f": 314,
  "unsigned": 305,
  "get": 304,
  "ok": 303,
  "ti": 303,
  "cur": 301,
  "fact": 298,
  "INT_MAX": 295,
  "1e5": 292,
  "12": 289,
  "MAX": 289,
  "mn": 284,
  "height": 284,
  "num1": 281,
  "read": 280,
  "dx": 280,
  "row": 270,
  "bmi": 262,
  "sqrt": 261,
  "20": 260,
  "No": 258,
  "value": 257,
  "Yes": 256,
  "inf": 254,
  "exit": 251,
  "b2": 251,
  "110": 246,
  "add": 245,
  "dfs": 243,
  "is": 240,
  "xx": 239,
  "100005": 238,
  "|": 238,
  "counter": 233,
  "ret": 230,
  "at": 225,
  "1000000007": 224,
  "num2": 224,
  "oldcount": 217,
  "100000": 216,
  "now": 215,
  "MAXN": 214,
  "1005": 214,
  "l1": 214,
  "minn": 212,
  "print": 212,
  "tax": 212,
  "last": 211,
  "30": 210,
  "15": 210,
  "^": 210,
  "erase": 209,
  "maxi": 208,
  "U": 206,
  "strings": 205,
  "l2": 205,
  "ma": 205,
  "new": 205,
  "EOF": 205,
  "ceil": 204,
  "prime": 204,
  "v1": 203,
  "11": 201,
  "ss": 201,
  "in": 201,
  "clear": 200,
  "space": 200,
  "maxtill": 200,
  "fun": 198,
  "arr1": 195,
  "out": 194,
  "slope": 192,
  "<string.h>": 192,
  "200": 191,
  "__gcd": 191,
  "pow": 191,
  "k1": 190,
  "rev": 190,
  "G": 187,
  "P": 186,
  "pop": 183,
  "pair": 182,
  "rem": 182,
  "count1": 182,
  "prod": 182,
  "iterator": 181,
  "from": 179,
  "inline": 178,
  "BMI": 176,
  "ans1": 174,
  "the": 172,
  "25": 171,
  "stop": 171,
  "flag1": 171,
  "arr2": 171,
  "maxx": 170,
  "\\0": 169,
  "ans2": 167,
  "dy": 167,
  "1.0": 166,
  "h1": 165,
  "ind": 165,
  "power": 165,
  "a3": 163,
  "idx": 162,
  "acos": 161,
  ">>=": 161,
  "aux": 161,
  "avg": 161,
  "yy": 160,
  "d1": 160,
  "ct": 160,
  "m1": 159,
  "k2": 158,
  "H": 158,
  "list": 156,
  "mat": 155,
  "ay": 155,
  "key": 155,
  "top": 153,
  "pro": 153,
  "create": 151,
  "W": 151,
  "50": 150,
  "1LL": 149,
  "60": 149,
  "48": 147,
  "col": 147,
  "one": 146,
  "r1": 146,
  "px": 146,
  "1001": 145,
  "d2": 145,
  "cy": 145,
  "py": 145,
  "left": 144,
  "tot": 144,
  "X": 144,
  "binomial": 143,
  "cont": 142,
  "f1": 141,
  "name": 140,
  "max1": 140,
  "search": 139,
  "cx": 137,
  "Y": 136,
  "median": 136,
  "10000": 134,
  "INT_MIN": 134,
  "#define": 134,
  "Z": 133,
  "h2": 131,
  "ax": 131,
  "dif": 130,
  "|=": 128,
  "I": 128,
  "i2": 128,
  "1e6": 127,
  "time": 127,
  "dist": 127,
  "180": 126,
  "sub": 126,
  "sz": 125,
  "cost": 125,
  "Friendship": 124,
  "number": 124,
  "goto": 124,
  "s3": 123,
  "empty": 122,
  "right": 122,
  "pr": 122,
  "fibo": 122,
  "O": 121,
  "strcmp": 121,
  "v2": 121,
  "-1\\n": 120,
  "med": 120,
  "PI": 119,
  "pi": 119,
  "str1": 119,
  "1000000": 118,
  "100001": 116,
  "mark": 115,
  "low": 114,
  "no": 114,
  "i1": 114,
  "ack": 114,
  "100010": 112,
  "->": 112,
  "31": 112,
  "360": 112,
  "or": 112,
  "id": 111,
  "otherwise": 110,
  "inv": 110,
  "aa": 109,
  "make_pair": 108,
  "r2": 108,
  "calloc": 108,
  "vec": 107,
  "lcm": 107,
  "Q": 107,
  "cnt1": 106,
  "F": 106,
  "m2": 106,
  "maximum": 106,
  "N1": 106,
  "tolower": 105,
  "998244353": 104,
  "da": 103,
  "ht": 103,
  "count2": 102,
  "f2": 101,
  "flag2": 101,
  "freq": 100,
  "front": 99,
  "N2": 99,
  "32": 98,
  "answer": 98,
  "inp": 98,
  "rec": 98,
  "str2": 97,
  "V": 97,
  "chair": 97,
  "year": 97,
  "First": 96,
  "used": 96,
  "rot": 96,
  "func": 96,
  "ar1": 95,
  "Second": 93,
  "mini": 93,
  "average": 93,
  "lucky": 92,
  "weight": 92,
  "97": 90,
  "sp": 90,
  "MaxTill": 90,
  "tower": 90,
  "mm": 89,
  "55": 89,
  "t0": 89,
  "init": 89,
  "putchar": 89,
  "toh": 89,
  "fibonacci": 89,
  "rbegin": 88,
  "wt": 88,
  "A1": 88,
  "co": 87,
  "t3": 87,
  "am": 87,
  "sol": 87,
  "tc": 86,
  "mode": 86,
  "A2": 86,
  "suma": 85,
  "2e5": 84,
  "declare": 84,
  "sm": 84,
  "term": 84,
  "room": 84,
  "pt": 83,
  "rs": 82,
  "line": 82,
  "prev": 82,
  "c3": 82,
  "": 81,
  "priority_queue": 81,
  "loop": 81,
  "temp1": 81,
  "money": 81,
  "back": 80,
  "by": 80,
  "Tn": 80,
  "base": 79,
  "fabs": 79,
  "size_t": 78,
  "q1": 78,
  "nn": 78,
  "qm": 78,
  "table": 78,
  "curr": 78,
  "Max": 78,
  "temp2": 78,
  "book": 78,
  "1e18": 77,
  "adj": 77,
  "p3": 77,
  "bob": 77,
  "EPS": 76,
  "cnt2": 76,
  "ex": 76,
  "mi": 76,
  "\\": 76,
  "Ay": 76,
  "judge": 75,
  "1010": 75,
  "ara": 75,
  "be": 75,
  "ctr": 75,
  "fac": 75,
  "oldCount": 75,
  "difference": 74,
  "visited": 73,
  "unique": 73,
  "ii": 73,
  "div": 73,
  "match": 73,
  "epsilon": 73,
  "peak": 73,
  "bb": 72,
  "min2": 72,
  "eps": 71,
  "200005": 71,
  "0\\n": 71,
  "1\\n": 70,
  "db": 70,
  "next": 70,
  "E": 70,
  "1000000000": 69,
  "queue": 69,
  "value1": 69,
  "cmp": 68,
  "q2": 68,
  "character": 68,
  "found": 68,
  "13": 67,
  "dis": 67,
  "rotate": 67,
  "free": 67,
  "Hanoi": 66,
  "zero": 65,
  "pre": 65,
  "len1": 65,
  "max2": 65,
  "npos": 64,
  "then": 64,
  "Ax": 64,
  "my": 63,
  "fixed": 63,
  "pri": 63,
  "high": 63,
  "fn": 63,
  "Py": 63,
  "Px": 63,
  "jj": 62,
  "b3": 62,
  "ly": 62,
  "catlan": 62,
  "alice": 62,
  "1e-9": 61,
  "rest": 61,
  "^=": 61,
  "red": 61,
  "man": 61,
  "amount": 61,
  "occ": 61,
  "int64_t": 60,
  "let": 60,
  "max_element": 60,
  "toupper": 60,
  "append": 60,
  "nl": 60,
  "two": 60,
  "case": 60,
  "kd": 60,
  "cases": 60,
  "len2": 59,
  "mem": 59,
  "Yes\\n": 58,
  "No\\n": 58,
  "Mishka": 58,
  "#Color": 58,
  "po": 58,
  "up": 58,
  "compare": 58,
  "calc": 58,
  "ackermann": 58,
  "Cx": 58,
  "Cy": 58,
  "bid": 58,
  "2e9": 57,
  "cr": 57,
  "pic": 57,
  "Chris": 57,
  "isprime": 57,
  "minx": 57,
  "visit": 57,
  "fx": 57,
  "moves": 57,
  "gold": 57,
  "switch": 57,
  "ALMOST": 56,
  "tt": 56,
  "rat": 56,
  "kk": 56,
  "step": 56,
  "hm": 56,
  "have": 56,
  "sumb": 56,
  "rend": 55,
  "Mahmoud": 55,
  "Ehab": 55,
  "green": 55,
  "an": 55,
  "remainder": 55,
  "resize": 54,
  "500": 54,
  "Dp": 54,
  "blue": 54,
  "bin": 54,
  "tests": 54,
  "102": 53,
  "np": 53,
  "Time": 53,
  "RIGHT": 53,
  "cal": 53,
  "current": 53,
  "rep": 53,
  "maxm": 53,
  "m3": 53,
  "ar2": 53,
  "can": 52,
  "register": 52,
  "head": 52,
  "word": 52,
  "SEGMENT": 52,
  "IMPOSSIBLE": 52,
  "TRIANGLE": 52,
  "valid": 52,
  "min1": 52,
  "big": 52,
  "open": 52,
  "51": 51,
  "data": 51,
  "28": 51,
  "21": 51,
  "child": 51,
  "freopen": 51,
  "woman": 51,
  "a0": 51,
  "ab": 51,
  "minimum": 51,
  "var": 51,
  "carry": 51,
  "large": 51,
  "startindex": 51,
  "yu2": 50,
  "nums": 50,
  "ch1": 50,
  "hp": 50,
  "towerofhanoi": 50,
  "ent": 50,
  "health": 50,
  "la": 49,
  "win": 49,
  "hh": 49,
  "cek": 49,
  "fast": 49,
  "1000005": 49,
  "w1": 49,
  "value2": 49,
  "tb": 49,
  "digit": 49,
  "mult": 49,
  "equal": 49,
  "disc": 49,
  "catn": 49,
  "floor": 48,
  "27": 48,
  "10005": 48,
  "se": 48,
  "pop_back": 48,
  "Grades": 48,
  "Correct": 48,
  "pa": 48,
  "flg": 48,
  "han": 48,
  "ty": 47,
  "201": 47,
  "yes": 47,
  "tx": 47,
  "ns": 47,
  "l3": 47,
  "price": 47,
  "steps": 47,
  "size2": 47,
  "lb": 46,
  "Power": 46,
  "24": 46,
  "cod": 46,
  "250": 46,
  "Anton": 46,
  "Danik": 46,
  "point": 46,
  "vv": 45,
  "black": 45,
  "10000000": 45,
  "Impossible": 45,
  "111": 45,
  "v0": 45,
  "magic!^^": 45,
  "Malvika": 45,
  "Akshat": 45,
  "as": 45,
  "ta": 45,
  "e1": 45,
  "fb": 45,
  "hi": 45,
  "rows": 45,
  "heap": 45,
  "final": 45,
  "amt": 45,
  "recurse": 45,
  "size1": 45,
  "acker": 45,
  "primes": 44,
  "precision": 44,
  "isPrime": 44,
  "23": 44,
  "2/3": 44,
  "fa": 44,
  "J": 44,
  "even": 44,
  "dig": 44,
  "upper": 44,
  "element": 44,
  "gx": 44,
  "close": 44,
  "',": 44,
  "2000": 43,
  "greater": 43,
  "mins": 43,
  "T1": 43,
  "sc": 43,
  "ln": 43,
  "ip": 43,
  "isdigit": 42,
  "dm": 42,
  "0LL": 42,
  "stack": 42,
  "ne": 42,
  "200000": 42,
  "22": 42,
  "150": 42,
  "assign": 42,
  "ci": 42,
  "cw": 42,
  "summ": 42,
  "rd": 42,
  "tn": 42,
  "testcases": 42,
  "isok": 41,
  "UP": 41,
  "DOWN": 41,
  "Space": 41,
  "Soul": 41,
  "Reality": 41,
  "Mind": 41,
  "captain": 41,
  "RU": 41,
  "WITH": 41,
  "IGNORE": 41,
  "CHAT": 41,
  "Oh,": 41,
  "distance": 41,
  "target": 41,
  "numbers": 41,
  "ary": 41,
  "1000000009": 40,
  "setprecision": 40,
  "2005": 40,
  "Ron": 40,
  "1e3": 40,
  "120": 40,
  "day": 40,
  "LD": 40,
  "LU": 40,
  "RD": 40,
  "s4": 40,
  "score": 40,
  "sa": 40,
  "sb": 40,
  "odd": 40,
  "noOfRows": 40,
  "colspace": 40,
  "Black": 39,
  "86400": 39,
  "Karen": 39,
  "e2": 39,
  "position": 39,
  "nd": 39,
  "ignore": 38,
  "yu1": 38,
  "points": 38,
  "isupper": 38,
  "tab": 38,
  "u1": 38,
  "240": 38,
  "ccw": 38,
  "Sheldon": 38,
  "Leonard": 38,
  "Penny": 38,
  "Rajesh": 38,
  "Howard": 38,
  "that": 38,
  "chest": 38,
  "biceps": 38,
  "Oh": 38,
  "become": 38,
  "short": 38,
  "cou": 38,
  "order": 38,
  "both": 37,
  "forward": 37,
  "exp": 37,
  "35": 37,
  "19": 37,
  "ff": 37,
  "sieve": 37,
  "Tetrahedron": 37,
  "Cube": 37,
  "Octahedron": 37,
  "Dodecahedron": 37,
  "Vasya": 37,
  "fl": 37,
  "Min": 37,
  "call": 37,
  "Alice": 37,
  "strstr": 36,
  "backward": 36,
  "days": 36,
  "2.0": 36,
  "u2": 36,
  "orange": 36,
  "Tie": 36,
  "Misha": 36,
  "need": 36,
  "ts": 36,
  "lim": 36,
  "cm": 36,
  "dest": 36,
  "ways": 36,
  "colno": 36,
  "205": 35,
  "color": 35,
  "PRINT": 35,
  "nx": 35,
  "LEFT": 35,
  "yellow": 35,
  "beginning": 35,
  "stdout": 35,
  "brr": 35,
  "stdin": 35,
  "en": 35,
  "req": 35,
  "sy": 35,
  "n3": 35,
  "sl": 35,
  "bm": 35,
  "vest": 35,
  "testcase": 35,
  "node": 34,
  "min3": 34,
  "ra": 34,
  "go": 34,
  "purple": 34,
  "HIM!": 34,
  "+------------------------+": 34,
  "guy.": 34,
  "keyboard!": 34,
  "change": 34,
  "br": 34,
  "MN": 34,
  "eC": 34,
  "C1": 34,
  "degree": 34,
  "hanoi_step": 34,
  "spa": 34,
  "0.0": 33,
  "300": 33,
  "2147483647": 33,
  "all": 33,
  "18": 33,
  "16": 33,
  "200001": 33,
  "p4": 33,
  "HER!": 33,
  "lol": 33,
  "bs": 33,
  "pal": 33,
  "tem": 33,
  "same": 33,
  "chk": 33,
  "count3": 33,
  "av": 33,
  "rsum": 33,
  "upperlimit": 33,
  "sel_sort": 33,
  "msk": 32,
  "pw": 32,
  "spf": 32,
  "1e7": 32,
  "bound": 32,
  "home": 32,
  "ql": 32,
  "qr": 32,
  "pm": 32,
  "ini": 32,
  "lst": 32,
  "no_test": 32,
  "1ll": 31,
  "MAX_N": 31,
  "rock": 31,
  "1/2": 31,
  "dir": 31,
  "Bob": 31,
  "op": 31,
  "na": 31,
  "th": 31,
  "maxlen": 31,
  "normal": 31,
  "lines": 31,
  "spaces": 31,
  "books": 31,
  "oo": 30,
  "&=": 30,
  "fin": 30,
  "kol": 30,
  "soma": 30,
  "bl": 30,
  "d3": 30,
  "Icosahedron": 30,
  "cc": 30,
  "scissors": 30,
  "paper": 30,
  "pop_front": 30,
  "done": 30,
  "ls": 30,
  "mul": 30,
  "con": 30,
  "gr": 30,
  "bx": 30,
  "ce": 30,
  "largest": 30,
  "checksum": 30,
  "white": 29,
  "5005": 29,
  "20000": 29,
  "5001": 29,
  "next_permutation": 29,
  "MX": 29,
  "1000001": 29,
  "O-|-OOOO": 29,
  "TEAM": 29,
  "R\\n": 29,
  "sx": 29,
  "bc": 29,
  "ch2": 29,
  "coun": 29,
  "on": 29,
  "numb": 29,
  "su": 29,
  "C2": 29,
  "You": 29,
  "Obesity": 29,
  "B2": 29,
  "B1": 29,
  "ctln": 29,
  "_b": 28,
  "down": 28,
  "hy": 28,
  "hor": 28,
  "trees": 28,
  "ed": 28,
  "1e8": 28,
  "c_str": 28,
  "200010": 28,
  "Hermione": 28,
  "mask": 28,
  "122": 28,
  "Equal": 28,
  "[]": 28,
  "re": 28,
  "fill": 28,
  "ck": 28,
  "num3": 28,
  "neg": 28,
  "store": 28,
  "S1": 28,
  "hc": 28,
  "mon": 28,
  "**": 28,
  "selection_sort": 28,
  "sqr": 27,
  "0.5": 27,
  "setf": 27,
  "40": 27,
  "numberOfPartialAns": 27,
  "stringstream": 27,
  "min_element": 27,
  "remove": 27,
  "mymap": 27,
  "contest": 27,
  "Dasha": 27,
  "Masha": 27,
  "UR": 27,
  "..": 27,
  "Terminate": 27,
  "tp": 27,
  "ad": 27,
  "sum3": 27,
  "ele": 27,
  "repeat": 27,
  "mb": 27,
  "sol1": 27,
  "trans": 27,
  "transfer": 27,
  "LOC": 27,
  "colSpace": 27,
  "colStar": 27,
  "ackerman": 27,
  "128": 26,
  "hasil": 26,
  "29": 26,
  "2001": 26,
  "Next": 26,
  "ml": 26,
  "ms": 26,
  "lfp": 26,
  "qwertyuiopasdfghjkl;zxcvbnm,./": 26,
  "DL": 26,
  "65": 26,
  "TIE": 26,
  "#Black&White": 26,
  "A\\n": 26,
  "love": 26,
  "hate": 26,
  "comp": 26,
  "nc": 26,
  "pos1": 26,
  "tr": 26,
  "groups": 26,
  "recur": 26,
  "cata": 26,
  "1e-8": 25,
  "itr": 25,
  "ui": 25,
  "save": 25,
  "10001": 25,
  "ada": 25,
  "cycles": 25,
  "vetor": 25,
  "par": 25,
  "like": 25,
  "mas": 25,
  "transform": 25,
  "5000": 25,
  "2000000": 25,
  "103": 25,
  "tar": 25,
  "***": 25,
  "1/6": 25,
  "WINS": 25,
  "pl": 25,
  "digits": 25,
  "possible": 25,
  "hit": 25,
  "fi": 25,
  "function": 25,
  "check_recur": 25,
  "sigma": 25,
  "noofRows": 25,
  "num_test": 25,
  "inversions": 25,
  "flog": 24,
  "1e-6": 24,
  "cnt0": 24,
  "cad": 24,
  "atkm": 24,
  "1e2": 24,
  "1e4": 24,
  "letter": 24,
  "has": 24,
  "work": 24,
  "path": 24,
  "100100": 24,
  "parent": 24,
  "maxa": 24,
  "DP": 24,
  "type": 24,
  "lower": 24,
  "undefined": 24,
  "TESTS": 24,
  "Incorrect": 24,
  "yes\\n": 24,
  "of": 24,
  "w2": 24,
  "xa": 24,
  "divisor": 24,
  "choose": 24,
  "gap": 24,
  "seq": 24,
  "foo": 24,
  "ap": 24,
  "mindiff": 24,
  "star": 24,
  "mc": 24,
  "series": 24,
  "getmaxlessthan": 24,
  "mC": 24,
  "mB": 24,
  "mA": 24,
  "eA": 24,
  "eB": 24,
  "peaks": 24,
  "Catalan_no": 24,
  "1e-7": 23,
  "P1": 23,
  "stu": 23,
  "def": 23,
  "sushu": 23,
  "3e5": 23,
  "cap": 23,
  "major": 23,
  "minor": 23,
  "strange": 23,
  "dfs2": 23,
  "14": 23,
  "123": 23,
  "md": 23,
  "res1": 23,
  "resp": 23,
  "v3": 23,
  "board": 23,
  "make": 23,
  "boolean": 23,
  "modulo": 23,
  "400": 23,
  "Too": 23,
  "GOTO": 23,
  "cs": 23,
  "r3": 23,
  "MIN": 23,
  "Arr": 23,
  "rt": 23,
  "maxcount": 23,
  "factorial": 23,
  "small": 23,
  "lsum": 23,
  "initial": 23,
  "ae": 23,
  "miss": 23,
  "Area": 23,
  "occurence": 23,
  "strcpy": 22,
  "fantasy": 22,
  "ac": 22,
  "1000006": 22,
  "96": 22,
  "lo": 22,
  "newdp": 22,
  "visit1": 22,
  "run": 22,
  "names": 22,
  "pref": 22,
  "rx": 22,
  "O-|": 22,
  "64": 22,
  "Still": 22,
  "O.": 22,
  "cn": 22,
  "maxl": 22,
  "nb": 22,
  "pq": 22,
  "mo": 22,
  "indx": 22,
  "copy": 22,
  "maxsum": 22,
  "ya": 22,
  "delta": 22,
  "lowest": 22,
  "eb": 22,
  "rn": 22,
  "ec": 22,
  "SumCheck": 22,
  "grbg": 22,
  "prd": 22,
  "bob_time": 22,
  "atky": 21,
  "2\\n": 21,
  "res_x": 21,
  "res_y": 21,
  "~": 21,
  "lower_bound": 21,
  "level": 21,
  "mmap": 21,
  "notes": 21,
  "2e6": 21,
  "winner": 21,
  "ny": 21,
  "dr": 21,
  "ifstream": 21,
  "father": 21,
  "no\\n": 21,
  "90": 21,
  "chars": 21,
  "DR": 21,
  "UL": 21,
  "constant": 21,
  "weak": 21,
  "|.|)": 21,
  "1/3": 21,
  "1/1": 21,
  "ai": 21,
  "root": 21,
  "tag": 21,
  "coins": 21,
  "values": 21,
  "factors": 21,
  "Maxtill": 21,
  "srch": 21,
  "rod1": 21,
  "rod3": 21,
  "rod2": 21,
  "mat2": 21,
  "recbin": 21,
  "in2": 21,
  "in1": 21,
  "twosum": 21,
  "ea": 21,
  "rectangle": 21,
  "atk": 20,
  "dd": 20,
  "dem": 20,
  "atoi": 20,
  "nextDiv": 20,
  "ry": 20,
  "slen": 20,
  "EASY": 20,
  "HARD": 20,
  "plus": 20,
  "305": 20,
  "qi": 20,
  "5.0": 20,
  "Mishka\\n": 20,
  "characters": 20,
  "Nikita": 20,
  "Olya": 20,
  "Slava": 20,
  "Ann": 20,
  "Danil": 20,
  "Vasilisa.": 20,
  "qwertyuiopasdfghjkl": 20,
  "5/6": 20,
  "ll": 20,
  "chr": 20,
  "shift": 20,
  "times": 20,
  "ord": 20,
  "is_prime": 20,
  "width": 20,
  "df": 20,
  "lmax": 20,
  "i3": 20,
  "bp": 20,
  "sum_check": 20,
  "multiply": 20,
  "tcase": 20,
  "lis": 20,
  "MAXVAL": 20,
  "gr8_max": 20,
  "RIGHT\\n": 19,
  "1100": 19,
  "ver": 19,
  "log2": 19,
  "huiwen": 19,
  "exgcd": 19,
  "numberOfStudents": 19,
  "9999999": 19,
  "cards": 19,
  "output.txt": 19,
  "graph": 19,
  "mn2": 19,
  "bfs": 19,
  "52": 19,
  "hello": 19,
  "impossible": 19,
  "undefined\\n": 19,
  "1000010": 19,
  "variable": 19,
  "Rozdil": 19,
  "-O|OOO-O": 19,
  "TRIANGLE\\n": 19,
  "Read": 19,
  "fr": 19,
  "x4": 19,
  "grid": 19,
  "cp": 19,
  "bk": 19,
  "use": 19,
  "NULL": 19,
  "matrix": 19,
  "pos2": 19,
  "mis": 19,
  "signed": 19,
  "split": 19,
  "spc": 19,
  "func1": 19,
  "dnt": 19,
  "delx": 19,
  "doors": 19,
  "catalan_no": 19,
  "bids": 19,
  "int_r": 18,
  "name2": 18,
  "saturday": 18,
  "sunday": 18,
  "monday": 18,
  "tuesday": 18,
  "wednesday": 18,
  "thursday": 18,
  "friday": 18,
  "White": 18,
  "9223372036854775807": 18,
  "ssj": 18,
  "pp": 18,
  "pd": 18,
  "ba": 18,
  "1000003": 18,
  "islower": 18,
  "poww": 18,
  "62": 18,
  "res2": 18,
  "upper_bound": 18,
  "menor": 18,
  "10010": 18,
  "l4": 18,
  "divis": 18,
  "-O|": 18,
  "PRINT ": 18,
  "ULDR": 18,
  "sq": 18,
  "vs": 18,
  "maxim": 18,
  "tm": 18,
  "occur": 18,
  "pf": 18,
  "me": 18,
  "cmax": 18,
  "tsum": 18,
  "af": 18,
  "sec": 18,
  "merge": 18,
  "sorted": 18,
  "cum": 18,
  "count5": 18,
  "less": 18,
  "abc": 18,
  "yc": 18,
  "arg": 18,
  "waysfor3": 18,
  "RN": 18,
  "tamp": 18,
  "lens": 17,
  "dc": 17,
  "100000000": 17,
  "turn": 17,
  "999999": 17,
  "Input": 17,
  "Solve": 17,
  "_n": 17,
  "AB": 17,
  "BA": 17,
  "val2": 17,
  "tri": 17,
  "C#": 17,
  "D#": 17,
  "F#": 17,
  "G#": 17,
  "answ": 17,
  "update": 17,
  "1e10": 17,
  "17": 17,
  "primeFactures": 17,
  "maxN": 17,
  "blyat": 17,
  "GCD": 17,
  "Md": 17,
  "Hanako": 17,
  "Ciel": 17,
  "max3": 17,
  "prog": 17,
  "LEFT\\n": 17,
  "best": 17,
  "file": 17,
  "#.": 17,
  "decrement": 17,
  "it\\n": 17,
  "tmp2": 17,
  "max_i": 17,
  "mx1": 17,
  "factor": 17,
  "T2": 17,
  "output1": 17,
  "bg": 17,
  "rm": 17,
  "comb": 17,
  "via": 17,
  "total_area": 17,
  "e3": 17,
  "Tm": 17,
  "xc": 17,
  "noc": 17,
  "Fibonacci": 17,
  "func2": 17,
  "cat_no": 17,
  "choc_time": 17,
  "no_of_choc": 17,
  "count_n": 16,
  "currnum": 16,
  "ios": 16,
  "lg": 16,
  "wi": 16,
  "505": 16,
  "myMap": 16,
  "nxt": 16,
  "wei": 16,
  "mk": 16,
  "assert": 16,
  "59": 16,
  "dfs1": 16,
  "workdays": 16,
  "dia": 16,
  "mie": 16,
  "Sentence": 16,
  "cerr": 16,
  "mn1": 16,
  "skills": 16,
  "numDiv": 16,
  "Now": 16,
  "ansx": 16,
  "sw": 16,
  "Ehab\\n": 16,
  "nuts": 16,
  "box": 16,
  "Bob\\n": 16,
  "S2": 16,
  "Incorrect\\n": 16,
  "Correct\\n": 16,
  "commamd": 16,
  "myset": 16,
  "-O|-OOOO": 16,
  "max_ending_here": 16,
  "a4": 16,
  "f3": 16,
  "integer": 16,
  "j1": 16,
  "nCr": 16,
  "inside": 16,
  "half": 16,
  "xp": 16,
  "bn": 16,
  "digsum": 16,
  "source": 16,
  "truth": 16,
  "sold": 16,
  "ksum": 16,
  "';": 16,
  "kcordi": 16,
  "ncordi": 16,
  "find_sum": 16,
  "fno": 16,
  "sno": 16,
  "yr": 16,
  "fseries": 16,
  "Fib": 16,
  "multi": 16,
  "revarr": 16,
  "reuselt": 16,
  "crhlt": 16,
  "lent": 15,
  "black\\n": 15,
  "99999999": 15,
  "256": 15,
  "count0": 15,
  "xd": 15,
  "sta": 15,
  "127": 15,
  "32767": 15,
  "tou": 15,
  "edges": 15,
  "fnd": 15,
  "fs": 15,
  "input.txt": 15,
  "Maxn": 15,
  "5e5": 15,
  "1002": 15,
  "220": 15,
  "bv": 15,
  "light": 15,
  "three": 15,
  "ha": 15,
  "searchres": 15,
  "basis": 15,
  "|#.......................|": 15,
  "501": 15,
  "-O|O-OOO": 15,
  "O-|OOO-O": 15,
  "O-|OOOO-": 15,
  "O-|OO-OO": 15,
  "-O|OOOO-": 15,
  "O-|O-OOO": 15,
  "-O|OO-OO": 15,
  "ey": 15,
  "state": 15,
  "status": 15,
  "flag3": 15,
  "lc": 15,
  "sumA": 15,
  "timer": 15,
  "given": 15,
  "srt": 15,
  "Sum": 15,
  "lll": 15,
  "beg": 15,
  "rmax": 15,
  "display": 15,
  "carr": 15,
  "sizes": 15,
  "default": 15,
  "tot_ways": 15,
  "missing": 15,
  "fib_ser": 15,
  "arrange": 15,
  "maxTill": 15,
  "kmp": 14,
  "P2": 14,
  "colors": 14,
  "fives": 14,
  "1e12": 14,
  "count_m": 14,
  "9223372036854775807LL": 14,
  "clock": 14,
  "val1": 14,
  "ones": 14,
  "month": 14,
  "row ": 14,
  "col ": 14,
  "__builtin_popcount": 14,
  "bigmod": 14,
  "100009": 14,
  "2002": 14,
  "2LL": 14,
  "Mul": 14,
  "name1": 14,
  "keep": 14,
  "80": 14,
  "mina": 14,
  "items": 14,
  "alph": 14,
  "xop": 14,
  "neo": 14,
  "ansa": 14,
  "ant": 14,
  "L1": 14,
  "r4": 14,
  "j2": 14,
  "le": 14,
  "convert": 14,
  "hash": 14,
  "Alice\\n": 14,
  "Second\\n": 14,
  "hb": 14,
  "called": 14,
  "|#.#.#.#.#.#.#.#.#.#.#.|.|)": 14,
  "statement": 14,
  "D\\n": 14,
  "L\\n": 14,
  "ca": 14,
  "g1": 14,
  "gy": 14,
  "sumB": 14,
  "ave": 14,
  "sum_a": 14,
  "sum_b": 14,
  "rank": 14,
  "group": 14,
  "util": 14,
  "soldiers": 14,
  "rmin": 14,
  "');": 14,
  "door": 14,
  "summation_of_scan": 14,
  "total_sum": 14,
  "equal_sum": 14,
  "intx": 14,
  "findsum": 14,
  "fab": 14,
  "cseries": 14,
  "waysfor5": 14,
  "ackrmn": 14,
  "akermn": 14,
  "min_diff": 14,
  "second_max": 14,
  "max_count": 14,
  "ym": 14,
  "xm": 14,
  "hop": 14,
  "frequency": 14,
  "sum_num": 14,
  "max_e": 14,
  "min_e": 14,
  "max_len": 14,
  "NEITHER": 13,
  "pas": 13,
  "100007": 13,
  "fastIo": 13,
  "zx": 13,
  "zy": 13,
  "aux2": 13,
  "rb": 13,
  "81": 13,
  "tam": 13,
  "3000": 13,
  "powmod": 13,
  "DELTA": 13,
  "bitset": 13,
  "1.5": 13,
  "abcdefghijklmnopqrstuvwxyz": 13,
  "capacity": 13,
  "LCM": 13,
  "ite": 13,
  "palindrome": 13,
  "shit": 13,
  "qq": 13,
  "<<=": 13,
  "jarak": 13,
  "bits": 13,
  "bit": 13,
  "dep": 13,
  "lp": 13,
  "nr": 13,
  "turns": 13,
  "3.14159265359": 13,
  "27000": 13,
  "max_": 13,
  "dragon": 13,
  "99": 13,
  "act": 13,
  "99999": 13,
  "360.0": 13,
  "lena": 13,
  "cl": 13,
  "First\\n": 13,
  "DOWN\\n": 13,
  "UP\\n": 13,
  "ccw\\n": 13,
  "S3": 13,
  "600": 13,
  "maps": 13,
  "36": 13,
  "txt": 13,
  "HER": 13,
  "|#.#.#.#.#.#.#.#.#.#.#.|.|": 13,
  "|#.#.#.#.#.#.#.#.#.#.#.|D|)": 13,
  "Koyomi": 13,
  "write": 13,
  "posi": 13,
  "lenb": 13,
  "idx1": 13,
  "idx2": 13,
  "ptr": 13,
  "vol": 13,
  "tg": 13,
  "maxy": 13,
  "cf": 13,
  "fp": 13,
  "xmax": 13,
  "mindis": 13,
  "random": 13,
  "blank": 13,
  "A3": 13,
  "oCount": 13,
  "eCount": 13,
  "third": 13,
  "rmini": 13,
  "check_sum": 13,
  "hanoi_moves": 13,
  "ar3": 13,
  "funct": 13,
  "maxInversions": 13,
  "max_inv": 13,
  "chan": 13,
  "getReverse": 13,
  "akerman": 13,
  "catalan_num": 13,
  "bool1": 13,
  "bool2": 13,
  "slp": 13,
  "findarea": 13,
  "nrj": 13,
  "large_pos": 13,
  "find_min": 13,
  "idx_min": 13,
  "choco_time": 13,
  "bob_index": 13,
  "alice_index": 13,
  "alice_time": 13,
  "luc": 13,
  "maxvariable": 13,
  "isalpha": 12,
  "pos_1": 12,
  "cnr": 12,
  "1009": 12,
  "deque": 12,
  "nf": 12,
  "letters": 12,
  "hr": 12,
  "center": 12,
  "byte": 12,
  "BigInteger": 12,
  "max_so_far": 12,
  "banyakyangmilihini": 12,
  "nC": 12,
  "gcd1": 12,
  "1000000009LL": 12,
  "flag0": 12,
  "prevbeg": 12,
  "prevlen": 12,
  "currcase": 12,
  "10000007": 12,
  "ld": 12,
  "dict": 12,
  "negativos": 12,
  "unique_names": 12,
  "nega": 12,
  "sumne": 12,
  "sumpo": 12,
  "acu": 12,
  "pass": 12,
  "va": 12,
  "ranks": 12,
  "sizeedge": 12,
  "srand": 12,
  "vis1": 12,
  "Find": 12,
  "skill_level": 12,
  "1111111": 12,
  "10000000000": 12,
  "ofstream": 12,
  "wz": 12,
  "cumm": 12,
  "test1": 12,
  "Dm": 12,
  "info": 12,
  "ak": 12,
  "last_start": 12,
  "Posution": 12,
  "org": 12,
  "Mahmoud\\n": 12,
  "vect": 12,
  "sides": 12,
  "step_f": 12,
  "n0": 12,
  "spect": 12,
  "lca": 12,
  "999": 12,
  "good": 12,
  "X--": 12,
  "999999999": 12,
  "210": 12,
  "IMPOSSIBLE\\n": 12,
  "lt": 12,
  "47": 12,
  "time1": 12,
  "taken": 12,
  "bio": 12,
  "may": 12,
  "sums": 12,
  "al": 12,
  "flage": 12,
  "ymax": 12,
  "ymin": 12,
  "xmin": 12,
  "quantity": 12,
  "yp": 12,
  "cheak": 12,
  "net": 12,
  "vests": 12,
  "length_longest_subsequence": 12,
  "towers": 12,
  "twh": 12,
  "array1": 12,
  "array2": 12,
  "MAXNUM": 12,
  "new_order": 12,
  "reverse_arr": 12,
  "ser": 12,
  "CP2": 12,
  "AP2": 12,
  "AC2": 12,
  "hf": 12,
  "catalan_n": 12,
  "balparen": 12,
  "st2": 11,
  "seat": 11,
  "num0": 11,
  "cont2": 11,
  "1e15": 11,
  "poww_mod": 11,
  "500000": 11,
  "100050": 11,
  "ten": 11,
  "42": 11,
  "lang": 11,
  "5050": 11,
  "grafo": 11,
  "vowels": 11,
  "ip2": 11,
  "1000100": 11,
  "maxnn": 11,
  "binary_search": 11,
  "bad": 11,
  "150005": 11,
  "rv": 11,
  "tail": 11,
  "ww": 11,
  "2010": 11,
  "vn": 11,
  "active": 11,
  "io": 11,
  "DFS": 11,
  "ansr": 11,
  "ox": 11,
  "oy": 11,
  "ansb": 11,
  "speed": 11,
  "pwr": 11,
  "tim": 11,
  "vc": 11,
  "gl": 11,
  "maxs": 11,
  "z1": 11,
  "1000000001": 11,
  "hitung": 11,
  "Count": 11,
  "men": 11,
  "words": 11,
  "arya": 11,
  "bran": 11,
  "_": 11,
  "beat": 11,
  "bi": 11,
  "back\\n": 11,
  "cup": 11,
  "banyak": 11,
  "el": 11,
  "siz": 11,
  "road": 11,
  "qua": 11,
  "arg1": 11,
  "#Color\\n": 11,
  "equals": 11,
  "An": 11,
  "OO": 11,
  "1111": 11,
  "joy": 11,
  "U\\n": 11,
  "SEGMENT\\n": 11,
  "forw": 11,
  "Am": 11,
  "modd": 11,
  "tmp1": 11,
  "es": 11,
  "time2": 11,
  "tl": 11,
  "so": 11,
  "k3": 11,
  "arry": 11,
  "Ar": 11,
  "mov": 11,
  "miny": 11,
  "diff1": 11,
  "sumi": 11,
  "cut": 11,
  "ie": 11,
  "find_max": 11,
  "getsum": 11,
  "max_till_now": 11,
  "ncalls": 11,
  "HT": 11,
  "hanoi_": 11,
  "SUM": 11,
  "verify": 11,
  "fi_B": 11,
  "fi_A": 11,
  "fi_C": 11,
  "msmc": 11,
  "esma": 11,
  "esmc": 11,
  "msmb": 11,
  "esmb": 11,
  "msma": 11,
  "recurrence": 11,
  "uarr": 11,
  "invcount": 11,
  "catalon": 11,
  "income": 11,
  "'{": 11,
  "lount": 11,
  "plt": 11,
  "catalen": 11,
  "dec_sort": 11,
  "right_rot": 11,
  "pos_2": 10,
  "backw": 10,
  "mp1": 10,
  "zeroes": 10,
  "posy": 10,
  "posx": 10,
  "dig_n": 10,
  "dig_m": 10,
  "flags": 10,
  "exist": 10,
  "max_num": 10,
  "iC": 10,
  "tC": 10,
  "qpow": 10,
  "1.5e7": 10,
  "aux1": 10,
  "wrkdsz": 10,
  "fpow": 10,
  "emm1": 10,
  "nneg": 10,
  "2 ": 10,
  "Dist": 10,
  "arrx": 10,
  "isPalindrome": 10,
  "300000": 10,
  "manz": 10,
  "rmark": 10,
  "MODULUS": 10,
  "col1": 10,
  "cent": 10,
  "sheets": 10,
  "0x7fffffff": 10,
  "id1": 10,
  "hashi": 10,
  "fy": 10,
  "nei": 10,
  "107": 10,
  "curr_size": 10,
  "curr_d": 10,
  "s25": 10,
  "primer": 10,
  "hero": 10,
  "masuk": 10,
  "bisa": 10,
  "modexp": 10,
  "prev_notup": 10,
  "zlicz": 10,
  "rr": 10,
  "uu": 10,
  "Dy": 10,
  "Hm": 10,
  "desperate_optimization": 10,
  "fastexp": 10,
  "students": 10,
  "300005": 10,
  "it1": 10,
  "vid": 10,
  "a5": 10,
  "sup": 10,
  "cot": 10,
  "amazing": 10,
  "que": 10,
  "sumr": 10,
  "jum": 10,
  "o1": 10,
  "qs": 10,
  "Oh, my keyboard!": 10,
  "finder": 10,
  "alpha": 10,
  "9999999999": 10,
  "YES\\n2\\n": 10,
  "144": 10,
  "qx": 10,
  "qy": 10,
  "numa": 10,
  "inch": 10,
  "Ans": 10,
  "vet": 10,
  "rotasi": 10,
  "arg2": 10,
  "counts": 10,
  "pointer": 10,
  "LLONG_MAX": 10,
  "li": 10,
  "colors.in": 10,
  "QAQ": 10,
  "X++": 10,
  "++X": 10,
  "disk": 10,
  "cha": 10,
  "step1": 10,
  "game": 10,
  "Y1": 10,
  "Y2": 10,
  "row1": 10,
  "row2": 10,
  "dn": 10,
  "bt": 10,
  "maxind": 10,
  "minind": 10,
  "pnt": 10,
  "subtraction": 10,
  "esum": 10,
  "old": 10,
  "minm": 10,
  "nt": 10,
  "label": 10,
  "error": 10,
  "interval": 10,
  "bf": 10,
  "filled": 10,
  "jmax": 10,
  "outside": 10,
  "ul": 10,
  "lnum": 10,
  "integers": 10,
  "spare": 10,
  "maxindex": 10,
  "hd": 10,
  "dst": 10,
  "fA": 10,
  "fB": 10,
  "sos": 10,
  "honai_1": 10,
  "honai_2": 10,
  "totarea": 10,
  "dump": 10,
  "utilarr": 10,
  "arraycutter": 10,
  "hcm": 10,
  "choco": 10,
  "birthYear": 10,
  "birth": 10,
  "perfectnum": 10,
  "fabi": 10,
  "arrr": 10,
  "opp": 10,
  "f_1": 10,
  "f_2": 10,
  "f_3": 10,
  "Tn_1": 10,
  "Tn_2": 10,
  "revisit": 10,
  "Point": 10,
  "arrt": 10,
  "fcatalan": 10,
  "resu": 10,
  "Nu": 10,
  "acount": 10,
  "prdct": 10,
  "poor": 10,
  "sum_al": 10,
  "sum_bob": 10,
  "nolst": 10,
  "LINF": 9,
  "white\\n": 9,
  "mmp": 9,
  "tempname": 9,
  "SS": 9,
  "MINN": 9,
  "solve2": 9,
  "ic": 9,
  "9999": 9,
  "sk": 9,
  "max_n": 9,
  "1000020": 9,
  "cor": 9,
  "seed": 9,
  "haogan": 9,
  "studentsRate": 9,
  "build": 9,
  "major\\n": 9,
  "minor\\n": 9,
  "mapp": 9,
  "isp": 9,
  "gcdd": 9,
  "highest": 9,
  "is_same": 9,
  "same_num": 9,
  "pause": 9,
  "limit": 9,
  "ans3": 9,
  "fuck": 9,
  "no_of_digits": 9,
  "cnta": 9,
  "100003": 9,
  "amigos": 9,
  "pairt": 9,
  "awalx": 9,
  "awaly": 9,
  "4000000": 9,
  "fim": 9,
  "1200000": 9,
  "sss": 9,
  "ansm": 9,
  "cyka": 9,
  "nuevo": 9,
  "numLeft": 9,
  "ansy": 9,
  "fix": 9,
  "dic": 9,
  "remain": 9,
  "1000000007LL": 9,
  "INFF": 9,
  "1000000000000000005LL": 9,
  "nextVal": 9,
  "showpoint": 9,
  "fail": 9,
  "dif_row": 9,
  "dif_col": 9,
  "10000005": 9,
  "1003": 9,
  "simon": 9,
  "200100": 9,
  "contador": 9,
  "maks": 9,
  "sum_minus": 9,
  "Stone": 9,
  "misha": 9,
  "full": 9,
  "xay": 9,
  "I become the guy.": 9,
  "118": 9,
  "94": 9,
  "cw\\n": 9,
  "item": 9,
  "depth": 9,
  "card": 9,
  "ky": 9,
  "Friendship\\n": 9,
  "File": 9,
  "Init": 9,
  "remainings": 9,
  "spyke_id": 9,
  "tu": 9,
  "Colours": 9,
  "iter": 9,
  "argument": 9,
  "acef": 9,
  "fuel": 9,
  "2e3": 9,
  "OR": 9,
  "100002": 9,
  "#Black&White\\n": 9,
  "c4": 9,
  "hp1": 9,
  "hp2": 9,
  "actual": 9,
  "imax": 9,
  "present": 9,
  "sign": 9,
  "Diff": 9,
  "n4": 9,
  "com": 9,
  "x0": 9,
  "choc": 9,
  "getMax": 9,
  "jmin": 9,
  "stp": 9,
  "max_idx": 9,
  "unit": 9,
  "oc": 9,
  "m_a_x": 9,
  "max_int": 9,
  "maxasc": 9,
  "longest": 9,
  "least_max": 9,
  "tower_of_hanoi": 9,
  "countmax": 9,
  "Tow": 9,
  "checkinc": 9,
  "pivot": 9,
  "checkdec": 9,
  "func_val": 9,
  "delta_x": 9,
  "value_chk": 9,
  "dmin": 9,
  "birth_year": 9,
  "birthyear": 9,
  "fibonachi": 9,
  "medianC": 9,
  "medianB": 9,
  "medianA": 9,
  "A_end": 9,
  "B_mid": 9,
  "A_mid": 9,
  "C_mid": 9,
  "C_end": 9,
  "B_end": 9,
  "fC": 9,
  "smlcat": 9,
  "catl": 9,
  "AV": 9,
  "kat": 9,
  "tn1": 9,
  "tn2": 9,
  "rooms": 9,
  "space_count": 9,
  "loop2": 9,
  "miy": 9,
  "mix": 9,
  "sparr": 9,
  "plat": 9,
  "printout": 9,
  "pfactor": 9,
  "ssort": 9,
  "idxmax": 9,
  "fidx": 9,
  "resc": 9,
  "max_array": 9,
  "ppl": 9,
  "alicesum": 9,
  "bobsum": 9,
  "girl_time": 9,
  "rotatearray": 9,
  "luck": 9,
  "subseq": 9,
  "atob": 8,
  "btoa": 8,
  "round1": 8,
  "900": 8,
  "raw": 8,
  "vi": 8,
  "MAXX": 8,
  "denied": 8,
  "atk1": 8,
  "def1": 8,
  "num5": 8,
  "digitn": 8,
  "digitm": 8,
  "faken": 8,
  "fakem": 8,
  "vct": 8,
  "horizontal": 8,
  "appear": 8,
  "den": 8,
  "inilahhasilnya": 8,
  "lIdx": 8,
  "rIdx": 8,
  "CHR": 8,
  "modx": 8,
  "cpy": 8,
  "gmax": 8,
  "Palindromic tree is better than splay tree": 8,
  "started": 8,
  "2e7": 8,
  "mex": 8,
  "6969": 8,
  "spff": 8,
  "debug": 8,
  "2048": 8,
  "maskX": 8,
  "maskY": 8,
  "zer": 8,
  "ru": 8,
  "100004": 8,
  "ans_l": 8,
  "ans_r": 8,
  "ansy1": 8,
  "ansy2": 8,
  "input2": 8,
  "myv": 8,
  "salida": 8,
  "cntb": 8,
  "Sub": 8,
  "104": 8,
  "col2": 8,
  "_min": 8,
  "jl": 8,
  "distinct": 8,
  "d10": 8,
  "150001": 8,
  "alt": 8,
  "0x3f3f3f3f3f3f3f3f": 8,
  "vis2": 8,
  "new_skill": 8,
  "segun": 8,
  "log10": 8,
  "files": 8,
  "count25": 8,
  "stac": 8,
  "matriz": 8,
  "r25": 8,
  "qkids": 8,
  "D2": 8,
  "mx2": 8,
  "ansl": 8,
  "edge": 8,
  "1e-10": 8,
  "getFactorization": 8,
  "getZarr": 8,
  "prev_up": 8,
  "increment": 8,
  "maxval": 8,
  "arrayi": 8,
  "NEB": 8,
  "malow": 8,
  "vp": 8,
  "lead0": 8,
  "ston": 8,
  "multimap": 8,
  "zheng": 8,
  "geo": 8,
  "first_col": 8,
  "ou": 8,
  "emp": 8,
  "maze": 8,
  "mxn": 8,
  "cycle": 8,
  "contiguous": 8,
  "pet": 8,
  "dat": 8,
  "cunt": 8,
  "len_block": 8,
  "note": 8,
  "Set": 8,
  "boxes": 8,
  "95": 8,
  "chris": 8,
  "blocked": 8,
  "57": 8,
  "o2": 8,
  "lft": 8,
  "faces": 8,
  "G1": 8,
  "pen": 8,
  "fast_io": 8,
  "fast_exp": 8,
  "step_b": 8,
  "s0": 8,
  "maxcnt": 8,
  "kx": 8,
  "wh": 8,
  "hour": 8,
  "Hash": 8,
  "diamond": 8,
  "home\\n": 8,
  "c0": 8,
  "Tb": 8,
  "way": 8,
  "nex": 8,
  "DeleteIt": 8,
  "quotient": 8,
  "bal": 8,
  "#\\n": 8,
  "nonzero": 8,
  "getInt": 8,
  "HIM!\\n": 8,
  "HER!\\n": 8,
  "sets": 8,
  "|.|\\n": 8,
  "|D|)": 8,
  "|.|": 8,
  "leave": 8,
  "log": 8,
  "asd": 8,
  "zxcvbnm": 8,
  "Malvika\\n": 8,
  "3.14159": 8,
  "--X": 8,
  "min_i": 8,
  "min_j": 8,
  "max_j": 8,
  "further": 8,
  "yb": 8,
  "got": 8,
  "palin": 8,
  "step2": 8,
  "p11": 8,
  "p21": 8,
  "compute": 8,
  "sn": 8,
  "xs": 8,
  "absolute": 8,
  "diff2": 8,
  "record": 8,
  "arr3": 8,
  "jump": 8,
  "location": 8,
  "X1": 8,
  "X2": 8,
  "sr": 8,
  "entry": 8,
  "mean": 8,
  "swaps": 8,
  "strt": 8,
  "no_of_soldiers": 8,
  "countstat": 8,
  "no_steps": 8,
  "total_steps": 8,
  "tow": 8,
  "tohanoi": 8,
  "step_hanoi": 8,
  "gates": 8,
  "gat": 8,
  "'){": 8,
  "summation": 8,
  "checkSum": 8,
  "halfsum": 8,
  "mergesort": 8,
  "Int": 8,
  "doubley": 8,
  "arr_sum": 8,
  "sto": 8,
  "cheak_sum": 8,
  "sumfun": 8,
  "no_line": 8,
  "midb": 8,
  "midc": 8,
  "endc": 8,
  "enda": 8,
  "mida": 8,
  "endb": 8,
  "Avg": 8,
  "input_arr": 8,
  "new_post": 8,
  "new_ordr": 8,
  "book_no": 8,
  "max_mon": 8,
  "rup": 8,
  "toh_": 8,
  "Through": 8,
  "Thn": 8,
  "Tn1": 8,
  "Tn2": 8,
  "Tv": 8,
  "Tu": 8,
  "c_count": 8,
  "hold": 8,
  "Ackermann": 8,
  "check_fib": 8,
  "prev_height": 8,
  "curr_height": 8,
  "land": 8,
  "Height": 8,
  "Base": 8,
  "arrdiff": 8,
  "inpt": 8,
  "idx_max": 8,
  "time_a": 8,
  "time_b": 8,
  "bptr": 8,
  "aptr": 8,
  "offset": 7,
  "maxnum": 7,
  "person": 7,
  "cont1": 7,
  "songs": 7,
  "xh": 7,
  "qtd": 7,
  "CLOCKS_PER_SEC": 7,
  "1e99": 7,
  "gc": 7,
  "tlen": 7,
  "MaxN": 7,
  "disC": 7,
  "forbid": 7,
  "important": 7,
  "Possible": 7,
  "team": 7,
  "heros": 7,
  "chax": 7,
  "chay": 7,
  "rfind": 7,
  "istringstream": 7,
  "memcpy": 7,
  "is_vowel": 7,
  "sdiag": 7,
  "lios": 7,
  "liala": 7,
  "etr": 7,
  "etra": 7,
  "initis": 7,
  "inites": 7,
  "rub": 7,
  "41": 7,
  "00:00": 7,
  "prims": 7,
  "2000005": 7,
  "nam": 7,
  "5e3": 7,
  "Mod": 7,
  "lib": 7,
  "blah": 7,
  "after": 7,
  "input1": 7,
  "crush": 7,
  "100.0": 7,
  "minimal": 7,
  "positivos": 7,
  "get_ans": 7,
  "cntc": 7,
  "58": 7,
  "vowel": 7,
  "sd": 7,
  "dollar": 7,
  "5000000": 7,
  "100006": 7,
  "202": 7,
  "tercer": 7,
  "perm": 7,
  "dp1": 7,
  "tam1": 7,
  "count_a": 7,
  "nineteen": 7,
  "contN": 7,
  "load": 7,
  "3.14159265358979323846": 7,
  "reports": 7,
  "judge2": 7,
  "numOpen": 7,
  "notup": 7,
  "99999999999": 7,
  "hpm": 7,
  "maxb": 7,
  "ia": 7,
  "xb": 7,
  "fu": 7,
  "rate": 7,
  "fast_power": 7,
  "vl": 7,
  "first_row": 7,
  "file.txt": 7,
  "st_taken": 7,
  "cb": 7,
  "rl1": 7,
  "rl2": 7,
  "301": 7,
  "tira": 7,
  "sum_plus": 7,
  "suml": 7,
  "Chris\\n": 7,
  "kt": 7,
  "109": 7,
  "2e18": 7,
  "slogan": 7,
  "rgt": 7,
  "index1": 7,
  "au": 7,
  "tep": 7,
  "killed": 7,
  "hash1": 7,
  "totalpass": 7,
  "WBWBWBWB": 7,
  "BWBWBWBW": 7,
  "gov": 7,
  "rl": 7,
  "30005": 7,
  "10.0": 7,
  "inicio": 7,
  "findfa": 7,
  "minit": 7,
  "feet": 7,
  "rnum": 7,
  "binaryCode": 7,
  "segment": 7,
  "l2r": 7,
  "Ql": 7,
  "Qr": 7,
  "sementara": 7,
  "contest\\n": 7,
  "sameSocks": 7,
  "monedas": 7,
  "minr": 7,
  "maxr": 7,
  "reqrec": 7,
  "previous": 7,
  "xsum": 7,
  "ysum": 7,
  "2000000000": 7,
  "30010": 7,
  "0x3f": 7,
  "longs": 7,
  "ri": 7,
  "proceed": 7,
  "1007": 7,
  "gg": 7,
  "1500": 7,
  "cd": 7,
  "sumc": 7,
  "P3": 7,
  "OOOO-": 7,
  "variables": 7,
  "zz": 7,
  "vectors": 7,
  "63": 7,
  "LD\\n": 7,
  "truthy": 7,
  "with": 7,
  "prealoc": 7,
  "a8": 7,
  "h8": 7,
  "RU\\n": 7,
  "ki": 7,
  "aj": 7,
  "Akshat\\n": 7,
  "memo": 7,
  "column": 7,
  "counter1": 7,
  "math": 7,
  "min_price": 7,
  "mt": 7,
  "imin": 7,
  "cols": 7,
  "ni": 7,
  "columns": 7,
  "temp3": 7,
  "lmin": 7,
  "cpr": 7,
  "inc": 7,
  "nod": 7,
  "clr": 7,
  "mg": 7,
  "nm": 7,
  "TOH": 7,
  "arr_disp": 7,
  "tofhanoi": 7,
  "testarr": 7,
  "barray": 7,
  "pole1": 7,
  "pole3": 7,
  "pole2": 7,
  "lim_j": 7,
  "tot_sum": 7,
  "'a[i]": 7,
  "siz1": 7,
  "getSum": 7,
  "addition": 7,
  "recursive": 7,
  "war": 7,
  "hgt": 7,
  "hei": 7,
  "luckyyear": 7,
  "is_perfect": 7,
  "fmarks": 7,
  "recN": 7,
  "booknos": 7,
  "max_inversions": 7,
  "Reverse": 7,
  "move2": 7,
  "src": 7,
  "T_n": 7,
  "tarr": 7,
  "member": 7,
  "'}": 7,
  "occuernce": 7,
  "check_num": 7,
  "define_fibo": 7,
  "hlth": 7,
  "nop": 7,
  "read_int": 7,
  "ordered": 7,
  "modulus": 7,
  "selectsort": 7,
  "diff_recur": 7,
  "reqdiff": 7,
  "DI": 7,
  "start_in": 7,
  "oldC": 7,
  "IntMin": 7,
  "IntMax": 7,
  "rich": 7,
  "lucn": 7,
  "maxii": 7,
  "1000000010": 6,
  "temps": 6,
  "dix": 6,
  "diy": 6,
  "right_tri": 6,
  "123456": 6,
  "F1": 6,
  "F2": 6,
  "getnext": 6,
  "round2": 6,
  "match1": 6,
  "cursor": 6,
  "static_cast": 6,
  "mp2": 6,
  "client": 6,
  "defcos": 6,
  "binSearch": 6,
  "zeros": 6,
  "cz": 6,
  "ng": 6,
  "gp": 6,
  "maxVal": 6,
  "newX": 6,
  "newY": 6,
  "mpu": 6,
  "xxx": 6,
  "most": 6,
  "mint": 6,
  "permutem": 6,
  "permuteh": 6,
  "round": 6,
  "remaind": 6,
  "linf": 6,
  "sum_pos": 6,
  "sum_neg": 6,
  "vertikal": 6,
  "theyareworking": 6,
  "hihi": 6,
  "1\\n0\\n": 6,
  "to_int": 6,
  "colunas": 6,
  "Da": 6,
  "Db": 6,
  "Anka": 6,
  "Chapay": 6,
  "Cleo": 6,
  "Dracul": 6,
  "Snowy": 6,
  "Hexadecimal": 6,
  "111111": 6,
  "parrent": 6,
  "Union": 6,
  "panduan": 6,
  "tot1": 6,
  "ended": 6,
  "MAXM": 6,
  "ulong": 6,
  "131": 6,
  "xasphalt": 6,
  "yasphalt": 6,
  "bon": 6,
  "emm2": 6,
  "lk": 6,
  "lastValid": 6,
  "auxp": 6,
  "auxc": 6,
  "breaktime": 6,
  "lastbreaktime": 6,
  "3e2": 6,
  "maohao": 6,
  "k0": 6,
  "flagg": 6,
  "50000": 6,
  "fastMax": 6,
  "fastMin": 6,
  "lu": 6,
  "dk": 6,
  "rgraph": 6,
  "rq": 6,
  "st1": 6,
  "maxsalary": 6,
  "ivec": 6,
  "boostIO": 6,
  "beforeP": 6,
  "4005": 6,
  "likes": 6,
  "1500000": 6,
  "dz": 6,
  "dist1": 6,
  "rdfs": 6,
  "chkPrime1to10000000": 6,
  "seive": 6,
  "Div": 6,
  "gender": 6,
  "iv": 6,
  "rh": 6,
  "at2": 6,
  "bpow": 6,
  "Counter": 6,
  "OK": 6,
  "maxSubArraySum": 6,
  "500005": 6,
  "skill_name": 6,
  "isvowel": 6,
  "passou": 6,
  "asphaltx": 6,
  "asphalty": 6,
  "there": 6,
  "any": 6,
  "MID": 6,
  "Impossible\\n": 6,
  "tmaxmin": 6,
  "solx1": 6,
  "solx2": 6,
  "tam2": 6,
  "pali": 6,
  "multiset": 6,
  "rowa": 6,
  "over": 6,
  "alfa": 6,
  "fS": 6,
  "wa": 6,
  "check1": 6,
  "vert": 6,
  "amulets": 6,
  "prevDiv": 6,
  "nextt": 6,
  "MI": 6,
  "5010": 6,
  "hpy": 6,
  "mr": 6,
  "pointPos": 6,
  "Hy": 6,
  "Hs": 6,
  "As": 6,
  "Ds": 6,
  ":0": 6,
  "__typeof": 6,
  "rstr": 6,
  "n_one": 6,
  "0x1": 6,
  "rez": 6,
  "is_x1": 6,
  "is_x2": 6,
  "is_y1": 6,
  "is_y2": 6,
  "4\\n": 6,
  "chng": 6,
  "zuida": 6,
  "posL": 6,
  "carryFlag": 6,
  "Emp_Lang": 6,
  "first_ai": 6,
  "vl4": 6,
  "n_count": 6,
  "i_count": 6,
  "e_count": 6,
  "t_count": 6,
  "second_row": 6,
  "second_col": 6,
  "studentTS": 6,
  "qwe": 6,
  "it2": 6,
  "p10": 6,
  "a_i": 6,
  "a6": 6,
  "100500": 6,
  "34": 6,
  "minodd": 6,
  "odds": 6,
  "cadena": 6,
  "Friendship is magic!^^": 6,
  "Mininum": 6,
  "loss1": 6,
  "loss2": 6,
  "arrays": 6,
  "pow2": 6,
  "pe": 6,
  "im": 6,
  "_a": 6,
  "180.0": 6,
  "1440": 6,
  "Li": 6,
  "pearls": 6,
  "D1": 6,
  "tedad": 6,
  "saida": 6,
  "gh": 6,
  "maxNum": 6,
  "TIE\\n": 6,
  "pResult": 6,
  "hld": 6,
  "maxsec": 6,
  "3.0": 6,
  "medal": 6,
  "202002": 6,
  "brainfuck": 6,
  "log_": 6,
  "poss1_p1": 6,
  "poss1_spec": 6,
  "list1": 6,
  "601": 6,
  "binaryChar": 6,
  "inputs": 6,
  "__b": 6,
  "cari": 6,
  "ans_a": 6,
  "ans_b": 6,
  "310": 6,
  "reqNo": 6,
  "cA": 6,
  "zsum": 6,
  "secretaries_num": 6,
  "Names": 6,
  "istream": 6,
  "ostream": 6,
  "1000007": 6,
  "amounts1": 6,
  "amounts2": 6,
  "prices": 6,
  "str3": 6,
  "MAX2": 6,
  "binary": 6,
  "newline": 6,
  "other": 6,
  "mxm": 6,
  "mmax": 6,
  "noop": 6,
  "100011": 6,
  "doit": 6,
  "1000000000000": 6,
  "isVowel": 6,
  "252": 6,
  "70": 6,
  "()": 6,
  "reset": 6,
  "shu": 6,
  "votes": 6,
  "ds": 6,
  "Otherwise": 6,
  "process": 6,
  "invoke": 6,
  "numeric_limits": 6,
  "del": 6,
  "-OOOO": 6,
  "0000000": 6,
  "levels": 6,
  "salt": 6,
  "minus": 6,
  "magic!^^\\n": 6,
  "computer": 6,
  "substring": 6,
  "plen": 6,
  "pb": 6,
  "lm": 6,
  "counta": 6,
  "p12": 6,
  "p22": 6,
  "maxt": 6,
  "c5": 6,
  "tmin": 6,
  "flag_1": 6,
  "output2": 6,
  "part": 6,
  "te": 6,
  "ats": 6,
  "people": 6,
  "ee": 6,
  "pv": 6,
  "enter": 6,
  "scan": 6,
  "asc": 6,
  "maxdiff": 6,
  "nsum": 6,
  "no1": 6,
  "sb1": 6,
  "sb2": 6,
  "det": 6,
  "maxsold": 6,
  "avlvst": 6,
  "reqvst": 6,
  "fob": 6,
  "psoldiers": 6,
  "pvests": 6,
  "r_max": 6,
  "dummy": 6,
  "minarr": 6,
  "hanoi_1": 6,
  "no_of_steps": 6,
  "members": 6,
  "left_key_place": 6,
  "dty": 6,
  "from_rod": 6,
  "via_rod": 6,
  "to_rod": 6,
  "Third": 6,
  "aij": 6,
  "[i]": 6,
  "fun_b": 6,
  "hanoi2": 6,
  "pol3": 6,
  "pol2": 6,
  "pol": 6,
  "finalsum": 6,
  "net_sum": 6,
  "fxi": 6,
  "'10": 6,
  "siz2": 6,
  "readarray": 6,
  "sum_rec": 6,
  "indices": 6,
  "recall": 6,
  "weg": 6,
  "hig": 6,
  "douche": 6,
  "dopa": 6,
  "dup": 6,
  "revnum": 6,
  "checkperf": 6,
  "fibbo": 6,
  "eMark": 6,
  "fMark": 6,
  "mMark": 6,
  "es2": 6,
  "fm1": 6,
  "es1": 6,
  "ms1": 6,
  "ms3": 6,
  "es3": 6,
  "fm2": 6,
  "ms2": 6,
  "fm3": 6,
  "place": 6,
  "old_order": 6,
  "catnum": 6,
  "Catalan": 6,
  "amnt": 6,
  "TI": 6,
  "chck": 6,
  "rvrs": 6,
  "print_reverse": 6,
  "printrev": 6,
  "reverse_print": 6,
  "digit_sum": 6,
  "repeat_no": 6,
  "miss_no": 6,
  "is_catalan": 6,
  "num_arr": 6,
  "xbig": 6,
  "xsmall": 6,
  "ybig": 6,
  "ysmall": 6,
  "By": 6,
  "Bx": 6,
  "ymi": 6,
  "xmi": 6,
  "CP_2": 6,
  "AC_2": 6,
  "AP_2": 6,
  "eop": 6,
  "nopf": 6,
  "reducehealth": 6,
  "aft": 6,
  "plats": 6,
  "printPattern": 6,
  "storage": 6,
  "array3": 6,
  "combination": 6,
  "ret_v": 6,
  "seqsort": 6,
  "differ": 6,
  "finding_product": 6,
  "product1": 6,
  "arr_prod": 6,
  "compute_prod": 6,
  "arr_n": 6,
  "arr_m": 6,
  "n_2": 6,
  "n_1": 6,
  "ctr2": 6,
  "ctr1": 6,
  "choc_count": 6,
  "aliceBars": 6,
  "t_bob": 6,
  "t_alice": 6,
  "luckn": 6,
  "src1": 5,
  "src2": 5,
  "both\\n": 5,
  "forward\\n": 5,
  "backward\\n": 5,
  "fantasy\\n": 5,
  "rit": 5,
  "parity": 5,
  "SC1": 5,
  "tip": 5,
  "MODPRIMA": 5,
  "single": 5,
  "1000000000000000": 5,
  "1.": 5,
  "yyy": 5,
  "replica": 5,
  "infint64_t": 5,
  "number_of_5": 5,
  "3.1415926535": 5,
  "ind_s": 5,
  "ind_e": 5,
  "get_prime": 5,
  "ab1": 5,
  "ba2": 5,
  "2e2": 5,
  "49": 5,
  "anst": 5,
  "findSet": 5,
  "odgr": 5,
  "Troll": 5,
  "FindParrent": 5,
  "visitado": 5,
  "iss": 5,
  "hui": 5,
  "fm": 5,
  " - ": 5,
  "lose": 5,
  "69": 5,
  "js": 5,
  "$": 5,
  "bitcount": 5,
  "00": 5,
  "ispal": 5,
  "2050000": 5,
  "ok2": 5,
  "somaPoli": 5,
  "0.001": 5,
  "tomas": 5,
  "maxin": 5,
  "1024": 5,
  "err": 5,
  "answerFound": 5,
  "convert_str": 5,
  "psg": 5,
  "afterP": 5,
  "Left": 5,
  "5e6": 5,
  "last_digit": 5,
  "mind": 5,
  "cross": 5,
  "mod_pow": 5,
  "connected": 5,
  "INF_INT": 5,
  "INF_LL": 5,
  "INF_ULL": 5,
  "18446744073709551615Ull": 5,
  "92540646808111039LL": 5,
  "Move": 5,
  "Move_": 5,
  "str2num": 5,
  "akt": 5,
  "cal_digit": 5,
  "cal_largerthanorequaltox": 5,
  "id0": 5,
  "dB": 5,
  "dW": 5,
  "Total": 5,
  "auto": 5,
  "urm": 5,
  "512": 5,
  "mmc": 5,
  "s50": 5,
  "log7": 5,
  "200007": 5,
  "palindrom": 5,
  "val3": 5,
  "colo": 5,
  "count_c": 5,
  "count_b": 5,
  "r50": 5,
  "candies": 5,
  "jawab": 5,
  "ma2": 5,
  "ALPH": 5,
  "ct1": 5,
  "txt.in": 5,
  "txt.out": 5,
  "ultimate": 5,
  "sum_n": 5,
  "maxsub": 5,
  "cans": 5,
  "ch3": 5,
  "mid_num": 5,
  "dd1": 5,
  "dd2": 5,
  "line1": 5,
  "cash": 5,
  "outdeg": 5,
  "hora": 5,
  "ntc": 5,
  "power1": 5,
  "mcnt": 5,
  "min_v": 5,
  "pan": 5,
  "Rick": 5,
  "knight": 5,
  "yy1": 5,
  "triangulo": 5,
  "ogo": 5,
  "ang": 5,
  "trd": 5,
  "tgd": 5,
  "tbd": 5,
  "1.00": 5,
  "magic": 5,
  "Still Rozdil": 5,
  "f0": 5,
  "maxSections": 5,
  "my_min": 5,
  "counter2": 5,
  "mcount": 5,
  "ccount": 5,
  "clones": 5,
  "cost_min": 5,
  "PE": 5,
  "lessonsn": 5,
  "ming1": 5,
  "ming2": 5,
  "frnd": 5,
  "penalty": 5,
  "index2": 5,
  "hcf": 5,
  "bq": 5,
  "echo": 5,
  "endd": 5,
  "station1": 5,
  "current_minimum": 5,
  "Len": 5,
  "qa": 5,
  "section": 5,
  "mpa": 5,
  "replace": 5,
  "dis1": 5,
  "dis2": 5,
  "chest\\n": 5,
  "biceps\\n": 5,
  "cumple": 5,
  "MaxNum": 5,
  "cmin": 5,
  "prep": 5,
  "bnt": 5,
  "band": 5,
  "s80": 5,
  "insertion": 5,
  "inputLength": 5,
  "er": 5,
  "today": 5,
  "firstdata": 5,
  "seconddata": 5,
  "ans_len": 5,
  "endpos": 5,
  "2000010": 5,
  "wb": 5,
  "differentSocks": 5,
  "alr": 5,
  "resa": 5,
  "sett": 5,
  "asdfghjkl;": 5,
  "waysCount": 5,
  "cB": 5,
  "r0": 5,
  "O-": 5,
  "maxv": 5,
  "checks": 5,
  "mv": 5,
  "numOfTestCases": 5,
  "snake": 5,
  "g2": 5,
  "modi": 5,
  "READ": 5,
  "OUTPUT": 5,
  "INPUT": 5,
  "size_n": 5,
  "mmin": 5,
  "nothing": 5,
  "3432": 5,
  "924": 5,
  "12870": 5,
  "48620": 5,
  "WINS\\n": 5,
  "exclusive": 5,
  "HIM": 5,
  "LONG_MAX": 5,
  "cmd": 5,
  "tot2": 5,
  "buf": 5,
  "chess": 5,
  "VI4": 5,
  "VI3": 5,
  "VI2": 5,
  "VI": 5,
  "angle": 5,
  "ori": 5,
  "1000000005": 5,
  "inve": 5,
  "|D|)\\n": 5,
  "|.|)\\n": 5,
  "s.\\n": 5,
  "Pi": 5,
  "expo": 5,
  "arra": 5,
  "impossible\\n": 5,
  "sumz": 5,
  "sumy": 5,
  "sumx": 5,
  "0.25": 5,
  "dsa": 5,
  "aeiou13579": 5,
  "2.": 5,
  "getint": 5,
  "Bn": 5,
  "0123456789": 5,
  "1/1\\n": 5,
  "mishka": 5,
  "605": 5,
  "ep": 5,
  "6789TJQKA": 5,
  "2222": 5,
  "get_num": 5,
  "evaluate": 5,
  "marks": 5,
  "divisors": 5,
  "min_max": 5,
  "null": 5,
  "lx": 5,
  "inverse": 5,
  "norm": 5,
  "generate": 5,
  "nu": 5,
  "des": 5,
  "countt": 5,
  "oi": 5,
  "difference1": 5,
  "maxrow": 5,
  "total1": 5,
  "total2": 5,
  "maxid": 5,
  "output_arr": 5,
  "max_row": 5,
  "max_r": 5,
  "rowindex": 5,
  "sot": 5,
  "rcr": 5,
  "g_x": 5,
  "f_x": 5,
  "give_area": 5,
  "discs": 5,
  "ext": 5,
  "no2": 5,
  "bino": 5,
  "movehanoi": 5,
  "suma1": 5,
  "sumb1": 5,
  "subset_sum": 5,
  "lim_i": 5,
  "sumcheck": 5,
  "len_sub": 5,
  "fcn": 5,
  "area1": 5,
  "heaps": 5,
  "'b[j]": 5,
  "takeinput": 5,
  "cumulative_sum": 5,
  "sum_number": 5,
  "targetCount": 5,
  "IndicesTarget": 5,
  "bar2": 5,
  "bar1": 5,
  "value_check": 5,
  "isSubsetSum": 5,
  "dergree": 5,
  "mat1": 5,
  "N3": 5,
  "fib_num": 5,
  "lenth": 5,
  "sc2": 5,
  "sa1": 5,
  "sa2": 5,
  "sc1": 5,
  "a_end": 5,
  "b_mid": 5,
  "b_end": 5,
  "c_mid": 5,
  "a_mid": 5,
  "c_end": 5,
  "b_final": 5,
  "c_final": 5,
  "a_final": 5,
  "countarr": 5,
  "sp1": 5,
  "sp2": 5,
