{
  "print": 13419,
  "read": 13026,
  "=": 12750,
  "to": 11969,
  ",": 11839,
  "if": 11564,
  "0": 11449,
  "1": 10366,
  "and": 10136,
  "n": 9863,
  "i": 9806,
  "is": 9734,
  "for": 9532,
  "a": 8354,
  "of": 8134,
  "-": 7890,
  "[": 7652,
  "]": 7649,
  "+": 7286,
  "integer": 7073,
  "else": 7071,
  "with": 6633,
  "exclusive": 6267,
  "set": 6070,
  "create": 5767,
  ")": 5753,
  "(": 5751,
  "integers": 5661,
  "increment": 5200,
  "2": 4920,
  "array": 4495,
  "than": 4280,
  "size": 4251,
  "by": 4077,
  "*": 4024,
  "the": 3957,
  "int": 3929,
  "declare": 3920,
  "while": 3693,
  "\"": 3633,
  "/": 3595,
  "equal": 3529,
  "newline": 3511,
  "b": 3400,
  "j": 3332,
  "from": 3252,
  "long": 3239,
  "s": 3127,
  "new": 3079,
  "let": 3016,
  "string": 3007,
  "greater": 2925,
  "k": 2908,
  "x": 2893,
  "loop": 2810,
  "inclusive": 2805,
  "m": 2803,
  "be": 2689,
  "value": 2652,
  "less": 2559,
  "or": 2498,
  "ans": 2469,
  "c": 2334,
  "not": 2282,
  "'": 2246,
  ">": 2212,
  "<": 2086,
  "line": 2042,
  "length": 1922,
  "input": 1834,
  "NO": 1781,
  "in": 1755,
  "YES": 1752,
  "true": 1684,
  "decrement": 1641,
  "t": 1610,
  "return": 1588,
  "3": 1577,
  "%": 1576,
  "function": 1555,
  "then": 1534,
  "y": 1400,
  "assign": 1394,
  "variable": 1375,
  "break": 1306,
  "sum": 1263,
  "increase": 1236,
  "10": 1229,
  "modulo": 1227,
  "\\": 1221,
  "add": 1220,
  "do": 1202,
  "5": 1198,
  "l": 1164,
  "change": 1123,
  "d": 1117,
  "elements": 1106,
  ".": 1103,
  "4": 1094,
  "ints": 1062,
  "sort": 1052,
  "into": 984,
  "r": 984,
  "vector": 977,
  "character": 968,
  "min": 940,
  "output": 938,
  "p": 937,
  "false": 932,
  "!": 912,
  "following": 911,
  "max": 877,
  "constant": 867,
  "an": 865,
  "one": 861,
  "strings": 827,
  "incrementing": 825,
  "as": 819,
  "variables": 801,
  "cnt": 796,
  "7": 794,
  "end": 742,
  "longs": 739,
  "boolean": 724,
  "v": 705,
  "mod": 695,
  "values": 693,
  "arguments": 675,
  "standard": 665,
  "returning": 628,
  "char": 621,
  "arr": 618,
  "result": 615,
  "Read": 583,
  "flag": 548,
  "called": 548,
  "f": 546,
  "arrays": 545,
  "element": 534,
  "count": 516,
  "start": 511,
  "argument": 509,
  "100": 508,
  "N": 504,
  "z": 503,
  "are": 499,
  "that": 470,
  "q": 469,
  "res": 463,
  "2d": 457,
  "even": 451,
  "user": 448,
  "at": 445,
  "call": 444,
  "minimum": 441,
  "decrease": 440,
  "make": 440,
  "bool": 440,
  "6": 435,
  "first": 428,
  "run": 425,
  "8": 423,
  "temp": 418,
  "num": 413,
  "returns": 413,
  "absolute": 413,
  "equals": 409,
  "1e9": 404,
  "A": 399,
  "characters": 399,
  "&": 396,
  "map": 394,
  "define": 392,
  "const": 390,
  "it": 387,
  "maximum": 380,
  "stop": 379,
  "decrementing": 369,
  "maxn": 365,
  "9": 359,
  "otherwise": 357,
  "D": 352,
  "str": 348,
  "105": 347,
  "insert": 345,
  "abs": 340,
  "R": 339,
  "h": 332,
  "1000": 330,
  "void": 330,
  "all": 328,
  "double": 323,
  "s1": 321,
  "w": 312,
  "each": 311,
  "name": 311,
  "on": 310,
  "e": 302,
  "L": 295,
  "len": 294,
  "continue": 293,
  "{": 276,
  "INF": 274,
  "iteration": 274,
  "s2": 273,
  "}": 271,
  "g": 267,
  "index": 263,
  "push": 259,
  "gcd": 259,
  "reading": 254,
  "taking": 253,
  "u": 252,
  "odd": 249,
  "subtract": 242,
  "where": 238,
  "append": 233,
  "101": 228,
  "#": 228,
  "B": 226,
  "o": 221,
  "divide": 220,
  "M": 217,
  "26": 213,
  "between": 212,
  "0x3f3f3f3f": 212,
  "times": 210,
  "1e5": 206,
  "truthy": 205,
  "tmp": 199,
  "|": 199,
  "takes": 197,
  "ch": 197,
  "pointer": 195,
  "S": 195,
  ";": 194,
  "mx": 193,
  "different": 189,
  "bitwise": 187,
  "x1": 186,
  "no": 185,
  "swap": 184,
  "MOD": 183,
  "20": 183,
  "both": 180,
  "get": 179,
  ":": 178,
  "beginning": 175,
  "U": 175,
  "bytes": 172,
  "inf": 169,
  "solve": 169,
  "remove": 167,
  "x2": 166,
  "exit": 164,
  "15": 163,
  "^": 162,
  "down": 161,
  "T": 161,
  "empty": 157,
  "No": 157,
  "t1": 156,
  "110": 156,
  "12": 154,
  "1000000007": 153,
  "Yes": 152,
  "show": 151,
  "st": 151,
  "mp": 151,
  "display": 151,
  "last": 149,
  "check": 149,
  "1005": 145,
  "t2": 145,
  "?": 144,
  "100005": 143,
  "dp": 142,
  "right": 141,
  "initialized": 139,
  "two": 139,
  "y1": 139,
  "next": 138,
  "second": 136,
  "casted": 136,
  "space": 135,
  "30": 132,
  "100000": 131,
  "c1": 131,
  "mn": 130,
  "y2": 130,
  "C": 130,
  "reverse": 129,
  "v1": 127,
  "Friendship": 126,
  "begin": 124,
  "sizeof": 124,
  "11": 124,
  "further": 124,
  "cin": 121,
  "25": 121,
  "INT_MAX": 118,
  "left": 118,
  "filled": 116,
  "vis": 114,
  "MAX": 113,
  "order": 112,
  "K": 111,
  "multiple": 110,
  "substring": 110,
  "sum1": 110,
  "pos": 110,
  "c2": 108,
  "1e": 103,
  "multiply": 103,
  "ok": 102,
  "back": 101,
  "can": 101,
  "zero": 100,
  "endline": 100,
  "decremented": 99,
  "position": 98,
  "looping": 98,
  "W": 98,
  "MAXN": 98,
  "1e6": 97,
  "1001": 97,
  "square": 97,
  "total": 96,
  "iterator": 96,
  "root": 96,
  "sum2": 95,
  "ar": 93,
  "ss": 93,
  "current": 93,
  "50": 92,
  "10000": 91,
  "n1": 90,
  "200": 90,
  "starting": 89,
  "a1": 89,
  "accepts": 88,
  "mid": 88,
  "60": 88,
  "n2": 87,
  "unsigned": 86,
  "using": 85,
  "cur": 85,
  "PI": 84,
  "go": 84,
  "sqrt": 84,
  "First": 84,
  "acos": 83,
  "Second": 83,
  "pair": 82,
  "up": 82,
  "which": 81,
  "inline": 81,
  "p2": 81,
  "maxx": 81,
  "out": 80,
  "bitshift": 80,
  "p1": 80,
  "360": 80,
  "iterate": 79,
  "__gcd": 79,
  "O": 79,
  "plus": 78,
  "I": 78,
  "val": 77,
  "dimensional": 77,
  "top": 77,
  "chars": 77,
  "vectors": 77,
  "sizes": 76,
  "stream": 75,
  "rest": 75,
  "clear": 75,
  "100001": 73,
  "isn": 73,
  "pi": 72,
  "1LL": 72,
  "G": 72,
  "skip": 72,
  "55": 71,
  "ascending": 71,
  "now": 71,
  "48": 71,
  "180": 71,
  "erase": 70,
  "dx": 70,
  "dy": 70,
  "counter": 70,
  "Q": 70,
  "dfs": 69,
  "unique": 69,
  "number": 68,
  "v2": 68,
  "ret": 67,
  "ans1": 67,
  "keep": 67,
  "through": 66,
  "statement": 66,
  "rows": 66,
  "stdout": 65,
  "booleans": 65,
  "32": 65,
  "1000000": 64,
  "memset": 63,
  "power": 63,
  "tot": 62,
  "a2": 62,
  "SEGMENT": 62,
  "IMPOSSIBLE": 62,
  "TRIANGLE": 62,
  "until": 61,
  "divided": 61,
  "100010": 61,
  "ans2": 61,
  "infinite": 61,
  "EPS": 60,
  "columns": 59,
  "find": 59,
  "prime": 59,
  "ith": 59,
  "after": 58,
  "97": 58,
  "minn": 57,
  "remainder": 57,
  "k1": 57,
  "V": 56,
  "2e5": 56,
  "setting": 56,
  "counting": 56,
  "13": 55,
  "1010": 54,
  "getchar": 54,
  "lower": 54,
  "time": 54,
  "strlen": 54,
  "row": 53,
  "Terminate": 53,
  "X": 53,
  "OR": 53,
  "200005": 53,
  "xx": 53,
  "nothing": 52,
  "1e18": 52,
  "contents": 52,
  "does": 52,
  "998244353": 52,
  "p3": 52,
  "1000000000": 51,
  "queue": 51,
  "my": 51,
  "Mahmoud": 51,
  "Ehab": 51,
  "Chris": 51,
  "Mishka": 51,
  "ceil": 50,
  "b1": 50,
  "cont": 50,
  "maxi": 50,
  "lcm": 50,
  "k2": 50,
  "magic": 50,
  "eps": 49,
  "cmp": 48,
  "type": 48,
  "minus": 48,
  "pre": 48,
  "bit": 48,
  "digit": 48,
  "31": 48,
  "Malvika": 48,
  "Akshat": 48,
  "s3": 47,
  "fixed": 47,
  "Z": 47,
  "2e9": 47,
  "Time": 47,
  "man": 47,
  "ma": 46,
  "vec": 46,
  "Y": 46,
  "Correct": 46,
  "shift": 45,
  "precision": 45,
  "Anton": 45,
  "v0": 45,
  "answer": 44,
  "rat": 44,
  "RU": 44,
  "Danik": 44,
  "np": 44,
  "nl": 44,
  "pow": 43,
  "cout": 43,
  "fill": 43,
  "250": 43,
  "RD": 43,
  "LD": 43,
  "LU": 43,
  "changing": 42,
  "col": 42,
  "P": 42,
  "500": 42,
  "init": 42,
  "child": 42,
  "woman": 42,
  "case": 41,
  "blue": 41,
  "red": 41,
  "HER": 41,
  "WITH": 41,
  "HIM": 41,
  "CHAT": 41,
  "IGNORE": 41,
  "keyboard": 41,
  "pop": 40,
  "valid": 40,
  "uneven": 40,
  "respectively": 40,
  "F": 40,
  "reference": 40,
  "initialize": 40,
  "squared": 40,
  "Power": 40,
  "front": 39,
  "base": 39,
  "Vasya": 39,
  "d1": 39,
  "green": 39,
  "1000005": 39,
  "chest": 39,
  "biceps": 39,
  "Soul": 39,
  "Space": 39,
  "Mind": 39,
  "Reality": 39,
  "Karen": 39,
  "push_back": 38,
  "mini": 38,
  "cnt1": 38,
  "Tie": 38,
  "Misha": 38,
  "max1": 38,
  "27": 38,
  "invoke": 38,
  "Oh": 38,
  "become": 38,
  "guy": 38,
  "items": 37,
  "cost": 37,
  "aux": 37,
  "rounded": 37,
  "letter": 37,
  "file": 37,
  "2005": 37,
  "102": 37,
  "step": 37,
  "mi": 36,
  "aa": 36,
  "increasing": 36,
  "cnt2": 36,
  "doubles": 36,
  "matrix": 36,
  "reset": 35,
  "stack": 35,
  "round": 35,
  "prev": 35,
  "store": 35,
  "mark": 35,
  "id": 35,
  "l1": 35,
  "put": 35,
  "28": 35,
  "b2": 35,
  "INT_MIN": 35,
  "captain": 35,
  "Rajesh": 35,
  "Sheldon": 35,
  "Penny": 35,
  "Leonard": 35,
  "Howard": 35,
  "Black": 35,
  "White": 35,
  "86400": 35,
  "float": 34,
  "returned": 34,
  "move": 34,
  "calling": 34,
  "Color": 34,
  "51": 33,
  "compare": 33,
  "address": 33,
  "item": 33,
  "num1": 33,
  "decreasing": 33,
  "a3": 33,
  "H": 33,
  "substr": 33,
  "upper": 33,
  "d2": 33,
  "10005": 33,
  "orange": 33,
  "ct": 32,
  "num2": 32,
  "falsy": 32,
  "rem": 32,
  "fast": 32,
  "home": 32,
  "LEFT": 32,
  "RIGHT": 32,
  "PRINT": 32,
  "yellow": 32,
  "UP": 32,
  "DOWN": 32,
  "1e3": 31,
  "th": 31,
  "multiplied": 31,
  "bits": 31,
  "count1": 31,
  "l2": 31,
  "isPrime": 31,
  "t3": 31,
  "OO": 31,
  "yy": 31,
  "240": 31,
  "purple": 31,
  "positive": 30,
  "ara": 30,
  "str1": 30,
  "sz": 30,
  "write": 30,
  "data": 30,
  "m1": 30,
  "64": 30,
  "ind": 30,
  "OOOO": 30,
  "Tetrahedron": 30,
  "Cube": 30,
  "Octahedron": 30,
  "Dodecahedron": 30,
  "Alice": 30,
  "curr": 29,
  "str2": 29,
  "120": 29,
  "21": 29,
  "f1": 29,
  "acosign": 29,
  "containing": 29,
  "point": 29,
  "proceed": 29,
  "mm": 29,
  "WINS": 29,
  "TIE": 29,
  "TEAM": 29,
  "diff": 29,
  "its": 29,
  "rock": 29,
  "Bob": 29,
  "200000": 28,
  "nonzero": 28,
  "tt": 28,
  "method": 28,
  "args": 28,
  "idx": 28,
  "form": 28,
  "judge": 28,
  "cek": 28,
  "Max": 28,
  "paper": 28,
  "scissors": 28,
  "test": 27,
  "flag1": 27,
  "2000": 27,
  "22": 27,
  "freq": 27,
  "fa": 27,
  "isprime": 27,
  "found": 27,
  "kol": 27,
  "contest": 27,
  "day": 26,
  "width": 26,
  "nn": 26,
  "place": 26,
  "35": 26,
  "txt": 26,
  "UR": 26,
  "contains": 26,
  "16": 26,
  "three": 26,
  "win": 26,
  "tc": 26,
  "having": 26,
  "h1": 26,
  "Icosahedron": 26,
  "love": 26,
  "hate": 26,
  "10000000": 25,
  "adding": 25,
  "open": 25,
  "decimal": 25,
  "pairs": 25,
  "f2": 25,
  "DL": 25,
  "yes": 25,
  "r2": 25,
  "r1": 25,
  "Dasha": 25,
  "Equal": 25,
  "Masha": 25,
  "co": 24,
  "1000000009": 24,
  "temp2": 24,
  "cast": 24,
  "used": 24,
  "cc": 24,
  "word": 24,
  "min1": 24,
  "Incorrect": 24,
  "resize": 23,
  "ii": 23,
  "bb": 23,
  "temp1": 23,
  "same": 23,
  "endl": 23,
  "flag2": 23,
  "more": 23,
  "lowercase": 23,
  "puts": 23,
  "arr1": 23,
  "arr2": 23,
  "dist": 23,
  "bigger": 23,
  "priority_queue": 23,
  "400": 23,
  "Too": 23,
  "weak": 23,
  "GOTO": 23,
  "zxcvbnm": 23,
  "program": 22,
  "0LL": 22,
  "sign": 22,
  "inlined": 22,
  "200001": 22,
  "m2": 22,
  "sieve": 22,
  "negative": 22,
  "29": 22,
  "execute": 22,
  "infinitely": 22,
  "18": 22,
  "div": 22,
  "u2": 22,
  "u1": 22,
  "inp": 22,
  "205": 22,
  "Still": 22,
  "Rozdil": 22,
  "24": 22,
  "Vasilisa": 22,
  "OOO": 22,
  "price": 21,
  "123": 21,
  "size_t": 21,
  "1e8": 21,
  "code": 21,
  "DR": 21,
  "UL": 21,
  "200010": 21,
  "there": 21,
  "oo": 21,
  "pointers": 21,
  "65": 21,
  "150": 21,
  "2001": 21,
  "modulus": 21,
  "96": 21,
  "undefined": 21,
  "se": 20,
  "TESTS": 20,
  "suma": 20,
  "re": 20,
  "tb": 20,
  "ta": 20,
  "incremented": 20,
  "tolower": 20,
  "b3": 20,
  "Nikita": 20,
  "Olya": 20,
  "Slava": 20,
  "Ann": 20,
  "Danil": 20,
  "122": 20,
  "every": 20,
  "qwertyuiopasdfghjkl": 20,
  "HARD": 20,
  "EASY": 20,
  "cw": 20,
  "ccw": 20,
  "dis": 19,
  "discard": 19,
  "300": 19,
  "them": 19,
  "xor": 19,
  "least": 19,
  "fabs": 19,
  "Impossible": 19,
  "h2": 19,
  "dif": 19,
  "op": 19,
  "Hanako": 19,
  "Ciel": 19,
  "s4": 18,
  "printing": 18,
  "Set": 18,
  "ff": 18,
  "book": 18,
  "gets": 18,
  "pq": 18,
  "mat": 18,
  "key": 18,
  "3e5": 18,
  "max_element": 18,
  "ex": 18,
  "fb": 18,
  "vv": 18,
  "jth": 18,
  "impossible": 18,
  "1000001": 17,
  "invert": 17,
  "305": 17,
  "i1": 17,
  "1000010": 17,
  "stdin": 17,
  "copy": 17,
  "sol": 17,
  "If": 17,
  "ULDR": 17,
  "c3": 17,
  "1ll": 17,
  "19": 17,
  "hi": 17,
  "reduce": 17,
  "5005": 17,
  "count2": 17,
  "color": 17,
  "x3": 17,
  "fo": 17,
  "points": 17,
  "condition": 17,
  "uppercase": 17,
  "without": 17,
  "1e2": 17,
  "kk": 17,
  "half": 16,
  "MX": 16,
  "exadecimal": 16,
  "days": 16,
  "pointed": 16,
  "5000": 16,
  "assigning": 16,
  "stringstream": 16,
  "register": 16,
  "shifted": 16,
  "largest": 16,
  "Output": 16,
  "pr": 16,
  "short": 16,
  "coun": 16,
  "maxm": 16,
  "1e4": 16,
  "toupper": 16,
  "decreased": 16,
  "201": 16,
  "myset": 16,
  "14": 16,
  "Koyomi": 16,
  "brr": 15,
  "adj": 15,
  "3f3f3f3f": 15,
  "make_pair": 15,
  "Create": 15,
  "ri": 15,
  "lo": 15,
  "sum3": 15,
  "vowel": 15,
  "111": 15,
  "score": 15,
  "minx": 15,
  "primes": 15,
  "501": 15,
  "hello": 15,
  "need": 14,
  "100100": 14,
  "1e10": 14,
  "visit": 14,
  "label": 14,
  "has": 14,
  "jj": 14,
  "match": 14,
  "high": 14,
  "low": 14,
  "tp": 14,
  "2147483647": 14,
  "9999999": 14,
  "other": 14,
  "getline": 14,
  "0th": 14,
  "1000006": 14,
  "fact": 14,
  "10010": 14,
  "md": 14,
  "ck": 14,
  "best": 14,
  "23": 14,
  "90": 14,
  "fun": 14,
  "maps": 14,
  "1st": 14,
  "999999": 14,
  "cal": 14,
  "1000003": 14,
  "J": 14,
  "non": 13,
  "MIN": 13,
  "ele": 13,
  "Input": 13,
  "sub": 13,
  "iterations": 13,
  "null": 13,
  "en": 13,
  "ifstream": 13,
  "br": 13,
  "res1": 13,
  "exp": 13,
  "noop": 13,
  "resp": 13,
  "5001": 13,
  "MN": 13,
  "rad": 13,
  "ctr": 13,
  "fl": 13,
  "lim": 13,
  "Min": 13,
  "hh": 13,
  "most": 13,
  "ada": 13,
  "100000000": 13,
  "99999999": 13,
  "ql": 13,
  "qr": 13,
  "comparator": 12,
  "10001": 12,
  "int64_t": 12,
  "i2": 12,
  "inputs": 12,
  "tem": 12,
  "mode": 12,
  "default": 12,
  "17": 12,
  "good": 12,
  "sumb": 12,
  "x3f3f3f3f": 12,
  "smaller": 12,
  "any": 12,
  "dir": 12,
  "con": 12,
  "ms": 12,
  "max2": 12,
  "w1": 12,
  "w2": 12,
  "bs": 12,
  "sb": 12,
  "over": 12,
  "1e7": 12,
  "99": 12,
  "min_element": 12,
  "capital": 12,
  "leave": 12,
  "1002": 12,
  "999999999": 12,
  "bl": 12,
  "2e6": 12,
  "ai": 12,
  "bfs": 12,
  "visited": 12,
  "cn": 12,
  "cs": 12,
  "priority": 12,
  "take": 12,
  "next_permutation": 12,
  "210": 12,
  "100007": 12,
  "error": 12,
  "dem": 12,
  "min2": 12,
  "distance": 11,
  "mul": 11,
  "52": 11,
  "sm": 11,
  "convert": 11,
  "ac": 11,
  "ls": 11,
  "1100": 11,
  "nums": 11,
  "contain": 11,
  "indefinitely": 11,
  "An": 11,
  "poww": 11,
  "numbers": 11,
  "table": 11,
  "inner": 11,
  "E": 11,
  "ignore": 11,
  "fi": 11,
  "103": 11,
  "100009": 11,
  "tm": 11,
  "big": 11,
  "Otherwise": 11,
  "dimension": 11,
  "ed": 11,
  "going": 11,
  "1111": 11,
  "ch1": 11,
  "sets": 11,
  "sy": 11,
  "sx": 11,
  "600": 11,
  "infinity": 11,
  "joy": 11,
  "max3": 11,
  "p4": 11,
  "999": 10,
  "128": 10,
  "maxN": 10,
  "setprecision": 10,
  "20000": 10,
  "counts": 10,
  "Solve": 10,
  "ad": 10,
  "this": 10,
  "multiplying": 10,
  "li": 10,
  "followed": 10,
  "2002": 10,
  "res2": 10,
  "calc": 10,
  "large": 10,
  "tmp1": 10,
  "GCD": 10,
  "5e5": 10,
  "grid": 10,
  "winner": 10,
  "jump": 10,
  "1000000001": 10,
  "smallest": 10,
  "duplicates": 10,
  "board": 10,
  "zeroes": 10,
  "deque": 10,
  "upper_bound": 10,
  "was": 10,
  "40": 10,
  "clock": 10,
  "QAQ": 10,
  "ch2": 10,
  "itr": 10,
  "mult": 10,
  "moves": 10,
  "pass": 10,
  "220": 10,
  "byte": 9,
  "dc": 9,
  "flg": 9,
  "v3": 9,
  "lol": 9,
  "fin": 9,
  "na": 9,
  "ca": 9,
  "_": 9,
  "mas": 9,
  "floor": 9,
  "notation": 9,
  "pp": 9,
  "tmp2": 9,
  "present": 9,
  "gr": 9,
  "iter": 9,
  "acef": 9,
  "bools": 9,
  "ll": 9,
  "itself": 9,
  "content": 9,
  "00": 9,
  "ti": 9,
  "fuel": 9,
  "2e3": 9,
  "terminate": 9,
  "qpow": 9,
  "3000": 9,
  "forward": 9,
  "save": 9,
  "bitset": 9,
  "Arr": 9,
  "delete": 9,
  "cou": 9,
  "2nd": 9,
  "prepend": 9,
  "maxa": 9,
  "month": 9,
  "raised": 9,
  "ios": 9,
  "mo": 9,
  "505": 9,
  "100002": 9,
  "36": 9,
  "max_i": 9,
  "year": 8,
  "dr": 8,
  "but": 8,
  "47": 8,
  "1e15": 8,
  "binary": 8,
  "initial": 8,
  "sc": 8,
  "ln": 8,
  "LINF": 8,
  "rs": 8,
  "nb": 8,
  "format": 8,
  "0x7fffffff": 8,
  "100004": 8,
  "floats": 8,
  "sa": 8,
  "getInt": 8,
  "tam": 8,
  "freopen": 8,
  "colors": 8,
  "isdigit": 8,
  "npos": 8,
  "inv": 8,
  "INFF": 8,
  "1000000000000000005LL": 8,
  "lena": 8,
  "modd": 8,
  "lucky": 8,
  "LLONG_MAX": 8,
  "med": 8,
  "9223372036854775807LL": 8,
  "work": 8,
  "gap": 8,
  "greatest": 8,
  "head": 8,
  "list": 8,
  "game": 8,
  "n3": 8,
  "q1": 8,
  "excluisve": 8,
  "iterating": 8,
  "comparison": 8,
  "limit": 8,
  "81": 8,
  "val1": 8,
  "val2": 8,
  "pos1": 8,
  "goto": 8,
  "300005": 8,
  "200100": 8,
  "addresses": 8,
  "assigned": 8,
  "2LL": 8,
  "144": 8,
  "dd": 8,
  "turn": 8,
  "desperate_optimization": 8,
  "num3": 8,
  "words": 8,
  "asd": 8,
  "isalpha": 8,
  "LCM": 8,
  "cp": 8,
  "names": 8,
  "80": 8,
  "steps": 8,
  "lca": 8,
  "min_i": 8,
  "min_j": 8,
  "max_j": 8,
  "semicolumn": 7,
  "2000000000": 7,
  "node": 7,
  "30010": 7,
  "62": 7,
  "part": 7,
  "being": 7,
  "57": 7,
  "max_n": 7,
  "static": 7,
  "log2": 7,
  "aux1": 7,
  "aux2": 7,
  "rec": 7,
  "dig": 7,
  "tr": 7,
  "third": 7,
  "send": 7,
  "they": 7,
  "256": 7,
  "la": 7,
  "interger": 7,
  "when": 7,
  "amount": 7,
  "seed": 7,
  "speed": 7,
  "qq": 7,
  "incremen": 7,
  "File": 7,
  "1007": 7,
  "gl": 7,
  "arg": 7,
  "gg": 7,
  "mymap": 7,
  "9999999999": 7,
  "alphabetical": 7,
  "descending": 7,
  "ofstream": 7,
  "signed": 7,
  "fast_exp": 7,
  "ts": 7,
  "tab": 7,
  "lenb": 7,
  "S1": 7,
  "always": 7,
  "seq": 7,
  "2010": 7,
  "nx": 7,
  "1500": 7,
  "req": 7,
  "Ans": 7,
  "cap": 7,
  "intergers": 7,
  "cd": 7,
  "memory": 7,
  "process": 7,
  "palindrome": 7,
  "lenght": 7,
  "summ": 7,
  "sumc": 7,
  "fastIo": 7,
  "dep": 7,
  "par": 7,
  "graph": 7,
  "P2": 7,
  "P3": 7,
  "T1": 7,
  "T2": 7,
  "P1": 7,
  "ax": 7,
  "Count": 7,
  "fix": 7,
  "letters": 7,
  "zz": 7,
  "cx": 7,
  "cy": 7,
  "men": 7,
  "either": 7,
  "status": 7,
  "j1": 7,
  "isupper": 7,
  "le": 7,
  "si": 7,
  "pos2": 7,
  "powmod": 7,
  "63": 7,
  "possible": 7,
  "larger": 7,
  "sumr": 7,
  "exist": 7,
  "sp": 7,
  "hitung": 7,
  "10000000000": 7,
  "pl": 7,
  "rx": 7,
  "104": 7,
  "pwr": 7,
  "14159": 7,
  "time1": 7,
  "time2": 7,
  "min3": 7,
  "factorial": 7,
  "indices": 7,
  "nCr": 7,
  "prealoc": 7,
  "a8": 7,
  "h8": 7,
  "ki": 7,
  "aj": 7,
  "imax": 6,
  "consecutive": 6,
  "money": 6,
  "prices": 6,
  "sequential": 6,
  "depth": 6,
  "30005": 6,
  "str3": 6,
  "rep": 6,
  "MAX2": 6,
  "nex": 6,
  "pritn": 6,
  "column": 6,
  "var": 6,
  "quotient": 6,
  "blank": 6,
  "300000": 6,
  "done": 6,
  "rotate": 6,
  "ant": 6,
  "intege": 6,
  "witn": 6,
  "fir": 6,
  "putchar": 6,
  "vs": 6,
  "mxm": 6,
  "mmax": 6,
  "am": 6,
  "beat": 6,
  "500000": 6,
  "lowest": 6,
  "100011": 6,
  "doit": 6,
  "1000000000000": 6,
  "floating": 6,
  "lt": 6,
  "MAX_N": 6,
  "isVowel": 6,
  "we": 6,
  "252": 6,
  "70": 6,
  "9999": 6,
  "rr": 6,
  "debug": 6,
  "abcdefghijklmnopqrstuvwxyz": 6,
  "fpow": 6,
  "comp": 6,
  "so": 6,
  "0x3f": 6,
  "cot": 6,
  "hash": 6,
  "divisible": 6,
  "bt": 6,
  "is_prime": 6,
  "shu": 6,
  "votes": 6,
  "14159265359": 6,
  "ny": 6,
  "cup": 6,
  "ceiling": 6,
  "nd": 6,
  "ds": 6,
  "den": 6,
  "lower_bound": 6,
  "ver": 6,
  "level": 6,
  "palin": 6,
  "outer": 6,
  "esclusive": 6,
  "alpha": 6,
  "99999": 6,
  "S2": 6,
  "final": 6,
  "ty": 6,
  "till": 6,
  "z1": 6,
  "10000005": 6,
  "divisor": 6,
  "biggest": 6,
  "range": 6,
  "crate": 6,
  "maxy": 6,
  "y3": 6,
  "1000000005": 6,
  "rbegin": 6,
  "bigmod": 6,
  "del": 6,
  "menor": 6,
  "4th": 6,
  "3rd": 6,
  "tx": 6,
  "bi": 6,
  "maxs": 6,
  "hasil": 6,
  "divides": 6,
  "previous": 6,
  "log": 6,
  "xay": 6,
  "maxcnt": 6,
  "ml": 6,
  "sq": 6,
  "mx1": 6,
  "1000000007LL": 6,
  "lon": 6,
  "digits": 6,
  "301": 6,
  "ry": 6,
  "cm": 6,
  "107": 6,
  "1111111": 6,
  "0000000": 6,
  "levels": 6,
  "salt": 6,
  "tri": 6,
  "computer": 6,
  "WBWBWBWB": 6,
  "BWBWBWBW": 6,
  "plen": 6,
  "sup": 5,
  "strictly": 5,
  "before": 5,
  "DFS": 5,
  "Mod": 5,
  "arc": 5,
  "cosine": 5,
  "modi": 5,
  "READ": 5,
  "OUTPUT": 5,
  "INPUT": 5,
  "remaining": 5,
  "size_n": 5,
  "lc": 5,
  "ab": 5,
  "cnta": 5,
  "sw": 5,
  "95": 5,
  "len1": 5,
  "len2": 5,
  "c4": 5,
  "converted": 5,
  "misha": 5,
  "mmin": 5,
  "concatenated": 5,
  "single": 5,
  "Declare": 5,
  "MAXM": 5,
  "siz": 5,
  "integral": 5,
  "es": 5,
  "pd": 5,
  "3432": 5,
  "924": 5,
  "12870": 5,
  "48620": 5,
  "within": 5,
  "resulf": 5,
  "1e12": 5,
  "duplicate": 5,
  "parameters": 5,
  "assert": 5,
  "reads": 5,
  "100050": 5,
  "ap": 5,
  "father": 5,
  "bk": 5,
  "index1": 5,
  "LONG_MAX": 5,
  "mask": 5,
  "ones": 5,
  "neither": 5,
  "transform": 5,
  "strcmp": 5,
  "bc": 5,
  "5000000": 5,
  "sumA": 5,
  "solution": 5,
  "global": 5,
  "decalre": 5,
  "ya": 5,
  "1000007": 5,
  "cmd": 5,
  "tot2": 5,
  "tot1": 5,
  "choose": 5,
  "boostIO": 5,
  "mt": 5,
  "exists": 5,
  "entered": 5,
  "ar1": 5,
  "inclusve": 5,
  "use": 5,
  "buf": 5,
  "chess": 5,
  "VI4": 5,
  "VI3": 5,
  "VI2": 5,
  "VI": 5,
  "ar2": 5,
  "dimensions": 5,
  "increased": 5,
  "va": 5,
  "1003": 5,
  "angle": 5,
  "again": 5,
  "pt": 5,
  "ori": 5,
  "Let": 5,
  "islower": 5,
  "constants": 5,
  "fast_io": 5,
  "1000000010": 5,
  "2e18": 5,
  "diff2": 5,
  "01": 5,
  "inve": 5,
  "db": 5,
  "Pi": 5,
  "coins": 5,
  "fx": 5,
  "have": 5,
  "expo": 5,
  "random": 5,
  "Boolean": 5,
  "arra": 5,
  "c_str": 5,
  "record": 5,
  "lens": 5,
  "fastMax": 5,
  "fastMin": 5,
  "ne": 5,
  "act": 5,
  "0x3f3f3f3f3f3f3f3f": 5,
  "r3": 5,
  "sumz": 5,
  "sumy": 5,
  "sumx": 5,
  "imin": 5,
  "showpoint": 5,
  "CLOCKS_PER_SEC": 5,
  "dsa": 5,
  "spf": 5,
  "c0": 5,
  "3d": 5,
  "edges": 5,
  "mp1": 5,
  "_n": 5,
  "declar": 5,
  "nr": 5,
  "cols": 5,
  "getint": 5,
  "xt": 5,
  "active": 5,
  "ns": 5,
  "ans3": 5,
  "mov": 5,
  "including": 5,
  "Bn": 5,
  "MAXX": 5,
  "counta": 5,
  "a4": 5,
  "pw": 5,
  "common": 5,
  "0123456789": 5,
  "mishka": 5,
  "601": 5,
  "605": 5,
  "ep": 5,
  "su": 5,
  "2222": 5,
  "comparing": 4,
  "minP": 4,
  "buff": 4,
  "ky": 4,
  "search": 4,
  "que": 4,
  "cell": 4,
  "dest": 4,
  "added": 4,
  "places": 4,
  "1e17": 4,
  "bal": 4,
  "ft": 4,
  "sss": 4,
  "fastio": 4,
  "diry": 4,
  "dirx": 4,
  "hang": 4,
  "mk": 4,
  "cards": 4,
  "58": 4,
  "vet": 4,
  "reuse": 4,
  "carry": 4,
  "upward": 4,
  "rta": 4,
  "logarithm": 4,
  "30000": 4,
  "NULL": 4,
  "rc": 4,
  "suml": 4,
  "cb": 4,
  "cntb": 4,
  "ysum": 4,
  "xsum": 4,
  "zeroing": 4,
  "91": 4,
  "Increment": 4,
  "0x3f3f3f": 4,
  "their": 4,
  "lr": 4,
  "wt": 4,
  "vasya": 4,
  "mxv": 4,
  "maxi2": 4,
  "tims": 4,
  "poly": 4,
  "dp1": 4,
  "games": 4,
  "5e3": 4,
  "131": 4,
  "gdc": 4,
  "5050": 4,
  "fail": 4,
  "5010": 4,
  "000": 4,
  "aeiou": 4,
  "isvowel": 4,
  "marks": 4,
  "check1": 4,
  "109": 4,
  "highest": 4,
  "wa": 4,
  "gs": 4,
  "9223372036854775807": 4,
  "200009": 4,
  "99999999999": 4,
  "cha": 4,
  "alph": 4,
  "lines": 4,
  "multiset": 4,
  "_s": 4,
  "pref": 4,
  "os": 4,
  "pf": 4,
  "miny": 4,
  "four": 4,
  "1000009": 4,
  "nmax": 4,
  "numb": 4,
  "41": 4,
  "maxl": 4,
  "__builtin_popcount": 4,
  "nor": 4,
  "sumB": 4,
  "m3": 4,
  "t0": 4,
  "inputting": 4,
  "_min": 4,
  "INF_ULL": 4,
  "18446744073709551615Ull": 4,
  "INF_LL": 4,
  "Move": 4,
  "INF_INT": 4,
  "Move_": 4,
  "92540646808111039LL": 4,
  "excusive": 4,
  "el": 4,
  "Print": 4,
  "int_gcd": 4,
  "310": 4,
  "writing": 4,
  "replace": 4,
  "ys": 4,
  "sl": 4,
  "box": 4,
  "amd": 4,
  "parent": 4,
  "infint64_t": 4,
  "1440": 4,
  "posx": 4,
  "posy": 4,
  "bo": 4,
  "players": 4,
  "26th": 4,
  "AND": 4,
  "2D": 4,
  "sh": 4,
  "cnt3": 4,
  "nt": 4,
  "f3": 4,
  "512": 4,
  "sd": 4,
  "122220": 4,
  "side": 4,
  "he": 4,
  "ini": 4,
  "seive": 4,
  "ce": 4,
  "matching": 4,
  "screen": 4,
  "named": 4,
  "is_square": 4,
  "kanan": 4,
  "bisa": 4,
  "password": 4,
  "n0": 4,
  "0ll": 4,
  "kq": 4,
  "ji": 4,
  "queues": 4,
  "q2": 4,
  "Cnt": 4,
  "365": 4,
  "deg": 4,
  "mina": 4,
  "diff1": 4,
  "location": 4,
  "subtracting": 4,
  "fori": 4,
  "area": 4,
  "rend": 4,
  "MINN": 4,
  "lst": 4,
  "ong": 4,
  "k3": 4,
  "5th": 4,
  "6th": 4,
  "34": 4,
  "33": 4,
  "shit": 4,
  "off": 4,
  "generator": 4,
  "bottom": 4,
  "61": 4,
  "exclusively": 4,
  "indx": 4,
  "exlusive": 4,
  "atoi": 4,
  "casn": 4,
  "func": 4,
  "po": 4,
  "elapsed": 4,
  "substract": 4,
  "cntr": 4,
  "flase": 4,
  "444": 4,
  "bob": 4,
  "lessons": 4,
  "cad": 4,
  "arccosine": 4,
  "di": 4,
  "1000002": 4,
  "ct2": 4,
  "ct1": 4,
  "dat": 4,
  "edge": 4,
  "2000005": 4,
  "abort": 4,
  "prefix_function": 4,
  "modexp": 4,
  "getZarr": 4,
  "getFactorization": 4,
  "lj": 4,
  "aeiou13579": 4,
  "lzl": 4,
  "vl": 4,
  "mx2": 4,
  "pause": 4,
  "BBBBBBBB": 4,
  "100500": 4,
  "gcd1": 4,
  "1000000009LL": 4,
  "modx": 4,
  "whole": 4,
  "way": 4,
  "s5": 4,
  "yt": 4,
  "3e2": 4,
  "S3": 4,
  "lef": 4,
  "1009": 4,
  "14159265358979323846": 4,
  "MAXT": 4,
  "me": 4,
  "defined": 4,
  "FindLen": 4,
  "Hash": 4,
  "c5": 4,
  "aeiouy": 4,
  "main": 4,
  "contiguous": 4,
  "bewteen": 4,
  "increments": 4,
  "ref": 4,
  "inch": 4,
  "inches": 4,
  "answ": 4,
  "setf": 4,
  "wait": 4,
  "nuts": 4,
  "bj": 4,
  "cakes": 4,
  "failed": 4,
  "fy": 4,
  "ctx": 4,
  "star": 4,
  "TRUE": 4,
  "starty": 4,
  "startx": 4,
  "ey": 4,
  "pri": 4,
  "mz": 4,
  "toggle": 4,
  "11111": 4,
  "ci": 4,
  "term": 4,
  "ten": 4,
  "ogo": 4,
  "soldier": 4,
  "ev": 4,
  "gov": 4,
  "s0": 4,
  "seg": 4,
  "ye": 4,
  "Ql": 4,
  "Qr": 4,
  "chris": 4,
  "cn1": 4,
  "slen": 4,
  "denominator": 4,
  "SIZE": 4,
  "Bulbasaur": 4,
  "vest": 4,
  "conv": 4,
  "exclusie": 3,
  "weather": 3,
  "separated": 3,
  "entries": 3,
  "weight": 3,
  "dict": 3,
  "3e4": 3,
  "kx": 3,
  "30001": 3,
  "100006": 3,
  "boost": 3,
  "str4": 3,
  "af": 3,
  "lie": 3,
  "2000010": 3,
  "mxn": 3,
  "absoluve": 3,
  "_b": 3,
  "old_t": 3,
  "istringstream": 3,
  "iss": 3,
  "Init": 3,
  "Maxn": 3,
  "marked": 3,
  "fg": 3,
  "106": 3,
  "Decrement": 3,
  "integerss": 3,
  "occurances": 3,
  "ud": 3,
  "floatfield": 3,
  "iterators": 3,
  "buffer": 3,
  "nc": 3,
  "rl2": 3,
  "prog": 3,
  "loss1": 3,
  "rl1": 3,
  "loss2": 3,
  "join": 3,
  "1000100": 3,
  "dim": 3,
  "1000004": 3,
  "pa": 3,
  "lb": 3,
  "sheets": 3,
  "getans": 3,
  "te": 3,
  "decimals": 3,
  "ineger": 3,
  "prin": 3,
  "is_vowel": 3,
  "wiith": 3,
  "maxk": 3,
  "may": 3,
  "110x110": 3,
  "115": 3,
  "newlines": 3,
  "accept": 3,
  "Blue": 3,
  "momo": 3,
  "cant": 3,
  "100000000000": 3,
  "reopen": 3,
  "ara2": 3,
  "distinct": 3,
  "Sort": 3,
  "removed": 3,
  "post": 3,
  "MaxN": 3,
  "ulong": 3,
  "esle": 3,
  "wtih": 3,
  "2000001": 3,
  "creates": 3,
  "cr": 3,
  "dic": 3,
  "minm": 3,
  "fre": 3,
  "n4": 3,
  "fn": 3,
  "tmo": 3,
  "numa": 3,
  "flagA": 3,
  "except": 3,
  "indefintely": 3,
  "istrue": 3,
  "43": 3,
  "nextPrime": 3,
  "ostringstream": 3,
  "tol": 3,
  "Number": 3,
  "commands": 3,
  "index2": 3,
  "maxlen": 3,
  "carries": 3,
  "maxsum": 3,
  "extract": 3,
  "exlclusive": 3,
  "0m": 3,
  "bak": 3,
  "1004": 3,
  "ANS": 3,
  "300300": 3,
  "Call": 3,
  "Increase": 3,
  "che": 3,
  "nw": 3,
  "LONG_LONG_MAX": 3,
  "sortDes": 3,
  "mod1": 3,
  "works": 3,
  "pal": 3,
  "sum_a": 3,
  "sum_b": 3,
  "mc": 3,
  "psum": 3,
  "incement": 3,
  "maxc": 3,
  "ansx": 3,
  "fuction": 3,
  "nxt": 3,
  "tree": 3,
  "BFS": 3,
  "seen": 3,
  "leaf": 3,
  "e1": 3,
  "tp1": 3,
  "tp2": 3,
  "r0": 3,
  "parameter": 3,
  "xs": 3,
  "merge": 3,
  "spec": 3,
  "delcare": 3,
  "maxcount": 3,
  "numeric_limits": 3,
  "clo": 3,
  "Home": 3,
  "away": 3,
  "dua": 3,
  "satu": 3,
  "hj": 3,
  "ihash": 3,
  "modn": 3,
  "jumps": 3,
  "125": 3,
  "elemens": 3,
  "ats": 3,
  "lin": 3,
  "us": 3,
  "lx": 3,
  "lopp": 3,
  "crew": 3,
  "lf": 3,
  "com": 3,
  "4e7": 3,
  "ks": 3,
  "factor": 3,
  "flag3": 3,
  "da": 3,
  "sting": 3,
  "correct": 3,
  "82": 3,
  "mb": 3,
  "bills": 3,
  "gp": 3,
  "taken": 3,
  "ha": 3,
  "holds": 3,
  "361": 3,
  "`": 3,
  "rl": 3,
  "tar": 3,
  "loct": 3,
  "locg": 3,
  "termination": 3,
  "s8i": 3,
  "minb": 3,
  "functin": 3,
  "discounts": 3,
  "x0": 3,
  "bus": 3,
  "loc": 3,
  "X1": 3,
  "X2": 3,
  "yb": 3,
  "step1": 3,
  "nearest": 3,
  "choc": 3,
  "flush": 3,
  "jum": 3,
  "ba": 3,
  "ostream": 3,
  "istream": 3,
  "subtraction": 3,
  "MAX1": 3,
  "path": 3,
  "cont2": 3,
  "vi": 3,
  "ptr": 3,
  "println": 3,
  "whitespace": 3,
  "dp0": 3,
  "ways": 3,
  "z_function": 3,
  "hari": 3,
  "months": 3,
  "people": 3,
  "getNextGap": 3,
  "combSort": 3,
  "swapped": 3,
  "maks": 3,
  "mpow": 3,
  "pro": 3,
  "forever": 3,
  "nowp": 3,
  "pangkat": 3,
  "155": 3,
  "zsum": 3,
  "hn": 3,
  "hor": 3,
  "Minb": 3,
  "Mina": 3,
  "200007": 3,
  "mnm": 3,
  "block": 3,
  "modpow": 3,
  "everything": 3,
  "st2": 3,
  "contador": 3,
  "pot": 3,
  "xmax": 3,
  "normal": 3,
  "ra": 3,
  "text": 3,
  "tail": 3,
  "LIM": 3,
  "state": 3,
  "excluding": 3,
  "ntc": 3,
  "hora": 3,
  "max_num": 3,
  "fucntion": 3,
  "fj": 3,
  "ng": 3,
  "mr": 3,
  "fp": 3,
  "ansb": 3,
  "ansa": 3,
  "created": 3,
  "G1": 3,
  "ssum": 3,
  "lsum": 3,
  "dfs2": 3,
  "ro": 3,
  "asm": 3,
  "Fast_Read_Out": 3,
  "Random": 3,
  "rdtsc": 3,
  "rev": 3,
  "remains": 3,
  "x4": 3,
  "stones": 3,
  "qwertyuiop": 3,
  "asdfghjkl": 3,
  "concatenation": 3,
  "brainfuck": 3,
  "greather": 3,
  "max_": 3,
  "333": 3,
  "acc": 3,
  "oven1": 3,
  "oven2": 3,
  "ee": 3,
  "100003": 3,
  "anton": 3,
  "danik": 3,
  "59": 3,
  "sel": 3,
  "85": 3,
  "person": 3,
  "local": 3,
  "command": 3,
  "kkk": 3,
  "kpk": 3,
  "stone": 3,
  "since": 3,
  "available": 3,
  "mn1": 3,
  "mn2": 3,
  "inverse": 3,
  "mp2": 3,
  "Map": 3,
  "must": 3,
  "2007": 3,
  "Max_N": 3,
  "bord": 3,
  "_x": 3,
  "isv": 3,
  "goal": 3,
  "map1": 3,
  "rand": 3,
  "ay": 3,
  "lent": 3,
  "204": 3,
  "inter": 3,
  "slot": 3,
  "to1": 3,
  "card": 3,
  "prep": 3,
  "abc": 3,
  "biao": 3,
  "v4": 3,
  "kt": 3,
  "divis": 3,
  "1415926": 3,
  "2000000": 3,
  "cnt7": 3,
  "cnt4": 3,
  "answers": 3,
  "pv": 3,
  "getAns": 3,
  "tim": 3,
  "2e2": 3,
  "get_prime": 3,
  "isp": 3,
  "maxSize": 3,
  "maxv": 3,
  "success": 3,
  "sr": 3,
  "min_": 3,
  "od": 3,
  "49": 3,
  "csx": 3,
  "xy": 3,
  "creat": 3,
  "norm": 3,
  "xth": 3,
  "3005": 3,
  "capitalize": 3,
  "ust": 3,
  "alt": 3,
  "sag": 3,
  "ru": 3,
  "mini2": 3,
  "maxi1": 3,
  "mini1": 3,
  "extra0max": 3,
  "extra0": 3,
  "vm": 3,
  "light": 3,
  "drink": 3,
  "1011": 3,
  "remove0": 3,
  "VK": 3,
  "pushing": 3,
  "1050": 3,
  "helper": 3,
  "gc": 3,
  "ho": 3,
  "ope": 3,
  "desk": 3,
  "sums": 3,
  "_gcd": 3,
  "700": 3,
  "given": 3,
  "fpr": 3,
  "dm": 3,
  "tu": 3,
  "6789TJQKA": 3,
  "strng": 3,
  "esPrimo": 3,
  "cn2": 3,
  "find_prime": 3,
  "zzzzzzzzzzzz": 3,
  "countb": 3,
  "khong": 3,
  "OpenFile": 3,
  "Khong": 3,
  "outfile": 3,
  "infile": 3,
  "duoc": 3,
  "su2": 3,
  "rot": 3,
  "prom": 3,
  "matriz": 3,
  "custom": 2,
  "141592": 2,
  "150000": 2,
  "spaces": 2,
  "amt": 2,
  "vect": 2,
  "nu": 2,
  "linf": 2,
  "kill": 2,
  "name1": 2,
  "name2": 2,
  "1024": 2,
  "zw": 2,
  "event": 2,
  "baad": 2,
  "those": 2,
  "sf": 2,
  "divi": 2,
  "scan": 2,
  "DY": 2,
  "DX": 2,
  "150005": 2,
  "ends": 2,
  "cop": 2,
  "jw": 2,
  "0s": 2,
  "printv": 2,
  "toInt": 2,
  "fs": 2,
  "compute": 2,
  "prefix": 2,
  "30003": 2,
  "cpy": 2,
  "Size": 2,
  "dn": 2,
  "parity": 2,
  "appen": 2,
  "absolut": 2,
  "fro": 2,
  "MIN2": 2,
  "unchanged": 2,
  "dos": 2,
  "izq": 2,
  "EOF": 2,
  "sv": 2,
  "Mininum": 2,
  "shorts": 2,
  "r12": 2,
  "Minimum": 2,
  "r11": 2,
  "SP": 2,
  "SS": 2,
  "pb": 2,
  "200x200": 2,
  "pack": 2,
  "sk": 2,
  "INFL": 2,
  "dividing": 2,
  "itnegers": 2,
  "qClose": 2,
  "qmarks": 2,
  "wen": 2,
  "kh": 2,
  "rt": 2,
  "palabra": 2,
  "aeioun": 2,
  "valido": 2,
  "vocale": 2,
  "retutn": 2,
  "vowels": 2,
  "binary_search": 2,
  "is_valid": 2,
  "charcter": 2,
  "fun1": 2,
  "functoin": 2,
  "chat": 2,
  "band": 2,
  "runn": 2,
  "tabla": 2,
  "11x11": 2,
  "prnt": 2,
  "h_marks": 2,
  "9000": 2,
  "suc": 2,
  "vc": 2,
  "nas": 2,
  "maxV": 2,
  "best_score": 2,
  "wins": 2,
  "counter2": 2,
  "counter1": 2,
  "posiciones": 2,
  "mindis": 2,
  "2000000007": 2,
  "2000000009": 2,
  "locale": 2,
  "cities": 2,
  "alphabetic": 2,
  "srt": 2,
  "declaration": 2,
  "bin": 2,
  "mypow": 2,
  "contant": 2,
  "ouput": 2,
  "al": 2,
  "pirnt": 2,
  "fuck": 2,
  "Pow": 2,
  "pres": 2,
  "minim": 2,
  "issquare": 2,
  "boox": 2,
  "huruf": 2,
  "minimal": 2,
  "iskom": 2,
  "n7": 2,
  "definition": 2,
  "Cmp": 2,
  "sisa": 2,
  "biaoji2": 2,
  "biaoji1": 2,
  "tmpa": 2,
  "tmpb": 2,
  "0000001": 2,
  "3001": 2,
  "10000010": 2,
  "flip": 2,
  "excl": 2,
  "prim": 2,
  "37": 2,
  "reuslt": 2,
  "des": 2,
  "isluck": 2,
  "c8": 2,
  "pow2": 2,
  "product": 2,
  "minsum": 2,
  "snack": 2,
  "92": 2,
  "1000x1000": 2,
  "medals": 2,
  "cups": 2,
  "tank": 2,
  "1200": 2,
  "3010": 2,
  "acum": 2,
  "mybak": 2,
  "dist_sum": 2,
  "oil": 2,
  "timer": 2,
  "CUR": 2,
  "INFLL": 2,
  "Decrease": 2,
  "Run": 2,
  "pred": 2,
  "dir1": 2,
  "dir2": 2,
  "elevator": 2,
  "stairs": 2,
  "stt": 2,
  "data1": 2,
  "data3": 2,
  "data2": 2,
  "references": 2,
  "qi": 2,
  "euqals": 2,
  "mapa": 2,
  "pan": 2,
  "zs": 2,
  "rj": 2,
  "flag_a": 2,
  "isPalindrome": 2,
  "ispalin": 2,
  "mar": 2,
  "maxnum": 2,
  "lat": 2,
  "multiplier": 2,
  "maxt": 2,
  "city": 2,
  "f_ans": 2,
  "8e18": 2,
  "did": 2,
  "salir": 2,
  "bot": 2,
  "writeln": 2,
  "degree": 2,
  "recur": 2,
  "lvl": 2,
  "oldest": 2,
  "ngh": 2,
  "height": 2,
  "subract": 2,
  "esp": 2,
  "diy": 2,
  "dix": 2,
  "stricly": 2,
  "1020": 2,
  "Add": 2,
  "e2": 2,
  "tdiff": 2,
  "rprev": 2,
  "tp3": 2,
  "integet": 2,
  "midTime": 2,
  "workTime": 2,
  "sleepTime": 2,
  "last_time": 2,
  "interval": 2,
  "connected": 2,
  "px": 2,
  "Union": 2,
  "iff": 2,
  "op2": 2,
  "op1": 2,
  "asc": 2,
  "results": 2,
  "reulst": 2,
  "you": 2,
  "execution": 2,
  "epsilon": 2,
  "o_o": 2,
  "10000007": 2,
  "2000000000000000000LL": 2,
  "Vector": 2,
  "files": 2,
  "source": 2,
  "Counter": 2,
  "team": 2,
  "i3": 2,
  "tiga": 2,
  "tot3": 2,
  "5002": 2,
  "pusch": 2,
  "pc": 2,
  "pe": 2,
  "vb": 2,
  "none": 2,
  "trunc": 2,
  "jjj": 2,
  "tres": 2,
  "craete": 2,
  "poss": 2,
  "_i": 2,
  "amigos": 2,
  "rfind": 2,
  "Next": 2,
  "ang": 2,
  "mod2": 2,
  "yy1": 2,
  "ggg": 2,
  "yy2": 2,
  "fim": 2,
  "factors": 2,
  "nhap": 2,
  "Control": 2,
  "203": 2,
  "sequence": 2,
  "3fffffff": 2,
  "intgers": 2,
  "ly": 2,
  "rm": 2,
  "cz": 2,
  "0and": 2,
  "tipe": 2,
  "nama": 2,
  "women": 2,
  "kw": 2,
  "woch": 2,
  "rank": 2,
  "wc": 2,
  "ut": 2,
  "tag": 2,
  "slogan": 2,
  "substrings": 2,
  "inside": 2,
  "exlcusive": 2,
  "srand": 2,
  "modex": 2,
  "permission": 2,
  "divisores": 2,
  "divs": 2,
  "j2": 2,
  "1and": 2,
  "small": 2,
  "vec1": 2,
  "46": 2,
  "apply": 2,
  "flaga": 2,
  "ch3": 2,
  "neo": 2,
  "bills_": 2,
  "wallet": 2,
  "bill": 2,
  "cl": 2,
  "id1": 2,
  "sn": 2,
  "370": 2,
  "800": 2,
  "calculating": 2,
  "valuve": 2,
  "ke": 2,
  "xu_ly": 2,
  "incrment": 2,
  "hap": 2,
  "arr3": 2,
  "raed": 2,
  "sum_v": 2,
  "min_max": 2,
  "test1": 2,
  "sum_n": 2,
  "200025": 2,
  "flage": 2,
  "Freq": 2,
  "token": 2,
  "small_letter": 2,
  "mpu": 2,
  "Doaa": 2,
  "countt": 2,
  "thn": 2,
  "min_cost": 2,
  "000000": 2,
  "9999999999999": 2,
  "testcases": 2,
  "sqr": 2,
  "tests": 2,
  "Y1": 2,
  "Y2": 2,
  "xa": 2,
  "xb": 2,
  "module": 2,
  "hb": 2,
  "t_a": 2,
  "t_b": 2,
  "1415926535": 2,
  "1e1": 2,
  "free": 2,
  "isTrue": 2,
  "declared": 2,
  "z2": 2,
  "calc_subtractions_slow": 2,
  "calc_subtractions_mod": 2,
  "numOps": 2,
  "numPairs": 2,
  "calc_subtractions": 2,
  "calc_subtractions_div": 2,
  "subtractions_solve": 2,
  "numOfTestCases": 2,
  "arg2": 2,
  "arg1": 2,
  "evaluate": 2,
  "modu": 2,
  "ops": 2,
  "3e8": 2,
  "Calc": 2,
  "say": 2,
  "r4": 2,
  "l4": 2,
  "sym": 2,
  "sum0": 2,
  "imp": 2,
  "usa": 2,
  "memo": 2,
  "busca": 2,
  "lp": 2,
  "multidimensional": 2,
  "lenp": 2,
  "andd": 2,
  "printsp": 2,
  "39": 2,
  "har": 2,
  "totalday": 2,
  "otherday": 2,
  "mnth": 2,
  "tfingers": 2,
  "cleaner": 2,
  "fingers": 2,
  "friends": 2,
  "tempo": 2,
  "insertion": 2,
  "in_out_txt": 2,
  "FillArray": 2,
  "matrices": 2,
  "nth": 2,
  "it1": 2,
  "cntc": 2,
  "sec": 2,
  "press": 2,
  "funcion": 2,
  "numberOfElements": 2,
  "sorted": 2,
  "ispalindrome": 2,
  "err": 2,
  "sai": 2,
  "ju": 2,
  "405": 2,
  "inf2": 2,
  "545": 2,
  "4000": 2,
  "sumd": 2,
  "besar": 2,
  "kecil": 2,
  "amazing": 2,
  "jwb": 2,
  "123456": 2,
  "maxval": 2,
  "minval": 2,
  "banyakpear": 2,
  "banyakapel": 2,
  "banyaklemon": 2,
  "tempb": 2,
  "tempa": 2,
  "tempc": 2,
  "years": 2,
  "limak": 2,
  "shengyu": 2,
  "tl": 2,
  "sumi": 2,
  "sized": 2,
  "iii": 2,
  "wynik": 2,
  "stat": 2,
  "y0": 2,
  "selection_insert": 2,
  "200500": 2,
  "file_put": 2,
  "_cnt": 2,
  "_p": 2,
  "filename": 2,
  "bf": 2,
  "ww": 2,
  "1to": 2,
  "MOD1": 2,
  "14159265358979323846264338": 2,
  "qiu": 2,
  "candidate": 2,
  "deq": 2,
  "maxr": 2,
  "minr": 2,
  "accumulate": 2,
  "cmx": 2,
  "cmn": 2,
  "gmax": 2,
  "Ma": 2,
  "inc": 2,
  "cmax": 2,
  "try": 2,
  "throw": 2,
  "mint": 2,
  "great": 2,
  "pearls": 2,
  "bul": 2,
  "dos_a_la": 2,
  "300001": 2,
  "5e2": 2,
  "toUpp": 2,
  "signal": 2,
  "bohlam": 2,
  "blyat": 2,
  "bulbs": 2,
  "pint": 2,
  "0x7f7f7f7f": 2,
  "num_p": 2,
  "matches": 2,
  "uu": 2,
  "1E": 2,
  "000001": 2,
  "mayor": 2,
  "dot": 2,
  "intp": 2,
  "size_y": 2,
  "size_x": 2,
  "difference": 2,
  "2500": 2,
  "lat2": 2,
  "smol": 2,
  "pans": 2,
  "lat1": 2,
  "2501": 2,
  "exclusvie": 2,
  "tmp_ans": 2,
  "13579aeiou": 2,
  "5011": 2,
  "5100": 2,
  "i01": 2,
  "rb": 2,
  "vr": 2,
  "Dp": 2,
  "8e16": 2,
  "502": 2,
  "510": 2,
  "suck": 2,
  "Loop": 2,
  "successful": 2,
  "cons": 2,
  "paint": 2,
  "654": 2,
  "Chess": 2,
  "countr": 2,
  "dg": 2,
  "self": 2,
  "cost1": 2,
  "cost2": 2,
  "GRAPH": 2,
  "cycle": 2,
  "glong": 2,
  "pairt": 2,
  "pairsort": 2,
  "allocate": 2,
  "ck1": 2,
  "jmax": 2,
  "jmin": 2,
  "ite": 2,
  "ansy": 2,
  "rean": 2,
  "car": 2,
  "joined": 2,
  "esq": 2,
  "x_1": 2,
  "the_same": 2,
  "ask": 2,
  "postdecrement": 2,
  "s6": 2,
  "tedad": 2,
  "@": 2,
  "lengh": 2,
  "javab": 2,
  "spc": 2,
  "Null": 2,
  "soroban": 2,
  "six": 2,
  "getNum": 2,
  "7th": 2,
  "9th": 2,
  "8th": 2,
  "diag": 2,
  "dims": 2,
  "o2": 2,
  "secOventime": 2,
  "fristOven": 2,
  "o1": 2,
  "sum4": 2,
  "td": 2,
  "nown": 2,
  "cake": 2,
  "borrow": 2,
  "ndmny": 2,
  "rate": 2,
  "stdou": 2,
  "intger": 2,
  "allAreSame": 2,
  "righ": 2,
  "ex1": 2,
  "111111": 2,
  "320": 2,
  "68": 2,
  "tota": 2,
  "much": 2,
  "mnt": 2,
  "Q_pow": 2,
  "nilai": 2,
  "among": 2,
  "chara": 2,
  "mark_idx": 2,
  "send_size": 2,
  "mygets": 2,
  "symbol": 2,
  "frq": 2,
  "charnum": 2,
  "charsum": 2,
  "olnum": 2,
  "count_now": 2,
  "tempm": 2,
  "tempn": 2,
  "maxle": 2,
  "Names": 2,
  "sir": 2,
  "conditions": 2,
  "sub1": 2,
  "sub2": 2,
  "raw": 2,
  "drinks": 2,
  "mn3": 2,
  "mx3": 2,
  "sam": 2,
  "mi2": 2,
  "sequentially": 2,
  "M1": 2,
  "100000000000000": 2,
  "resta": 2,
  "300009": 2,
  "inegers": 2,
  "close": 2,
  "XXXS": 2,
  "XXL": 2,
  "XXXL": 2,
  "XXS": 2,
  "XS": 2,
  "XL": 2,
  "1110": 2,
  "2n": 2,
  "lengths": 2,
  "stp": 2,
  "adder": 2,
  "15000": 2,
  "1000008": 2,
  "accepting": 2,
  "_c": 2,
  "8LL": 2,
  "set2": 2,
  "mc1": 2,
  "set1": 2,
  "malloc_2": 2,
  "malloc_1": 2,
  "mc2": 2,
  "map2": 2,
  "dataa": 2,
  "itung": 2,
  "leaves": 2,
  "alana": 2,
  "strr": 2,
  "pict": 2,
  "flat": 2,
  "kmax": 2,
  "_max": 2,
  "suf": 2,
  "target": 2,
  "getstring": 2,
  "walk": 2,
  "introduce": 2,
  "uni": 2,
  "chk": 2,
  "feet": 2,
  "foot": 2,
  "mot": 2,
  "linha0": 2,
  "linha2": 2,
  "linha1": 2,
  "multiplos": 2,
  "MODPRIMA": 2,
  "wl": 2,
  "coin": 2,
  "bucket": 2,
  "coun1": 2,
  "coun2": 2,
  "mapper": 2,
  "simulate": 2,
  "202": 2,
  "un": 2,
  "While": 2,
  "bracket": 2,
  "mcd": 2,
  "maxsec": 2,
  "capacity": 2,
  "boxes": 2,
  "10007": 2,
  "newnut": 2,
  "taka": 2,
  "wrong": 2,
  "num7": 2,
  "num4": 2,
  "eaten": 2,
  "colCount": 2,
  "rowCount": 2,
  "lenghts": 2,
  "1008": 2,
  "passed": 2,
  "banyak": 2,
  "fifth": 2,
  "fourth": 2,
  "LCA": 2,
  "finish": 2,
  "gotodown": 2,
  "gotoup": 2,
  "et": 2,
  "hotels": 2,
  "Inf": 2,
  "cond": 2,
  "voters": 2,
  "dq": 2,
  "newint": 2,
  "yx": 2,
  "horizontal": 2,
  "vertical": 2,
  "foo": 2,
  "kiri": 2,
  "arary": 2,
  "jumlah": 2,
  "Sum": 2,
  "cube": 2,
  "face": 2,
  "a6": 2,
  "a5": 2,
  "lexicographically": 2,
  "tstep": 2,
  "sign_X": 2,
  "sign_Y": 2,
  "Way": 2,
  "endless": 2,
  "d_x": 2,
  "c_x": 2,
  "c_y": 2,
  "d_y": 2,
  "destination": 2,
  "rlmoves": 2,
  "udmoves": 2,
  "endx": 2,
  "endy": 2,
  "yd": 2,
  "xd": 2,
  "xf": 2,
  "yf": 2,
  "inccrement": 2,
  "hi2": 2,
  "minimun": 2,
  "LL": 2,
  "yu": 2,
  "pm": 2,
  "ppow": 2,
  "MODULO": 2,
  "cut": 2,
  "minstep": 2,
  "001e3": 2,
  "vec2": 2,
  "MAT": 2,
  "888888": 2,
  "uper": 2,
  "lowar": 2,
  "finishy": 2,
  "finishx": 2,
  "demx": 2,
  "bao1": 2,
  "hangx": 2,
  "demy": 2,
  "coty": 2,
  "bao2": 2,
  "xaydung": 2,
  "chodoi": 2,
  "4409": 2,
  "4999": 2,
  "ymax": 2,
  "ymin": 2,
  "xmin": 2,
  "minj": 2,
  "maxj": 2,
  "rd": 2,
  "ld": 2,
  "row_min": 2,
  "row_max": 2,
  "end_x": 2,
  "start_y": 2,
  "end_y": 2,
  "start_x": 2,
  "minRow": 2,
  "maxRow": 2,
  "sheet": 2,
  "minCol": 2,
  "maxCol": 2,
  "y4": 2,
  "cnt_1": 2,
  "ie": 2,
  "56": 2,
  "mov2": 2,
  "mov1": 2,
  "isPowerOfTwo": 2,
  "ture": 2,
  "fin1": 2,
  "geek": 2,
  "geek1": 2,
  "I00": 2,
  "tan": 2,
  "page": 2,
  "cns": 2,
  "ni": 2,
  "arx": 2,
  "ary": 2,
  "ou": 2,
  "3x3": 2,
  "whose": 2,
  "getPossibilities": 2,
  "delare": 2,
  "slice": 2,
  "limes": 2,
  "nnl": 2,
  "nnp": 2,
  "kl": 2,
  "toast": 2,
  "lime": 2,
  "sal": 2,
  "vol": 2,
  "BIT": 2,
  "phi": 2,
  "0x3fffffff": 2,
  "mostrar": 2,
  "difficulty": 2,
  "fr": 2,
  "tambah": 2,
  "minIncl": 2,
  "maxExcl": 2,
  "50000": 2,
  "era": 2,
  "cry": 2,
  "removeZeros": 2,
  "myMap": 2,
  "ciel": 2,
  "2e7": 2,
  "INT32M": 2,
  "0X3F3F3F3F3F3F3F3F": 2,
  "INT64M": 2,
  "0x3F3F3F3F": 2,
  "dead": 2,
  "manx": 2,
  "nod": 2,
  "numero": 2,
  "609": 2,
  "101000": 2,
  "sor": 2,
  "1ULL": 2,
  "perform": 2,
  "strgro": 2,
  "gro": 2,
  "strunity": 2,
  "isgro": 2,
  "fathercnt": 2,
  "maxgro": 2,
  "maxfather": 2,
  "isHome": 2,
  "uion": 2,
  "202002": 2,
  "findfa": 2,
  "newest": 2,
  "interator": 2,
  "113": 2,
  "141592653589793": 2,
  "1e14": 2,
  "consider": 2,
  "pair1": 2,
  "encontrado": 2,
  "cel": 2,
  "brute_force": 2,
  "oldai": 2,
  "im": 2,
  "beginat": 2,
  "max_idx": 2,
  "relax": 2,
  "succ": 2,
  "nadj": 2,
  "whichPosn": 2,
  "makeChanges": 2,
  "thisChar": 2,
  "safe": 2,
  "ant2": 2,
  "getChar": 2,
  "termina": 2,
  "ALPH": 2,
  "ant1": 2,
  "kg": 2,
  "fit": 2,
  "pointing": 2,
  "quick_pow": 2,
  "ncr": 2,
  "bn": 2,
  "Yellow": 2,
  "made": 2,
  "79": 2,
  "comb": 2,
  "fac": 2,
  "Do": 2,
  "~": 2,
  "g2": 2,
  "g1": 2,
  "division": 2,
  "finall": 2,
  "rts": 2,
  "8000": 2,
  "lane": 2,
  "pen": 2,
  "lft": 2,
  "elseif": 2,
  "chance": 2,
  "pembagi": 2,
  "die_roll": 2,
  "st1": 2,
  "mCount": 2,
  "cCount": 2,
  "Magic": 2,
  "INF64": 2,
  "130": 2,
  "met": 2,
  "indpar": 2,
  "nimpar": 2,
  "indimpar": 2,
  "impar": 2,
  "npar": 2,
  "sumeven": 2,
  "sumodd": 2,
  "Noofintersectionsleft": 2,
  "query": 2,
  "SZ": 2,
  "func1": 2,
  "girl": 2,
  "boy": 2,
  "XOR": 2,
  "checks": 2,
  "qua": 2,
  "tramp": 2,
  "trump": 2,
  "fpb": 2,
  "ib": 2,
  "occ": 2,
  "reverseStr": 2,
  "ES": 2,
  "fff": 2,
  "ivmind": 2,
  "crearCriba": 2,
  "criba": 2,
  "vn": 2,
  "odds": 2,
  "ganjil": 2,
  "jumlahgenap": 2,
  "jumlahganjil": 2,
  "banyakganjil": 2,
  "ganjilterkecil": 2,
  "soma": 2,
  "maxName": 2,
  "plus1": 2,
  "vow": 2,
  "$": 2,
  "inserted": 2,
  "per": 2,
  "ifprime": 2,
  "primos": 2,
  "primo": 2,
  "prevI": 2,
  "noldbach": 2,
  "nextPrimeNum": 2,
  "168": 2,
  "putprime": 2,
  "isNoldPrime": 2,
  "87": 2,
  "CalculatePrimes": 2,
  "zzzzzzzzzz": 2,
  "nok": 2,
  "INP": 2,
  "351A": 2,
  "OUT": 2,
  "all_present": 2,
  "cdays": 2,
  "flights": 2,
  "Getint": 2,
  "comp1": 2,
  "comp2": 2,
  "awal": 2,
  "exchange": 2,
  "pad": 2,
  "524289": 2,
  "find_first_not_of": 2,
  "isPrimeRoot": 2,
  "rtn": 2,
  "2200": 2,
  "gesture": 2,
  "bst": 2,
  "rotate2": 2,
  "rotate1": 2,
  "rotate3": 2,
  "rot2": 2,
  "permutation": 2,
  "prevr": 2,
  "prevc": 2,
  "perRowColor": 2,
  "perColor": 2,
  "iso": 2,
  "chrColor": 2,
  "last_stripe": 2,
  "current_stripe": 2,
  "score1": 2,
  "score2": 2,
  "olds": 2,
  "gy": 2,
  "gx": 2,
  "maap": 2,
  "avai": 1,
  "getmax": 1,
  "cheapest": 1,
  "kount": 1,
  "eat": 1,
  "110000": 1,
  "min_price": 1,
  "pmin": 1,
  "prise": 1,
  "min_p": 1,
  "avg": 1,
  "cakked": 1,
  "emp": 1,
  "port": 1,
  "llega": 1,
  "reach": 1,
  "integeer": 1,
  "nPr": 1,
  "lonng": 1,
  "letting": 1,
  "strcpy": 1,
  "n1a": 1,
  "n2a": 1,
  "sir1": 1,
  "sir2": 1,
  "killed": 1,
  "iinf": 1,
  "dinf": 1,
  "readind": 1,
  "na2": 1,
  "na1": 1,
  "copies": 1,
  "crete": 1,
  "pot1": 1,
  "vict": 1,
  "pot2": 1,
  "pod": 1,
  "pod1": 1,
  "to_be_replaced": 1,
  "replaced_by": 1,
  "res_arr": 1,
  "b0": 1,
  "a0": 1,
  "replacement": 1,
  "death": 1,
  "setIO": 1,
  "exclusivem": 1,
  "isitright": 1,
  "rtr": 1,
  "unfortunate": 1,
  "banknotes": 1,
  "_r": 1,
  "string_to_number": 1,
  "powermod": 1,
  "shif": 1,
  "_a": 1,
  "_m": 1,
  "neg": 1,
  "lista": 1,
  "t_turn": 1,
  "cross": 1,
  "resuse": 1,
  "turnsDone": 1,
  "sii": 1,
  "oldstr": 1,
  "orgStr": 1,
  "revStr": 1,
  "myAss": 1,
  "CountNum": 1,
  "mulitple": 1,
  "total_cov": 1,
  "offset": 1,
  "offset2": 1,
  "dist_len": 1,
  "toString": 1,
  "cmpfunc": 1,
  "pow_mod": 1,
  "4x4": 1,
  "numbers_total": 1,
  "rip": 1,
  "lcp": 1,
  "phnum": 1,
  "build": 1,
  "common_prefix": 1,
  "chk_all": 1,
  "minMatch": 1,
  "ves": 1,
  "marker": 1,
  "CityCode": 1,
  "Solution": 1,
  "PhoneArray": 1,
  "ProduceCode": 1,
  "sumu": 1,
  "1000020": 1,
  "sumtp": 1,
  "sumdn": 1,
  "exxclusive": 1,
  "sum_u": 1,
  "sum_l": 1,
  "sum_1": 1,
  "bnt": 1,
  "sumpar": 1,
  "sumimpar": 1,
  "asum": 1,
  "bsum": 1,
  "1006": 1,
  "dynamic": 1,
  "x3f": 1,
  "ip": 1,
  "noth": 1,
  "arr_i": 1,
  "0x3c3c3c": 1,
  "distl": 1,
  "Exit": 1,
  "distr": 1,
  "MIN1": 1,
  "las": 1,
  "house": 1,
  "tabeSize": 1,
  "il": 1,
  "multiplication": 1,
  "uno": 1,
  "der": 1,
  "paila": 1,
  "executed": 1,
  "nomer": 1,
  "dividng": 1,
  "find_max": 1,
  "vashya": 1,
  "c0c0c0c0": 1,
  "contV": 1,
  "contM": 1,
  "mpoints": 1,
  "vpoints": 1,
  "Vtime": 1,
  "Vcost": 1,
  "Mcost": 1,
  "Mtime": 1,
  "done2": 1,
  "bm": 1,
  "cyc": 1,
  "tn": 1,
  "ITER": 1,
  "100000007": 1,
  "losn": 1,
  "PR": 1,
  "RR": 1,
  "nike": 1,
  "PP": 1,
  "RP": 1,
  "SR": 1,
  "concatenate": 1,
  "PS": 1,
  "losp": 1,
  "RS": 1,
  "dp2": 1,
  "bark": 1,
  "nCrModp": 1,
  "getDivisors": 1,
  "vt": 1,
  "lla": 1,
  "increent": 1,
  "who": 1,
  "Loses": 1,
  "loser": 1,
  "nak": 1,
  "sumpp": 1,
  "max0": 1,
  "ensure": 1,
  "lnog": 1,
  "numsheets": 1,
  "accuracy": 1,
  "numpacks": 1,
  "mceil": 1,
  "kek": 1,
  "2999999999ll": 1,
  "enter": 1,
  "1000000004": 1,
  "jav": 1,
  "Check": 1,
  "Khela_Hobe": 1,
  "mode2": 1,
  "mode1": 1,
  "priint": 1,
  "gcdNum": 1,
  "0x7fffffffffffffff": 1,
  "tinf": 1,
  "displayed": 1,
  "utilize": 1,
  "zuo": 1,
  "contstant": 1,
  "recude": 1,
  "god": 1,
  "stirng": 1,
  "hex": 1,
  "elem": 1,
  "whith": 1,
  "esVocal": 1,
  "isyuan": 1,
  "lenn": 1,
  "9e5": 1,
  "66666": 1,
  "mac": 1,
  "NaNarray": 1,
  "nin": 1,
  "forj": 1,
  "1o": 1,
  "nul": 1,
  "modinv": 1,
  "2012345678": 1,
  "mxaN": 1,
  "misa": 1,
  "stu": 1,
  "incusive": 1,
  "sww": 1,
  "mejor": 1,
  "presented": 1,
  "students": 1,
  "legth": 1,
  "wasBest": 1,
  "isBest": 1,
  "second_points": 1,
  "second_team": 1,
  "first_team": 1,
  "first_points": 1,
  "team2": 1,
  "team1": 1,
  "bshu": 1,
  "ashu": 1,
  "scoreb": 1,
  "scorea": 1,
  "RPS": 1,
  "bpi": 1,
  "wb": 1,
  "bla": 1,
  "win2": 1,
  "win1": 1,
  "tone": 1,
  "rps": 1,
  "ttwo": 1,
  "who_wins": 1,
  "Red": 1,
  "Green": 1,
  "decremeny": 1,
  "look": 1,
  "endapp": 1,
  "timeOfEnding": 1,
  "200000000008": 1,
  "20000000": 1,
  "dist1": 1,
  "bye": 1,
  "Russian": 1,
  "entire": 1,
  "pcount": 1,
  "min_dist": 1,
  "2000000005": 1,
  "valoe": 1,
  "200200": 1,
  "Is_here": 1,
  "charArray": 1,
  "inta": 1,
  "rray": 1,
  "username": 1,
  "past": 1,
  "Remove": 1,
  "Otherwiase": 1,
  "adjacent": 1,
  "user_num": 1,
  "uniqueCharacters": 1,
  "already": 1,
  "301002": 1,
  "keyword": 1,
  "maxPrimeFactors": 1,
  "bin_gen": 1,
  "maxPrime": 1,
  "temmp": 1,
  "bitshifting": 1,
  "checkValidity": 1,
  "MAXP": 1,
  "under_root": 1,
  "min_cnt": 1,
  "whle": 1,
  "alp": 1,
  "casenum": 1,
  "260": 1,
  "aint": 1,
  "Pic": 1,
  "Checking": 1,
  "isInn": 1,
  "isFace": 1,
  "tttt": 1,
  "fe": 1,
  "fc": 1,
  "2333": 1,
  "reqd": 1,
  "hush": 1,
  "dick": 1,
  "dhurr": 1,
  "inserts": 1,
  "bag": 1,
  "200300": 1,
